{
  "tradition": "Cornelius Agrippa",
  "sourceText": "Three Books of Occult Philosophy (De Occulta Philosophia libri III, 1531/1533). Book I: natural correspondences (Ch. 23–29, 44, 49). Book II: magic squares, intelligences, spirits (Ch. 22). Book III: planetary angels.",
  "period": "1531 (manuscript circulated from 1510)",
  "origin": "tradition",
  "entered": "2026-02-24",
  "method": "dictation",
  "order": "chaldean",
  "centerModel": "geocentric",
  "zodiacFrame": "tropical",
  "note": "Agrippa compiled the most comprehensive Renaissance correspondence tables, synthesizing Pliny, Ptolemy, Picatrix, Ficino, Pico della Mirandola, Reuchlin, and Kabbalistic sources into a single integrated system spanning three levels of reality: natural (Book I), celestial (Book II), and divine/angelic (Book III). The correspondences are mostly traditional; what Agrippa contributed was the architecture — the idea that a single table could span from mineral to angel, from incense to gematria, expressing a unified cosmic structure. The Golden Dawn, Crowley's Liber 777, and modern planetary magic are all downstream of this system. He is the Renaissance junction point: classical and medieval lore flows in; modern occultism flows out.",
  "correspondences": {
    "Saturn": {
      "number": 1,
      "classicalPlanet": "Saturn",
      "metal": "Lead",
      "stone": "Onyx, sapphire, brown jasper, chalcedony, lodestone — all dark, heavy, earthy stones (I.25)",
      "plant": "Daffodil, dragonwort, rue, cumin, hellebore, mandrake, opium; trees: black fig, pine, cypress (I.25)",
      "animal": "Mole, ass, wolf, hare, bear, toad, cat, hog, camel, basilisk, ape, dragon, serpents, scorpions, ants (I.25)",
      "planetaryColor": "Black, leaden, dark brown, earthy (I.49)",
      "incense": "All odoriferous roots — pepperwort root, frankincense tree, costus (I.44)",
      "angel": "Zaphkiel (Tzaphqiel) (III)",
      "intelligence": "Agiel — gematria value 45, equal to the total sum of the 3×3 magic square (II.22)",
      "spirit": "Zazel — gematria value 45 (II.22)",
      "magicSquare": "3×3, numbers 1–9. Row sum: 15. Total: 45. The smallest and most constrained square — one unique solution (II.22)",
      "bodyPart": "Right ear; also liver, fleshy part of stomach, spleen, bones, teeth, skin (I.22, citing Hermes and Ptolemy)",
      "character": "Conduces to sadness and melancholy. Saturnine temperament: contemplative, solitary, laborious, austere. Long memory, deep thought, obstinate resolve — but also heaviness, envy, suspicion, fearfulness (I.25)"
    },
    "Jupiter": {
      "number": 2,
      "classicalPlanet": "Jupiter",
      "metal": "Tin (also silver and gold participate) (I.26)",
      "stone": "Sapphire, beryl, emerald, green jasper, hyacinth — all green and airy-colored stones (I.26)",
      "plant": "Basil, bugloss, mace, spike, mint, mastic, elecampane, violet, peony root; trees: oak, beech, hazel, olive, poplar, vine (I.26)",
      "animal": "Hart (stag), elephant, sheep, lamb; the eagle (emblem of justice and clemency); dolphin, peacock, stork (I.26)",
      "planetaryColor": "Sapphire blue, airy colors, green, clear purple, darkish golden mixed with silver; citrine near paleness (I.49)",
      "incense": "All odoriferous fruits — nutmeg, cloves (I.44)",
      "angel": "Zadkiel (Tzadqiel) (III)",
      "intelligence": "Johphiel — gematria value 136, equal to the total sum of the 4×4 square (II.22)",
      "spirit": "Hismael — gematria value 136 (II.22)",
      "magicSquare": "4×4, numbers 1–16. Row sum: 34. Total: 136. Includes the famous Dürer arrangement (II.22)",
      "bodyPart": "Left ear; also ribs, breast, bowels, blood, arms, right hand; liver per some authorities (I.22)",
      "character": "Conduces to mirth, honor, goodwill, benevolence. Jovial temperament: magnanimous, just, temperate, honest, faithful, given to religion and civil government. Gain, riches, favor, love, peace, concord (I.26)"
    },
    "Mars": {
      "number": 3,
      "classicalPlanet": "Mars",
      "metal": "Iron — also red brass, all fiery or sulfurous things (I.27)",
      "stone": "Diamond, lodestone, bloodstone, red jasper, amethyst — all of strong fiery or bloody color (I.27)",
      "plant": "Hellebore, garlic, radish, laurel/bay, wolfsbane, euphorbium, nettles, onions, leeks, mustard-seed — all prickly, poisonous, or causing tears and burning (I.27)",
      "animal": "Horse, mule, goat, wolf — warlike, ravenous, bold creatures; serpents and dragons; vulture, kite, hawk; among fish: pike (I.27)",
      "planetaryColor": "Red, burning, fiery, flaming; also violet, purple, bloody, iron-colored (I.49)",
      "incense": "All odoriferous woods — sanders (sandalwood), cypress, lignum balsam, lignum aloes (I.44)",
      "angel": "Camael (Kammael) (III)",
      "intelligence": "Graphiel — gematria value 325, equal to the total sum of the 5×5 square (II.22)",
      "spirit": "Barzabel (Bartzabel) — gematria value 325 (II.22)",
      "magicSquare": "5×5, numbers 1–25. Row sum: 65. Total: 325 (II.22)",
      "bodyPart": "Right nostril; also blood, veins, kidneys, gall bladder, buttocks, the back (I.22)",
      "character": "Conduces to boldness, contention, anger. Martial temperament: fierce, audacious, violent — but also courage, fortitude, capacity for command. Potent in war, judgments, petitions (I.27)"
    },
    "Sun": {
      "number": 4,
      "classicalPlanet": "Sun",
      "metal": "Gold (I.23)",
      "stone": "Carbuncle (shines by night), chrysolite, heliotrope, hyacinth, topaz, ruby, balas ruby — all golden-sparkling stones (I.23)",
      "plant": "Marigold (calendula), bay tree, heliotrope (sunflower), peony, celandine, balm, ginger, gentian, dittany, vervain; trees: cedar, palm, ash, ivy, vine (I.23)",
      "animal": "Phoenix, eagle, vulture, swan; the lion; the ram, the horse; birds that sing at sunrise; the sea-calf (I.23)",
      "planetaryColor": "Golden, saffron, bright yellow; also purple and bright colors. Rising: red; afterward: glittering (I.49)",
      "incense": "All gums — frankincense, mastic, benzoin, storax, ladanum, ambergris, musk; saffron. Full suffumigation: saffron, ambergris, musk, lignum aloes, lignum balsam, laurel fruit, cloves, myrrh, frankincense (I.44)",
      "angel": "Raphael (III)",
      "intelligence": "Nachiel (Nakhiel) — gematria value 111, equal to the row sum of the 6×6 square (II.22)",
      "spirit": "Sorath — gematria value 666, equal to the total sum of the 6×6 square. The number of the Sun's spirit became the 'number of the beast' — a telling example of how solar spirits were recoded as demonic (II.22)",
      "magicSquare": "6×6, numbers 1–36. Row sum: 111. Total: 666 (II.22)",
      "bodyPart": "Right eye; also heart, brain, thigh, marrow; tongue and mouth per some authorities; the spirit (vital force) (I.22)",
      "character": "Conduces to glory, victory, courage. Solar temperament: noble, magnanimous, generous, inclined to fame and honor. Renowned, amiable, potent in all works. Light, clarity, truth (I.23)"
    },
    "Venus": {
      "number": 5,
      "classicalPlanet": "Venus",
      "metal": "Copper — also brass (I.28)",
      "stone": "Beryl, chrysolite, emerald, sapphire, green jasper, carnelian, lapis lazuli, coral — all fair, white, and green stones (I.28)",
      "plant": "Vervain (verbena), violet, maidenhair fern, valerian, rose, myrtle, thyme, coriander; fruits: pears, figs, pomegranates; ladanum, ambergris, red sandalwood (I.28)",
      "animal": "Dog, rabbit, sheep, goat (fecundity); bull (disdain), calf (wantonness); doves, sparrows, wagtails, swallows; among fish: pilchard, gilt-head (I.28)",
      "planetaryColor": "White, fair, green, ruddy; betwixt saffron and purple; white and shining in morning, reddish in evening (I.49)",
      "incense": "Sweet flowers — roses, violets, saffron (I.44)",
      "angel": "Haniel (Anael) (III)",
      "intelligence": "Hagiel — gematria value 49, equal to the number of cells in the 7×7 square (II.22)",
      "spirit": "Kedemel — gematria value 157. Also: Bne Seraphim (Intelligences of Venus collectively), gematria 1252 (II.22)",
      "magicSquare": "7×7, numbers 1–49. Row sum: 175. Total: 1225 (II.22)",
      "bodyPart": "Left nostril; also kidneys, genitals, womb, seed, flesh, belly, breast, navel, loins, backbone (I.22)",
      "character": "Conduces to love, lust, concupiscence. Venusian temperament: pleasant, beautiful, joyful. Procures concord, love, conception, fruitfulness. Music, festivity, artistic pleasure (I.28)"
    },
    "Mercury": {
      "number": 6,
      "classicalPlanet": "Mercury",
      "metal": "Quicksilver (mercury) (I.29)",
      "stone": "Emerald, agate, red marble, topaz — stones of diverse colors and various figures naturally occurring (I.29)",
      "plant": "Cinquefoil (five-leaf grass), mullein, fumitory — herbs of subtle and mixed natures; trees: hazel and others bearing mixed fruits (I.29)",
      "animal": "Dog, ape, fox, weasel, hart, mule — animals of quick sense, ingenious, inconstant, swift; those easily acquainted with men; animals that change sex (hare, civet-cat); birds: linnet, parrot, ibis (I.29)",
      "planetaryColor": "Mixed, glittering, diverse — colors compounded of many colors together (I.49)",
      "incense": "All peels of wood and fruit — cinnamon, cassia, mace, citron peel, lemon peel, bayberries; whatever seeds are odoriferous (I.44)",
      "angel": "Michael (III)",
      "intelligence": "Tiriel — gematria value 260, equal to the row sum of the 8×8 square (II.22)",
      "spirit": "Taphthartharath — gematria value 2080, equal to the total sum of the 8×8 square (II.22)",
      "magicSquare": "8×8, numbers 1–64. Row sum: 260. Total: 2080. The 8×8 grid mirrors the chess board — Mercury rules games of strategy (II.22)",
      "bodyPart": "Mouth; also spleen, stomach, bladder; right ear per some authorities. Mouth is the primary Hermetic attribution (I.22)",
      "character": "Conduces to eloquence. Mercurial temperament: versatile, cunning, ingenious, quick-witted, given to arts and sciences. Benefits gain, memory, understanding, divination, occult knowledge. Travel, commerce, communication (I.29)"
    },
    "Moon": {
      "number": 7,
      "classicalPlanet": "Moon",
      "metal": "Silver (I.24)",
      "stone": "Crystal, silver marcasite, selenite (moonstone — waxes and wanes with the actual Moon); all white and green stones; pearl and beryl (I.24)",
      "plant": "Selenotropion (turns toward the Moon), palm tree (sends forth a bough at every new Moon), white poppy, peony; willow and all plants near water; lettuce, cucumber, melon, all gourds (I.24)",
      "animal": "Creatures following the Moon — tortoise, crabs, oysters, cockles, frogs, remora; cat, duck, goose; fish that follow the tides (I.24)",
      "planetaryColor": "White, silvery, pale green; fair (I.49)",
      "incense": "Leaves of all vegetables — leaf indum, myrtle leaves, bay leaves; seed of white poppy (I.44)",
      "angel": "Gabriel (III)",
      "intelligence": "Malkah be-Tharshisim ve-ad be-Ruachoth Shechalim — gematria value 3321, equal to total sum of the 9×9 square (II.22)",
      "spirit": "Schad Barschemoth ha-Shartathan — gematria 3321. Simple spirit: Chasmodai, value 369, equal to row sum (II.22)",
      "magicSquare": "9×9, numbers 1–81. Row sum: 369. Total: 3321. The largest and most complex of the seven squares — the Moon encompasses the most variation (II.22)",
      "bodyPart": "Left eye; also brain, lungs, marrow of backbone, stomach, menstrual and excretory parts; governs the power of growth (I.22)",
      "character": "Conduces to travelers' security and pleasant journeys. Lunar temperament: changeable, receptive, imaginative, given to common life and practical affairs. Grateful, amiable, pleasant, honored. Fertility, cycles, growth and decay (I.24)"
    }
  },
  "authorCommentary": []
}
