{
  "tradition": "Hellenistic Astrology (Ptolemy)",
  "sourceText": "Ptolemy, Tetrabiblos (c. 150 CE); Vettius Valens, Anthologiae (c. 175 CE); Dorotheus of Sidon (1st c CE); Paulus Alexandrinus (4th c CE)",
  "period": "3rd century BCE – 5th century CE (Ptolemy: c. 150 CE)",
  "origin": "tradition",
  "entered": "2026-02-24",
  "method": "dictation",
  "order": "ascending",
  "note": "The Hellenistic planetary system codified what became the foundation of all Western astrology. Ptolemy grounded planetary effects in Aristotelian physics — four qualities (hot, cold, wet, dry) — rather than divine will. His Tetrabiblos systematized the essential dignities (domicile, exaltation, detriment, fall) and organized planets into diurnal and nocturnal sects. Vettius Valens, a contemporary practitioner, provides richer character descriptions and practical delineation. The metal correspondences come from the parallel Greco-Egyptian alchemical tradition rather than from Ptolemy's text directly. Together these sources define the classical framework that everything from medieval Arabic astrology to the Golden Dawn inherited.",
  "correspondences": {
    "Moon": {
      "number": 1,
      "classicalPlanet": "Moon",
      "metal": "Silver",
      "deity": "Selene",
      "astronomicalName": "Selene (the Moon)",
      "elementalQuality": "Cold and moist — the Moon's proximity to Earth and the moist exhalations surrounding it give it a predominantly moistening nature (Tetrabiblos I.4)",
      "sect": "Nocturnal — the Moon is the sect light of the night, defining the nocturnal sect as the Sun defines the diurnal",
      "domicile": "Cancer",
      "exaltation": "Taurus (at 3°)",
      "detriment": "Capricorn",
      "fall": "Scorpio",
      "bodyPart": "Left eye (in a man), the stomach, the womb, the left side of the body, all moist or fluid functions (Tetrabiblos III.12)",
      "character": "Governs the body and physical constitution, growth and decay, the mother, the common people. Signifies change, travel, everyday conditions of life (Ptolemy). Valens: the mother, nurture, the body, the queen, fortune, the city, voyages, wanderings, and all things mutable and changeable.",
      "significations": "Mother, nurture, the body, the queen, fortune, the city, assembly of the people, voyages, wanderings, growth and decay, reception and nourishment (Valens, Anthologiae I.1)"
    },
    "Mercury": {
      "number": 2,
      "classicalPlanet": "Mercury",
      "metal": "Quicksilver",
      "deity": "Hermes",
      "astronomicalName": "Stilbon ('the glittering one')",
      "elementalQuality": "Variable — neither consistently hot nor cold, dry nor moist. Changes nature according to its relation to other planets and the Sun. Near the Sun it dries; away it moistens. Fundamentally mutable and convertible (Tetrabiblos I.4)",
      "sect": "Common to both sects — joins whichever sect it is configured with. Morning star = diurnal; evening star = nocturnal",
      "domicile": "Gemini and Virgo",
      "exaltation": "Virgo (at 15°) — uniquely, Mercury's exaltation is in one of its own domiciles",
      "detriment": "Sagittarius and Pisces",
      "fall": "Pisces",
      "bodyPart": "The tongue, hands, fingers, joints, intestines, and the sense of hearing (Tetrabiblos III.12)",
      "character": "Well-placed: intelligent, inventive, scholarly, articulate. Poorly placed: crafty, deceitful, forgetful, impulsive, prone to thievery and perjury (Ptolemy). Valens: education, letters, disputation, reasoning, brotherhood, interpretation, commerce, accounting, geometry, astronomy, theft, falsehood, cleverness.",
      "significations": "Education, letters, disputation, reasoning, brotherhood, messaging, commerce, accounting, geometry, astronomy, exchange, theft, falsehood — the star of all intellectual and communicative faculties (Valens, Anthologiae I.1)"
    },
    "Venus": {
      "number": 3,
      "classicalPlanet": "Venus",
      "metal": "Copper",
      "deity": "Aphrodite",
      "astronomicalName": "Phosphoros ('light-bearer', morning star) / Hesperos (evening star)",
      "elementalQuality": "Hot and moist (primarily moist) — temperate and generative, more moist than Jupiter because of exhalations from the sublunary sphere and proximity to both Sun and Moon (Tetrabiblos I.4)",
      "sect": "Nocturnal — the nocturnal benefic, the lesser benefic, functioning most favorably in a night chart",
      "domicile": "Taurus and Libra",
      "exaltation": "Pisces (at 27°)",
      "detriment": "Scorpio and Aries",
      "fall": "Virgo",
      "bodyPart": "The sense of smell, the liver (shared with Jupiter), the flesh generally, reproductive organs particularly female (Tetrabiblos III.12)",
      "character": "Well-placed: gracious, elegant, joyful, fond of dance, art, and music, amorous but refined. Poorly placed: wanton, effeminate, dissolute, careless of reputation, given to illicit pleasures (Ptolemy). Valens: desire, love, beauty, adornment, marriage, the arts, pleasant scents, music, and all forms of pleasure.",
      "significations": "Desire, love, appetites, beauty, adornment, marriage, soft clothing, the arts, pleasant scents, music, friendship, companionship, acquisition of property through women (Valens, Anthologiae I.1)"
    },
    "Sun": {
      "number": 4,
      "classicalPlanet": "Sun",
      "metal": "Gold",
      "deity": "Helios",
      "astronomicalName": "Helios (the Sun)",
      "elementalQuality": "Hot and dry — the primary source of heat in the cosmos; drying power secondary to heating, with moderate drying quality (Tetrabiblos I.4)",
      "sect": "Diurnal — the sect light of the day, defining the diurnal sect. Belongs inherently to the day.",
      "domicile": "Leo (one sign only — the Sun and Moon each rule one sign)",
      "exaltation": "Aries (at 19°)",
      "detriment": "Aquarius",
      "fall": "Libra",
      "bodyPart": "Right eye (in a man), the brain, the heart, sinews, all the right-hand side of the body. Governs sight generally (Tetrabiblos III.12)",
      "character": "Produces persons of rank, authority, public prominence. Signifies the father, the king, rulership (Ptolemy). Valens: the intellectual light of the mind, perception, kingship, great leadership, the father, friendship, honor through images and statues, high priesthood.",
      "significations": "Intellectual light of the mind, perception, kingship, great leadership, the father, the master, friendship, persons of high position, honor, high priesthood (Valens, Anthologiae I.1)"
    },
    "Mars": {
      "number": 5,
      "classicalPlanet": "Mars",
      "metal": "Iron",
      "deity": "Ares",
      "astronomicalName": "Pyroeis ('the fiery one')",
      "elementalQuality": "Hot and dry — Mars's desiccating, burning nature comes from proximity to the Sun and the 'fiery color' of the planet itself (Tetrabiblos I.4)",
      "sect": "Nocturnal — the nocturnal malefic. Excessive heat and dryness somewhat moderated in a night chart by nocturnal cooling and moistening",
      "domicile": "Aries and Scorpio",
      "exaltation": "Capricorn (at 28°)",
      "detriment": "Libra and Taurus",
      "fall": "Cancer",
      "bodyPart": "Left ear, kidneys, veins, and genitals. Associated with bile and the expulsion of blood (Tetrabiblos III.12)",
      "character": "Well-placed: bold, courageous, commanding, military-minded, fearless. Poorly placed: violent, cruel, bloodthirsty, reckless, quarrelsome, tyrannical (Ptolemy). Valens: violence, war, robbery, insolence, adultery, sharp pains, surgery, iron and fire — also command, military leadership, authority, hunting.",
      "significations": "Violence, war, robbery, insolence, adultery, lawsuits, sharp pains, surgery, iron, fire — also command, military leadership, authority, hunting, vigorous action (Valens, Anthologiae I.1)"
    },
    "Jupiter": {
      "number": 6,
      "classicalPlanet": "Jupiter",
      "metal": "Tin",
      "deity": "Zeus",
      "astronomicalName": "Phaethon ('the radiant one')",
      "elementalQuality": "Hot and moist — positioned between cold Saturn and hot Mars, partaking of warming and fertilizing nature. The most temperate and generative planet (Tetrabiblos I.4)",
      "sect": "Diurnal — the diurnal benefic, the greater benefic, functioning most favorably in a day chart",
      "domicile": "Sagittarius and Pisces",
      "exaltation": "Cancer (at 15°)",
      "detriment": "Gemini and Virgo",
      "fall": "Capricorn",
      "bodyPart": "The lungs, arteries, and semen (Tetrabiblos III.12). Valens adds the liver, right side of the body, and thighs.",
      "character": "Well-placed: magnanimous, generous, god-fearing, honorable, ambitious, dignified. Poorly placed: wasteful, extravagant, careless, superstitious, given to empty display (Ptolemy). Valens: childbearing, prosperity, large gifts, abundance, justice, rulership, political office, honor, religion, great enterprises.",
      "significations": "Childbearing, prosperity, large gifts, abundance, justice, rulership, political office, government, honor, religion, great enterprises (Valens, Anthologiae I.1)"
    },
    "Saturn": {
      "number": 7,
      "classicalPlanet": "Saturn",
      "metal": "Lead",
      "deity": "Kronos",
      "astronomicalName": "Phainon ('the shining one')",
      "elementalQuality": "Cold and dry — most remote from both Sun and Moon, cooling and desiccating. Some moistening from vapors rising to its sphere, but the dominant quality is cold and dry (Tetrabiblos I.4)",
      "sect": "Diurnal — the diurnal malefic. Harsh nature somewhat tempered in a day chart, where the Sun's warmth counteracts Saturn's cold",
      "domicile": "Capricorn and Aquarius",
      "exaltation": "Libra (at 21°)",
      "detriment": "Cancer and Leo",
      "fall": "Aries",
      "bodyPart": "Right ear, the spleen, the bladder, phlegm, and the bones (Tetrabiblos III.12). Valens adds knees, sinews, and watery parts.",
      "character": "Well-placed: deep thinkers, patient, industrious, serious, self-disciplined, capable of endurance. Poorly placed: malicious, cowardly, mean-spirited, petty, suspicious, sorrowful (Ptolemy). Valens: the star of Nemesis — grief, old age, death, land and water property, imprisonment, mourning, agriculture, building, solitary occupations.",
      "significations": "Grief, old age, death, land and water property, imprisonment, mourning, restraints, agriculture, building, solitary occupations — the star of Nemesis, ruling orphans, the elderly, those who live by toil (Valens, Anthologiae I.1)"
    }
  },
  "authorCommentary": []
}
