{
  "tradition": "Sabians of Harran",
  "sourceText": "Ibn al-Nadim, Kitab al-Fihrist (c. 995 CE); Al-Mas'udi, Meadows of Gold (c. 950 CE); Al-Biruni (c. 1048 CE); Ghayat al-Hakim / Picatrix (c. 1000 CE, Book III.7); Ibn Wahshiyya, Nabataean Agriculture; Maimonides, Guide for the Perplexed III.29",
  "period": "Documented 9th–11th c CE; traditions rooted in Mesopotamian antiquity",
  "origin": "tradition",
  "entered": "2026-02-24",
  "method": "dictation",
  "order": "weekdays",
  "note": "The Sabians of Harran maintained what may have been the last organized pagan planetary temple cult in the Near East. Seven temples, each dedicated to a planet, each with distinct geometric architecture, colors, animals, incense, and vestments. Worshippers dressed in the planet's color, faced north, and prayed three times daily. They venerated Hermes Trismegistus as their prophet and possessed copies of the Corpus Hermeticum. In 830 CE, when Caliph al-Ma'mun challenged them to identify their religion, they adopted the Quranic name 'Sabian' for legal protection. Thabit ibn Qurra and al-Battani were members of this community. The Picatrix (Ghayat al-Hakim) preserves their planetary invocations in extraordinary detail. Critical caveat: 'The descriptions of the Sabian religion by Sabians have not been preserved. The accounts that have survived show us the Sabians through the eyes of their detractors' (J.B. Segal, 1963).",
  "correspondences": {
    "Sun": {
      "number": 1,
      "classicalPlanet": "Sun",
      "metal": "Gold",
      "deity": "Shamash — the Mesopotamian sun god, son of Sin",
      "templeShape": "Square (Al-Mas'udi)",
      "templeColor": "Gold / yellow — implied by metal and vestments",
      "sacrifice": "A crested cock (Segal, from Arabic sources)",
      "incense": "'The greater incense of the Haniphites' (Segal). Picatrix fumigation: saffron, ambergris, musk, lignum aloes, lignum balsam, laurel fruit, cloves, myrrh, frankincense — with brain of eagle or blood of white cock",
      "vestments": "Yellow-gold silk. 'Put on royal clothing, silk mixed with gold, a gold crown on your head and a gold ring on your finger' (Picatrix III.7)",
      "prayer": "Invoked as: Yayemiz (Arabian), Sol (Latin), Maher (Chaldean), Lehuz (Roman), Araz (Indian) (Picatrix III.7)",
      "feastDay": "Feast of the Sun's Bride — February 10 (Shubat), fasting without meat or wine (Al-Biruni). April–May: rites honoring 'the son of their god' and the feast of Salughi",
      "description": "Shamash governed persons of distinction and royalty. Sunday worship at a square temple. Approached with the highest ceremony — gold vestments, royal bearing, the most elaborate of the seven incense formulas."
    },
    "Moon": {
      "number": 2,
      "classicalPlanet": "Moon",
      "metal": "Silver",
      "deity": "Sin (Sumerian: Nanna) — protector deity of Harran itself. The great temple E-hul-hul ('Temple of Rejoicing') was restored by Shalmaneser III (9th c BCE) and Ashurbanipal",
      "templeShape": "Octagonal (probable — Al-Mas'udi; Segal hedges with 'probably')",
      "templeColor": "White / silver — implied by metal and vestments",
      "sacrifice": "A small calf (Segal)",
      "incense": "'The lesser incense of the Haniphites' (Segal). Picatrix fumigation: frankincense and camphor, with menstrual blood or blood of a goose",
      "vestments": "Shining white silk or linen. 'Present oneself in the fashion of a young man' with pleasant scents and a silver ring (Picatrix III.7)",
      "prayer": "Addressed to Sin/Nanna as lord of time and the calendar. The Moon governed cultivators and vagrants. Segal notes the Moon was 'now regarded as female' by the Harranians, a shift from older Mesopotamian tradition.",
      "feastDay": "June 27 (Haziran) and September 28 (Aylul) — Moon-Lord festivals. June 27 was one of the principal mystery dates (Al-Biruni)",
      "description": "Sin was the patron deity of Harran — his temple E-hul-hul was the most ancient and prominent of the seven. The crescent moon was Sin's symbol, worn as a crown. Monday worship at an octagonal temple."
    },
    "Mars": {
      "number": 3,
      "classicalPlanet": "Mars",
      "metal": "Iron",
      "deity": "Ares (Greek name used in Arabic sources) — Mesopotamian equivalent: Nergal, god of war and the underworld",
      "templeShape": "Rectangular (sources vary; Al-Mas'udi)",
      "templeColor": "Red",
      "sacrifice": "A striped or spotted cat (Segal). Al-Dimashqi's more sensational claims are treated as hostile fabrication by scholars.",
      "incense": "Picatrix fumigation: euphorbium, bdellium, gum ammoniac, hellebore roots, lodestone, sulphur — with brain of hart, blood of a man, blood of a black cat. Arabic sources describe ingredients including human blood (likely exaggeration from hostile witnesses).",
      "vestments": "Flame-red silk. 'Put on red clothes, red linen and silk or a red hat.' Sword across the shoulders and protective armor (Picatrix III.7)",
      "prayer": "Tuesday worship. Invocations to the spirit of Mars with directional spirit-names.",
      "feastDay": "No specific Mars feast day recorded by Al-Biruni",
      "description": "Mars governed men of violence. Tuesday worship at a rectangular temple. Red vestments, sword, armor — martial imagery literal and complete. Arabic sources sensationalize Mars worship more than any other planet."
    },
    "Mercury": {
      "number": 4,
      "classicalPlanet": "Mercury",
      "metal": "Clay — unusual; most traditions assign quicksilver. Likely reflects Nabu's scribal/tablet associations (Segal). The Picatrix 'Perfect Nature' ritual assigns 'fixed mercury.'",
      "deity": "Nabuq (from Nabu, the Babylonian god of writing and wisdom)",
      "templeShape": "A triangle inscribed within an oblong / elongated quadrilateral (Al-Mas'udi)",
      "templeColor": "No allotted color — explicitly noted in the sources. Mercury was given no fixed color, reflecting the planet's mutable nature.",
      "sacrifice": "A white cock (Segal)",
      "incense": "Picatrix fumigation: mastic, frankincense, cloves, cinquefoil — with agate stone, brain of fox or weasel, blood of a magpie",
      "vestments": "Mixed-color silk. 'Dress yourself as a notary or scribe' and sit formally with writing materials at hand (Picatrix III.7)",
      "prayer": "'Mercury, noble lord, you who are truthful, sensible, intelligent, you who, like the scribes, know and spread arithmetic, calculation, the science of the heavens and the earth!' Invoked as: Hotarit (Arabian), Mercury (Latin), Haruz (Roman), Tyr (Phoenician), Meda (Indian). Spirit: Merhuyez; directional spirits: Barhuyex, Emirex, Hamerix, Sehix, Deryx (Picatrix III.7)",
      "feastDay": "No specific Mercury feast day recorded by Al-Biruni",
      "description": "Mercury governed men of learning and science. Wednesday worship at a compound geometric temple. Scribal vestments and writing materials — the worshipper approaches as scholar approaches master. No fixed color: Mercury resists categorization."
    },
    "Jupiter": {
      "number": 5,
      "classicalPlanet": "Jupiter",
      "metal": "Tin",
      "deity": "Bel (the Babylonian Marduk) — beneficent, governing wise men and philosophers",
      "templeShape": "Triangular (Al-Mas'udi)",
      "templeColor": "Green",
      "sacrifice": "A white lamb (Segal)",
      "incense": "Picatrix fumigation: mastic, lignum aloes, musk, camphor, seed of ash, storax, gum benjamin, lazule stone — with blood of stork or swallow, or brain of a hart",
      "vestments": "Green silk; also yellow and white, crystal ring, white cloak. Supplicants wore 'the volume of the Haniphites' (their sacred book) around the neck (Picatrix III.7)",
      "prayer": "Tin censer, pomegranate behind a central lit candle, myrtle branch above the table. Spirit names invoked seven times: Demuez, Armez, Ceylez, Mahaz, Erdaz, Tamyz, Feruz, Dyndez, Afrayuz, Tayhaciedez — 'Come and enter all of you spirits of Jupiter and smell the perfumes and eat from this dish.' After six repetitions, spirits appeared 'in beautiful forms wearing ornate garments.' (Picatrix III.7)",
      "feastDay": "No specific Jupiter feast day recorded by Al-Biruni",
      "description": "Jupiter governed the wise and philosophical. Thursday worship at a triangular temple in green vestments. Remarkable ritual detail — pomegranate, lit candle, myrtle branch, tin censer, seven invocations, visible spirits 'in beautiful forms.' The sacred book worn at the throat: Jupiter worship was the intellectual heart of the system."
    },
    "Venus": {
      "number": 6,
      "classicalPlanet": "Venus",
      "metal": "Copper",
      "deity": "Balti (Semitic, cognate with Ba'alat, 'Lady') — Mesopotamian equivalent: Ishtar/Inanna. Governed women, children, artists. Described as 'hidden, far and near.' (Segal)",
      "templeShape": "A triangle inscribed within a rectangle / quadrilateral (Al-Mas'udi)",
      "templeColor": "Blue",
      "sacrifice": "A white pigeon (Segal)",
      "incense": "Picatrix fumigation: musk, ambergris, lignum aloes, red roses, red coral — with brain of sparrows, blood of pigeons",
      "vestments": "Rose-colored silk. Two styles: noble Arab dress with white cotton headwear, or feminine style with 'long clothes of silk and gold mixed,' crown, pearls, gold ring, bracelets, mirror, and comb. Crushed aromatics throughout clothing (Picatrix III.7)",
      "prayer": "Addressed to Balti/Ishtar with names in multiple languages. The mirror and comb in vestments: the worshipper becomes Venus — adorning the self as devotional act.",
      "feastDay": "No specific Venus feast day recorded by Al-Biruni",
      "description": "Venus governed love, beauty, artistic creation. Friday worship at a compound geometric temple. Blue vestments — unusual for Venus (most traditions assign green or white). Dual vestment options (masculine noble vs. feminine adorned) reflect Ishtar's dual nature as warrior and lover, morning and evening star."
    },
    "Saturn": {
      "number": 7,
      "classicalPlanet": "Saturn",
      "metal": "Lead",
      "deity": "Kronos (Greek name in the sources) — Mesopotamian equivalent: Ninurta/Ningirsu",
      "templeShape": "Hexagonal (Al-Mas'udi)",
      "templeColor": "Black",
      "sacrifice": "A wholly black bull (or he-goat per some accounts). Described in vivid detail: bull fed with grass plucked by virgins at sunrise, drawn by a chain of gold, incense burning before it amid prayers. Head smeared with salt and wine, decapitated, organs examined for omens (Segal).",
      "incense": "Containing opium and skull of a black cat (Segal). Picatrix fumigation: seed of black poppy, henbane, root of mandrake, lodestone, myrrh — with brain of cat or blood of bat",
      "vestments": "Black wool, specifically cloth used to wrap a corpse, a black cape 'in the mode of a doctor,' black shoes (Picatrix III.7)",
      "prayer": "'In the name of God and in the name of Heylil, who is the angel to whom God has assigned the powers of Saturn in all things accomplished by cold; you who are in the seventh heaven; I invoke you by all your names: in Arabic Zohal, in Latin Saturnus, in Persian Keyhven, in Roman Coronez, in Greek Hacoronoz, in Indian Sanasara.' Spirit: Redimez; directional spirits: Toz (above), Corez (below), Deytyz (right), Deriuz (left), Talyz (before), Daruz (behind) (Picatrix III.7)",
      "feastDay": "Saturday was the regular day of worship. No separate Saturn feast recorded.",
      "description": "Saturn was malevolent, governing authority and restriction. Saturday worship at a hexagonal temple in black corpse-cloth. The sacrifice of the black bull is the most elaborately described: gold chain, virgin-plucked grass, salt and wine, organ divination. The darkest corner of the Sabian system — Arabic sources dwell on it with horrified fascination."
    }
  },
  "authorCommentary": []
}
