{
  "id": "anglo-saxon",
  "name": "The Old English Gods",
  "description": "The Anglo-Saxon pagan tradition is one of the great absences in European mythology. We know it existed — the evidence is everywhere: in the weekday names we speak without thinking, in place-names scattered across England (Wednesbury, Thundersley, Tysoe, Wansdyke), in the charms and remedies that survived because monks copied them down for practical use, and in the single most important sentence Bede ever wrote about pre-Christian religion on the island. But the mythology itself — the stories, the cosmology, the ritual calendar — was almost entirely unrecorded before conversion wiped it from living memory. What we have are fragments: a god who appears in a healing charm actually working magic with herbs, a goddess whose name survives only because one monk in Jarrow mentioned her festival, a concept of fate so deeply embedded in the language that even Christian poets could not write without it. This is not Norse religion with English accents. The Anglo-Saxons shared a common Germanic root with the Scandinavians, but their tradition diverged centuries before the Viking Age, shaped by migration, contact with Romano-British culture, and a conversion that came relatively early and from Rome rather than from within. Brian Branston, Kathleen Herbert, and Stephen Pollington have each tried to reconstruct what can be reconstructed. What emerges is not a system but a landscape — gods glimpsed through place-names, rituals inferred from charms, and a worldview that permeates Old English poetry even when the poets are nominally Christian.",
  "deities": [
    {
      "id": "woden",
      "name": "Woden",
      "title": "Lord of the Gallows, Master of Fury",
      "group": "sky",
      "description": "Woden is the Anglo-Saxon cognate of Odin, but the relationship is not simple equivalence. He appears directly in the Nine Herbs Charm — the only surviving text where an Anglo-Saxon god is shown actually doing something — and what he does is striking: he takes nine glory-twigs and strikes an adder, shattering it into nine pieces so that it can never again enter a dwelling. This is not the cosmic wanderer of the Eddas. This is a god performing practical magic, working with herbs and spoken words to heal. The charm treats him as a known entity who needs no introduction, suggesting a living cult tradition behind the text. Every Anglo-Saxon royal genealogy traces its line back to Woden — not as metaphor but as literal ancestry. The kings of Wessex, Mercia, Northumbria, East Anglia, Kent, and Deira all claimed descent from him, making him the mythological root of English kingship itself. Wednesbury (Woden's fort), Wednesfield (Woden's field), Wansdyke (Woden's ditch) — the landscape remembers him even when the stories are lost. His name means 'fury' or 'inspiration' (Old English wod, related to the Latin vates, seer), connecting him to ecstatic states, poetic frenzy, and the kind of knowing that arrives not through reason but through seizure. We say his name every Wednesday without knowing we are invoking a god of madness and magic. What does it mean that the most ordinary day of the week — the one we associate with getting through the middle of things — belongs to the lord of ecstasy?",
      "animals": ["ravens", "wolves"],
      "colors": ["deep blue", "grey"],
      "metals": ["mercury"]
    },
    {
      "id": "thunor",
      "name": "Thunor",
      "title": "Thunder-Wielder, Protector of the Common Hold",
      "group": "sky",
      "description": "Thunor is the Anglo-Saxon thunder god, cognate with Norse Thor but worshipped in his own right across pre-Christian England. Place-name evidence suggests his cult was among the most widespread: Thundersley in Essex, Thunderfield in Surrey, Thursley in the same county (from Thunor's grove), and Thunresleam (Thunor's branch or grove) in what is now lost topography. Where Woden belonged to kings and poets, Thunor belonged to everyone. His day — Thursday — sits in the working week like the sound of a hammer on an anvil, and the association is not accidental. He was the god who protected farmsteads, hallowed boundaries, and drove back the hostile forces that threatened ordinary life. The Æcerbot charm, a field remedy ritual for restoring fertility to blighted land, does not name Thunor directly, but its invocation of earth's power against poison and sorcery operates in his domain — the domain of practical protection, of keeping the harvest safe and the livestock healthy. Unlike the Eddic Thor, who has elaborate myths about fishing for the World Serpent and cross-dressing to retrieve his hammer, Thunor in the Anglo-Saxon record is mostly absence — his name on the land, his day in the week, his function in the culture, but almost no surviving narrative. The thunder itself was his story, and everyone already knew it. You do not need to write down what the sky says every summer.",
      "animals": ["goats"],
      "colors": ["red", "iron grey"],
      "metals": ["iron"]
    },
    {
      "id": "tiw",
      "name": "Tiw",
      "title": "The One-Handed, Lord of the Assembly",
      "group": "sky",
      "description": "Tiw is the Anglo-Saxon form of the Germanic sky god Tiwaz — linguistically cognate with Zeus, Dyaus, and Jupiter, a lineage that suggests he was once the supreme deity of the proto-Germanic peoples before Woden displaced him. By the Anglo-Saxon period he had become a god of law, martial honor, and the assembly — the divine patron of the thing, the open-air legal gathering where disputes were settled and oaths sworn. His name gives us Tuesday, and the place-name Tysoe in Warwickshire (Tiw's hill-spur) preserves what may have been a cult site where a red horse was cut into the hillside, visible for miles — though the figure has long since grown over and its association with Tiw rests on the place-name evidence and antiquarian tradition. The Old English Rune Poem describes the Tir rune (Tiw's rune) as 'a certain sign that holds faith well with nobles; it is always on course over the mists of night and never fails.' This is not a warrior's boast — it is a navigation marker, a star that does not wander. The poem associates the rune with steadfastness and reliability, qualities that belong to a god of law rather than war. If the Norse tradition preserves Tyr's sacrifice of his hand in Fenrir's jaws — the god who pays the cost of his own oath — the Anglo-Saxon tradition may have emphasized the quieter aspect: the god who keeps faith. Every Tuesday we name the day after a god whose defining act was accepting loss rather than breaking his word, and we do not notice.",
      "colors": ["crimson", "steel grey"],
      "metals": ["steel"]
    },
    {
      "id": "frig",
      "name": "Frig",
      "title": "Lady of the Hall, Keeper of Oaths",
      "group": "sky",
      "description": "Frig is the Anglo-Saxon cognate of Norse Frigg, Woden's wife and the queen of the gods, whose name gives us Friday — the day we associate with endings, release, and the threshold of rest. She is nearly invisible in the surviving Anglo-Saxon sources, which tells us something important about what conversion erased. The Norse tradition preserves Frigg as a goddess of marriage, prophecy, and domestic sovereignty — she knows all fates but tells no one, she spins the clouds on her distaff, she presides over the hall and the oath-cup. Whether the Anglo-Saxon Frig carried all these functions is unprovable but probable: the shared linguistic and cultural root is deep, and the hall-lady figure appears throughout Old English poetry in human form — Wealhtheow in Beowulf, passing the mead-cup and binding the company in obligation, is performing a ritual that maps precisely onto what Frigg does among the gods. The place-name evidence for Frig is thinner than for Woden, Thunor, or Tiw — Fretherne in Gloucestershire and a few disputed sites — which may indicate that her worship was household-centered rather than landscape-marked, conducted at hearth and loom rather than on hilltops and at groves. Brian Branston argued that her absence from public cult sites does not mean absence from the religion, only absence from the kind of evidence that survives in the dirt. The most powerful presence in an Anglo-Saxon hall was the one who held the cup and spoke the binding words.",
      "colors": ["white", "sky blue"],
      "consorts": ["Woden"]
    },
    {
      "id": "eostre",
      "name": "Eostre",
      "title": "Goddess of the Dawn, Lady of Spring's Opening",
      "group": "earth",
      "description": "Everything we know about Eostre comes from a single paragraph. In De temporum ratione (725 CE), Bede writes that the Anglo-Saxons called the month roughly equivalent to April 'Eosturmonath,' named after a goddess called Eostre in whose honor feasts were held at that season, though the observance had by his time been replaced by the celebration of Christ's resurrection — which nonetheless kept her name. That is it. One paragraph, one monk, one mention. And from that single reference, the name of the holiest day in the Christian calendar in English (Easter) and German (Ostern) descends directly from a pagan goddess of spring. Jacob Grimm, working from Bede and comparative linguistics in the nineteenth century, reconstructed a proto-Germanic *Austron connected to the dawn and the east, cognate with the Latin Aurora, the Greek Eos, and the Vedic Ushas — an Indo-European dawn goddess whose traces span from India to Iceland. Some scholars have questioned whether Bede invented her; the consensus now, following Kathleen Herbert and others, is that he had no motive to fabricate a pagan goddess and every motive to minimize the tradition he reported. The hare and egg associations that cluster around Easter may or may not trace to Eostre's original cult — the evidence is late and tangled. But the name itself is indisputable. Every spring, across the English-speaking world, people say the name of an Anglo-Saxon goddess they have never heard of and celebrate a festival whose date still follows the old lunar reckoning. She is the most successful survivor of a dead religion — alive in the mouth of every person who says the word 'Easter' without knowing what they are saying.",
      "colors": ["pale gold", "spring green", "rose"],
      "vegetation": ["spring flowers", "budding branches"]
    },
    {
      "id": "ing",
      "name": "Ing (Ingui-Frea)",
      "title": "Lord of the Fertile Year",
      "group": "earth",
      "description": "The Old English Rune Poem provides the most direct Anglo-Saxon testimony for Ing: 'Ing was first among the East-Danes seen by men, until he afterwards went eastward over the waves; the wagon ran after him; thus the Heardings named the hero.' This compressed narrative — a god who appears among a people, departs over the sea, and is followed by a sacred wagon — resonates directly with Tacitus's first-century account of Nerthus, the earth goddess whose image was drawn in a wagon among the Germanic tribes of the North Sea coast, and with the later Norse cult of Freyr (whose fuller name, Yngvi-Freyr, contains the same Ing- element). Ing is almost certainly the Anglo-Saxon form of the deity who became Freyr in Scandinavia: a god of fertility, prosperity, the sacral kingship, and the good harvest. The East Anglian royal dynasty, the Wuffingas, may have been connected to his cult, and the Swedish Yngling dynasty took their name directly from him. His departure 'over the waves' suggests a ritual or mythic pattern of the god who arrives by sea, blesses the land, and returns — the divine visitor whose presence guarantees abundance. The Æcerbot charm, which invokes the earth to be fruitful and the fields to grow, operates in Ing's theological territory even if it does not name him. He is the god behind the green — the principle that the land will feed you if the right relationship is maintained. That his rune poem entry reads like a memory of departure rather than a living cult may be the most honest thing the Anglo-Saxon record preserves: by the time anyone wrote it down, he had already gone eastward over the waves.",
      "animals": ["boar"],
      "colors": ["green", "golden yellow"],
      "vegetation": ["barley", "grain"]
    },
    {
      "id": "nerthus",
      "name": "Nerthus",
      "title": "Earth Mother, Lady of the Sacred Wagon",
      "group": "earth",
      "description": "Nerthus is not, strictly speaking, Anglo-Saxon — she belongs to the first century CE, to the Germanic tribes of the North Sea coast described by Tacitus in his Germania (98 CE). But she is the deep root from which Anglo-Saxon earth religion grew, and her ritual is the most fully described ceremony in all of early Germanic paganism. Tacitus writes that the tribes believed she intervened in human affairs, riding among her people in a wagon drawn by cattle, covered by a cloth that no one might look beneath. When the wagon arrived, weapons were laid aside, iron was locked away, and peace prevailed. When the goddess had had enough of human company, the priest returned her to her sacred grove on an island, where the wagon, the cloth, and the goddess herself were washed in a secluded lake — and the slaves who performed the washing were immediately drowned, so that no living person could testify to what they had seen. The linguistic link to Norse Njord is direct: Nerthus and Njordr are the same name, one feminine, one masculine, a gender shift that scholars have debated for centuries without resolution. What matters for the Anglo-Saxon tradition is the pattern: a deity of the earth and its fertility, carried among the people in a ritual procession, whose power demands both reverence and concealment. The Æcerbot charm — with its ritual plowing of the first furrow, its invocation of 'Erce, Erce, Erce, mother of earth,' and its placement of seed and dough in the turned soil — may be the last echo of Nerthus's wagon procession, domesticated into a Christian-era field blessing but structurally unchanged. The earth still needed to be asked.",
      "animals": ["cattle"],
      "colors": ["earth brown", "dark green"],
      "vegetation": ["cultivated grain", "turned soil"]
    },
    {
      "id": "hretha",
      "name": "Hretha",
      "title": "The Glorious One, Goddess of March",
      "group": "earth",
      "description": "Hretha survives in the same passage of Bede's De temporum ratione that preserves Eostre. Bede writes that the Anglo-Saxon month roughly equivalent to March was called 'Hrethmonath' and was named after a goddess Hretha (or Rheda) to whom sacrifices were offered at that season. That is all he says. Like Eostre, she exists in our record as a single sentence from a single source — and like Eostre, there is no strong reason to doubt Bede's testimony. Her name is usually connected to Old English hreth, meaning 'glory' or 'triumph,' making her something like 'the Glorious One' or 'the Triumphant.' Kathleen Herbert suggested she may have been a goddess of early spring — the fierce, transitional moment when winter begins to break but has not yet surrendered, when the first signs of returning life appear in a landscape still locked in cold. March in England is exactly this: not gentle, not warm, but victorious. The ground thaws. The first lambs are born. The light returns not as the soft abundance of April (Eostre's month) but as a battle won. If Eostre is the dawn arriving, Hretha is the fight that makes the dawn possible. This is speculative — we have one sentence and a name. But the name itself is suggestive: a goddess of glory worshipped at the turning of winter into spring, in the month when survival stopped being a question and became, at last, an answer. She is the most fragmentary figure in this pantheon, and perhaps the most honest about what we have lost: not just the myths, but the seasonal rituals that gave meaning to the passage of cold into warmth.",
      "colors": ["frost white", "early green", "storm grey"]
    },
    {
      "id": "wyrd",
      "name": "Wyrd",
      "title": "Fate, The Shaping Force",
      "group": "fate",
      "description": "Wyrd is not exactly a goddess in the Anglo-Saxon tradition — she is something more pervasive and less personal. The word means 'fate,' 'destiny,' or more precisely 'that which has become' (from the Old English weorthan, to become), and she saturates Old English poetry so thoroughly that no Christian rewriting could fully displace her. In Beowulf, the word appears repeatedly as a force that governs outcomes beyond human or even divine control: 'Wyrd often saves an undoomed man when his courage is good,' the poet writes, and also 'Wyrd goes ever as she must.' She is invoked as both rescuer and destroyer, a power that operates through events rather than upon them. The concept maps onto the Norse Urd (the eldest of the three Norns who tend the well at the root of Yggdrasil), but the Anglo-Saxon Wyrd appears more singular and more abstract — not one of three sisters but the principle itself, the irreversible accumulation of what has happened shaping what can happen next. Boethius's Consolation of Philosophy, translated into Old English by Alfred the Great, attempts to reconcile Wyrd with Christian Providence, and the tension is palpable: the translator cannot let go of the word because it carries a meaning that 'God's plan' does not quite cover. Wyrd is not a plan. Wyrd is what has already happened, bearing down on the present. The modern English word 'weird' descends from her — and its shift from 'fate' to 'strange' tells its own story about what happens when a culture loses its theological vocabulary but keeps the emotional residue. We still feel the uncanny weight of events converging beyond our control; we just no longer have a name for the force that drives them. Or rather, we do — we just think it means 'strange.'",
      "colors": ["black", "silver", "deep violet"]
    },
    {
      "id": "weland",
      "name": "Weland",
      "title": "The Smith, Maker in Captivity",
      "group": "fate",
      "description": "Weland the Smith is the Anglo-Saxon form of the pan-Germanic master craftsman known as Volundr in Norse and Wieland in continental German tradition — and he is one of the few figures from pre-Christian English mythology whose story survives in enough detail to feel like a story rather than a trace. The Franks Casket, a whalebone box carved in Northumbria around 700 CE, depicts Weland in his smithy alongside a scene of the Adoration of the Magi — pagan myth and Christian gospel presented as parallel narratives, side by side, without apparent anxiety. The Deor poem, one of the most moving lyrics in Old English, uses Weland's suffering as its opening example of endurable sorrow: 'Weland knew the wanderer's fate; that strong-minded earl suffered hardships, had for his companions sorrow and longing, winter-cold exile... That passed over; so may this.' His story, best preserved in the Norse Volundarkvida, is brutal: captured by King Nidud, hamstrung to prevent his escape, forced to work as the king's personal smith in captivity, Weland takes his revenge by killing the king's sons, fashioning drinking cups from their skulls, and forging wings to fly to freedom. The myth connects craftsmanship to suffering in a way that resonates far beyond its Germanic origins — the idea that the greatest making emerges from constraint, that the smith's power cannot be owned even when the smith's body can. Wayland's Smithy, the Neolithic long barrow on the Ridgeway in Oxfordshire, carries his name from folk tradition: leave a horse and a coin overnight, and the invisible smith will shoe it by morning. He persists in the landscape as the patron of those who make things under duress — and as a warning that imprisoning the maker does not end the way the captor expects."
    }
  ]
}
