{
  "id": "arthurian",
  "name": "The Round Table",
  "description": "The Arthurian tradition is not a mythology in the strict sense. It is a literary sediment — layers of story deposited over a thousand years, each generation rewriting Arthur for its own purposes, each version contradicting the last and somehow adding to the whole. The earliest stratum is Welsh and Breton oral tradition: Arthur appears in the ninth-century Historia Brittonum as a war-leader, not a king, fighting twelve battles against the Saxons, carrying the image of the Virgin on his shield at Badon. In the Mabinogion's Culhwch and Olwen, he is already surrounded by men with supernatural abilities — Cei who can hold his breath nine days, Bedwyr the one-handed — but Camelot does not yet exist and the Round Table is centuries away. Geoffrey of Monmouth's Historia Regum Britanniae (c. 1136) invented the architecture: Merlin, the sword in the stone, the betrayal by Mordred, the departure to Avalon. Chrétien de Troyes, writing in the 1170s and 1180s at the court of Marie de Champagne, added Lancelot, the Grail, and the adulterous love that would destroy everything. Wolfram von Eschenbach rewrote the Grail story as Parzival, shifting the emphasis from courtly love to spiritual seeking. The Vulgate Cycle (1215-1235) wove these threads into a vast prose architecture of interlocking narratives. And Malory's Le Morte d'Arthur (1485), written in prison, compressed the whole tradition into the English language with a plainness that made it permanent. The Round Table itself is a device for equality — no head, no foot, every seat the same — attributed in different sources to Merlin, to Uther, to a carpenter. It solves the problem of precedence among knights and creates a new one: the Siege Perilous, the one empty seat reserved for the knight who will achieve the Grail, fatal to anyone else. The tradition accumulated layers the way a cathedral accumulates chapels: Celtic myth, Christian allegory, chivalric code, courtly love, political propaganda, spiritual quest. Arthur is a fifth-century war-leader, a twelfth-century king, a mirror for medieval kingship, a Protestant symbol, a Victorian obsession, a twentieth-century film franchise. The Round Table holds because it was never one thing.",
  "deities": [
    {
      "id": "arthur",
      "name": "Arthur",
      "title": "The Once and Future King",
      "group": "round-table",
      "description": "Arthur Pendragon is the gravitational center around which the entire tradition orbits, and yet in the earliest sources he barely exists. The Historia Brittonum (c. 828) names him dux bellorum — a battle commander, not a king — who fought twelve battles against the Saxons, the last at Badon Hill, where he carried the cross of Christ on his shoulders for three days and nights and the enemy fell by the hundreds. The Annales Cambriae (c. 970) record Badon and then, twenty-one years later, the strife of Camlann 'in which Arthur and Medraut fell.' That is the entire historical skeleton: a man who won a decisive battle and died in a civil war. Everything else is literary invention, and the invention is magnificent. Geoffrey of Monmouth gave him parents — Uther Pendragon and Igraine, the conception engineered by Merlin's shape-shifting magic — and a career of continental conquest that echoes Alexander. The sword drawn from the stone is a sovereignty test: the land chooses its king. Excalibur, given by the Lady of the Lake in later tradition, is a different weapon entirely, though the two are often conflated. Malory gives him a third weapon, the dagger Carnwennan, and a spear, Rhongomyniad, both from Welsh tradition. He establishes the Round Table at Camelot, gathers the finest knights of Christendom, and presides over an order that destroys itself through the very virtues it was built to honor — Lancelot's excellence as a knight is inseparable from the adultery that breaks the fellowship. Arthur's end is consistent across nearly every version: Mordred seizes the throne, Arthur returns, they meet at Camlann, and both fall. The wounded king is carried to Avalon by three queens — Morgan le Fay among them — and the promise is that he will return when Britain needs him most. Rex quondam, rexque futurus. The once and future king. The power of the story is that it makes failure the condition of hope. Arthur did not succeed. Camelot fell. The Grail was achieved by his knight, not by him. His wife loved his best friend. His son killed him. And still he is coming back. The tradition endures because it locates greatness not in triumph but in the attempt, and its audience has never stopped believing that the attempt matters.",
      "animals": ["Dragon (the Pendragon emblem)"],
      "colors": ["Red", "Gold"],
      "weapons": ["Excalibur (the sword from the lake)", "Carnwennan (dagger)", "Rhongomyniad (spear)"],
      "consorts": ["Guinevere"]
    },
    {
      "id": "lancelot",
      "name": "Lancelot du Lac",
      "title": "The Greatest Knight",
      "group": "round-table",
      "description": "Lancelot does not appear in any Welsh or early British source. He is a French invention — Chrétien de Troyes introduced him in Le Chevalier de la Charrette (c. 1177), already fully formed as the greatest knight in the world and already in love with Guinevere. The Vulgate Cycle gave him a biography: Lancelot, son of King Ban of Benoic, was stolen as an infant by the Lady of the Lake — Viviane or Nimue — and raised beneath the waters of her enchanted mere. He arrives at Camelot as a young man and immediately proves himself the supreme warrior of the age. There is no contest he cannot win, no opponent he cannot defeat, no quest he cannot complete — except one. The Grail eludes him because his heart is given to the queen, and the Grail demands a purity he chose, knowingly, to sacrifice. This is the engine of the entire tradition's tragedy. Lancelot's adultery with Guinevere is not a lapse; it is a sustained, deliberate choice by a man who understands exactly what it costs. He loves Arthur. He serves Arthur. He betrays Arthur. The Vulgate Lancelot-Grail and Malory's Le Morte d'Arthur both insist on all three simultaneously. When Agravain and Mordred expose the affair, the resulting civil war shatters the Round Table. Lancelot rescues Guinevere from the stake but accidentally kills Gareth and Gaheris — Gawain's brothers — and Gawain's grief turns Arthur's greatest ally into his most implacable enemy. In the end, after Arthur falls at Camlann, Lancelot becomes a hermit and Guinevere a nun. They never meet again. His excellence is the flaw. The tradition insists on this: the quality that made him the best knight alive is the same quality — intensity of devotion — that made his love for Guinevere absolute and therefore ruinous. Through Elaine of Corbenic, who came to him in the guise of Guinevere, he fathered Galahad. His son achieved what he could not, and the irony is surgical: purity descending from the one knight whose sin defined the age.",
      "animals": [],
      "colors": ["Blue", "White"],
      "weapons": ["Sword (variously named across traditions — Arondight in some Italian sources)"],
      "consorts": ["Guinevere (his adulterous love)", "Elaine of Corbenic (mother of Galahad)"]
    },
    {
      "id": "gawain",
      "name": "Gawain",
      "title": "The Knight of the Sun",
      "group": "round-table",
      "description": "Gawain is Arthur's nephew — son of King Lot of Orkney and Arthur's half-sister Morgause — and in the earliest French romances he was the ideal knight, the standard against which all others were measured, before Chrétien shifted that role to Lancelot. In the English tradition he never lost his primacy. Sir Gawain and the Green Knight (c. 1375-1400), the anonymous alliterative masterpiece of the Pearl Poet, gives him the most psychologically intricate adventure in the entire corpus. A green knight rides into Camelot at New Year, offers a beheading game, and Gawain accepts — striking off the Green Knight's head, which the knight picks up and carries away, promising to return the blow in a year. At the castle of Bertilak de Hautdesert, Gawain is tested through a series of bedroom temptations by Bertilak's wife while his host hunts deer, boar, and fox outside. Each evening they exchange their winnings. Gawain resists the sexual temptation but accepts a green girdle that promises to protect his life, and conceals this from Bertilak. The flinch, the small dishonesty, the impulse to survive — the poem locates Gawain's failure not in lust but in fear. Bertilak is the Green Knight, and the entire test was engineered by Morgan le Fay. The girdle becomes Gawain's shame; the court adopts it as an honor. His solar nature — his strength waxes from dawn to noon and wanes from noon to dusk — connects him to older Celtic sun-hero traditions. In Malory, he becomes harsher: relentless in his pursuit of Lancelot after the deaths of Gareth and Gaheris, he refuses reconciliation even when Arthur begs for it, and dies of a wound reopened in battle. His ghost appears to Arthur before Camlann, warning him not to fight. The warning comes too late. Gawain's trajectory in the tradition — from paragon to flawed avenger — mirrors the tradition's own darkening, the turn from romance to tragedy that the later prose cycles demanded.",
      "animals": [],
      "colors": ["Green", "Gold"],
      "weapons": ["Galatine (sword — from the Italian tradition, 'galantine' meaning frozen or hardened)"],
      "consorts": ["Ragnell (in The Wedding of Sir Gawain and Dame Ragnell)", "various unnamed — in the French tradition he is a lover of many women"]
    },
    {
      "id": "galahad",
      "name": "Galahad",
      "title": "The Grail Knight",
      "group": "round-table",
      "description": "Galahad is the knight who achieves the Holy Grail, and he is the most deliberately constructed figure in the Arthurian tradition — not grown from oral storytelling but engineered by the Cistercian-influenced authors of the Vulgate Queste del Saint Graal (c. 1225-1230) as a theological argument. He is Lancelot's son by Elaine of Corbenic, conceived through a deception when Elaine came to Lancelot disguised as Guinevere. His bloodline carries the Grail lineage: Elaine's father is the Fisher King, descended from Joseph of Arimathea. He arrives at Camelot and sits in the Siege Perilous — the empty seat at the Round Table that destroyed every unworthy knight who attempted it — and the stone does not crack. He draws a sword from a floating stone in the river, the Sword of the Strange Girdle, which only the best knight in the world can claim. He wears white armor and carries a white shield with a red cross, painted in the blood of Joseph of Arimathea. He never sins. He never doubts. He never falters. And this is precisely the problem the tradition has wrestled with since the thirteenth century: Galahad achieves the Grail because he is perfect, but his perfection makes him inhuman. He does not struggle with temptation — he does not feel it. Where Percival achieves the Grail through innocence recovered and Bors through perseverance under moral pressure, Galahad achieves it through a purity that reads, depending on the reader, as divine grace or narrative absence. When he looks into the Grail at Sarras and sees the divine mystery, he asks to die, and his soul is carried to heaven by angels. He cannot live in the world because the world is not pure enough to hold him. Malory inherited this figure and preserved him faithfully, but the greatness of Malory's Le Morte d'Arthur is that it makes Lancelot — the father who failed — more moving than the son who succeeded. Galahad is the answer to the Grail question. The tradition preferred the question.",
      "animals": [],
      "colors": ["White", "Silver", "Red (the cross on his shield)"],
      "weapons": ["The Sword of the Strange Girdle (also called the Sword of David)", "White shield with red cross"],
      "consorts": []
    },
    {
      "id": "percival",
      "name": "Percival",
      "title": "The Innocent Fool",
      "group": "round-table",
      "description": "Percival — Parzival in Wolfram von Eschenbach, Peredur in the Welsh tradition — is the original Grail knight, and his story predates Galahad's by half a century. Chrétien de Troyes introduced him in Le Conte du Graal (c. 1180), the last and unfinished of his romances. The premise is devastatingly simple: Percival's mother, having lost her husband and sons to knighthood, raises him in the Welsh wilderness in total ignorance of chivalry. When he sees knights riding through the forest he mistakes them for angels. He rides to Arthur's court on a nag, in homespun, knowing nothing. His ignorance is his defining trait — and, in the Grail castle of the Fisher King, his undoing. He witnesses a procession: a bleeding lance, a golden graal (serving dish), a silver carving platter. The Fisher King is wounded, the land is wasting. Percival, having been told that a good knight does not ask too many questions, says nothing. He fails to ask the question — Whom does the Grail serve? — and wakes the next morning to find the castle vanished. Chrétien died before finishing the story. The Continuations and Wolfram's Parzival supplied different endings, but the structure is the same: an innocent who fails through the very courtesy he was taught, then spends years wandering in grief and confusion before learning that compassion, not silence, is the true chivalric virtue. Wolfram made this explicit: Parzival's journey is from tumpheit (foolishness) to compassion, and when he finally asks the question — the simple human question, 'What ails thee?' — the Fisher King is healed and Parzival becomes the Grail King. In the Welsh Peredur son of Efrawg, the Grail procession includes a severed head on a platter, bleeding, and the quest is one of vengeance rather than spiritual attainment. The Grail tradition forked early: Chrétien's version pulled toward Christian mystery, Wolfram's toward earned wisdom, the Welsh toward blood-debt. Percival stands at the junction. He is the figure who asks — or fails to ask — the question on which everything depends.",
      "animals": [],
      "colors": ["Red (in Chrétien — he takes a red knight's armor)", "White"],
      "weapons": ["Sword (various — given by the Fisher King in most versions)", "Javelin (in Peredur)"],
      "consorts": ["Blanchefleur (in Chrétien)", "Condwiramurs (in Wolfram)"]
    },
    {
      "id": "tristan",
      "name": "Tristan",
      "title": "The Lover",
      "group": "round-table",
      "description": "Tristan — Tristram in Malory, Drystan in the Welsh Triads — belongs to a tradition older than and originally independent of the Arthurian cycle, absorbed into the Round Table orbit by the Prose Tristan (c. 1230-1240) and Malory. His story is the great love tragedy of medieval Europe, rivaling and often surpassing the Lancelot-Guinevere narrative in emotional intensity. He is the nephew of King Mark of Cornwall, and he is sent to Ireland to bring Iseult (Isolde) back as Mark's bride. On the return voyage, Tristan and Iseult accidentally drink a love potion intended for Iseult and Mark. The drink binds them irrevocably — in Béroul's version (c. 1170) the potion lasts three years; in Thomas of Britain's version it is permanent. The story that follows is a sustained meditation on the collision between desire and obligation, told through a series of separations, disguises, clandestine meetings, and narrow escapes. Tristan is also a warrior of the first rank — he defeats the giant Morholt, an Irish champion, in single combat on an island, receiving a poisoned wound that only Iseult's mother can heal. He is a harper, and his music moves courts to tears. In the Prose Tristan he becomes a fully integrated Round Table knight, fighting alongside Lancelot and rivaling him in arms. He dies, in most versions, from a wound or from grief when he believes Iseult is not coming to him — a second Iseult, Iseult of the White Hands, lies about the color of the sails on the approaching ship. Iseult of Ireland arrives to find him dead and dies on his body. From their graves grow two trees — or briars, or vines — that intertwine and cannot be cut apart. The love potion is the tradition's way of externalizing what it could not otherwise justify: a desire so total it overrides every social bond. Whether the potion causes the love or merely reveals it is a question the medieval poets left deliberately unresolved.",
      "animals": [],
      "colors": ["Blue", "Black"],
      "weapons": ["Sword", "Harp"],
      "consorts": ["Iseult of Ireland (the great love)", "Iseult of the White Hands (his wife in name)"]
    },
    {
      "id": "kay",
      "name": "Kay",
      "title": "The Seneschal",
      "group": "round-table",
      "description": "Kay — Cei in Welsh, Keu in French — is Arthur's foster-brother and the first knight of his household, and the tradition treated him badly. In the earliest Welsh sources he is formidable. Culhwch and Olwen (c. 1100) gives Cei supernatural powers: he could hold his breath for nine days and nine nights under water, he could go nine days and nights without sleep, no physician could heal a wound from his sword, he could make himself as tall as the tallest tree in the forest, and his natural body heat was so intense that his companions could kindle their fires from him in the rain. He fights monsters, outwits giants, and stands as one of Arthur's most valued warriors. Pa Gur yv y Porthaur? — the early Welsh poem in which Arthur catalogues his men to gain entry to a fortress — lists Cei's feats alongside the greatest heroes. But the French romancers, building a tradition of courtly refinement, needed a foil: someone sharp-tongued, mocking, clumsy in love, to contrast with the elegance of Lancelot and the gentleness of Gawain. Chrétien de Troyes transformed Cei into the boor of the court, the knight who insults newcomers and overestimates his own ability. This version calcified. By Malory, Kay is Arthur's loyal but rough seneschal — the man who runs the household, keeps the accounts, guards the door, and earns no glory. He is brave enough but never the best, and the tradition never lets him forget it. The decline of Kay from supernatural warrior to comic functionary tracks the tradition's own shift from Welsh heroic poetry to French courtly romance. He is the residue of an older Arthur, preserved in amber and slowly rewritten. His loyalty never wavers. The stories simply stopped caring about loyalty without glamour.",
      "animals": [],
      "colors": ["Brown", "Red"],
      "weapons": ["Sword (unnamed — in Welsh tradition no physician could heal its wounds)"],
      "consorts": ["Andrivete (in some Breton traditions)"]
    },
    {
      "id": "bedivere",
      "name": "Bedivere",
      "title": "The Last Companion",
      "group": "round-table",
      "description": "Bedivere — Bedwyr in Welsh — is one of the oldest figures in the Arthurian tradition and the last to remain. In Culhwch and Olwen he is Bedwyr Bedrydant, one-handed, and yet 'no one in the island was as handsome as he, save Arthur and Drych son of Kibddar.' The loss of his hand is never explained; it simply is, a fact of his body that reduces nothing. He fights alongside Cei and Arthur against monsters and in the catalogue poem Pa Gur his prowess is listed among the greatest. In the later French and English tradition he diminishes — as many Welsh figures did — but he retains one scene so potent that it became the emotional climax of the entire legend. After the Battle of Camlann, Arthur, mortally wounded, commands Bedivere to take Excalibur and throw it into the lake. Bedivere goes to the water, looks at the sword — jeweled, magnificent, irreplaceable — and twice he cannot do it. He hides it and returns to Arthur, who asks what he saw. 'Nothing but the wind and the waves.' Arthur knows he is lying. The third time, Bedivere throws the sword, and a hand rises from the water, catches it, brandishes it three times, and draws it under. Bedivere returns and tells Arthur what happened. 'Now carry me to the water,' Arthur says. The barge waits. The three queens stand aboard. Bedivere watches it disappear into the mist and is left alone on the shore. Malory gives Bedivere a final scene: he wanders to a chapel where a hermit has buried a body that was brought by 'a number of ladies.' Bedivere stays and becomes a hermit himself. The tradition's last image is not the king departing for Avalon. It is the companion who was left behind, who could not let go of the sword and then had to let go of everything.",
      "animals": [],
      "colors": ["Grey", "Silver"],
      "weapons": [],
      "consorts": []
    },
    {
      "id": "mordred",
      "name": "Mordred",
      "title": "The Usurper",
      "group": "round-table",
      "description": "Mordred — Medraut in the Welsh annals — is the shadow that the Round Table cast but could not contain. The Annales Cambriae (c. 970) record only that at the strife of Camlann 'Arthur and Medraut fell,' without specifying whether they fought on the same side or against each other. The Welsh Triads preserve a tradition in which Medraut raided Arthur's court, struck Guinevere, and Arthur retaliated by raiding Medraut's court — a feud between equals, not a son's betrayal of his father. Geoffrey of Monmouth made Mordred Arthur's nephew, a usurper who seized the throne and Guinevere while Arthur was fighting abroad. The Vulgate Cycle and Malory made him something worse: Arthur's son, begotten on his half-sister Morgause in ignorance. When Arthur learns of the incestuous birth, he orders all children born on May Day to be set adrift in a boat — a Herod-like massacre that destroys the innocent and fails to destroy the guilty. Mordred survives. He grows up in the court, becomes a knight of the Round Table, and waits. It is Mordred and Agravain who expose Lancelot and Guinevere's adultery, not from moral conviction but from malice and ambition, and the resulting civil war gives Mordred his opportunity. When Arthur pursues Lancelot to France, Mordred declares him dead and claims the crown. At Camlann, Arthur drives his spear through Mordred's body; Mordred, impaled, pushes himself up the shaft and strikes Arthur a mortal blow to the head. Father and son destroy each other simultaneously. The tradition has always understood that Mordred is not an external enemy. He is the consequence of Arthur's own transgression, the sin that the realm's idealism cannot redeem. Every utopian project generates the force that will undo it. Mordred is the name the Arthurian tradition gave to that force.",
      "animals": [],
      "colors": ["Black", "Red"],
      "weapons": ["Sword"],
      "consorts": ["Guinevere (seized, not married, in most versions)"]
    },
    {
      "id": "bors",
      "name": "Bors",
      "title": "The Steadfast",
      "group": "round-table",
      "description": "Bors de Ganis is the least celebrated of the three Grail achievers and, for that reason, the most instructive. Galahad achieves the Grail through divine purity — he is born for it, constructed for it, incapable of failing. Percival achieves it through a recovered innocence, the fool's second chance. Bors achieves it through moral struggle, and his achievement cost him more than either of theirs. In the Vulgate Queste del Saint Graal, Bors is tested not with spectacular temptations but with impossible moral dilemmas. He must choose between rescuing his brother Lionel from captivity and saving a maiden from rape. He chooses the maiden. Lionel, furious, tries to kill him. Bors refuses to fight his own brother and nearly dies for it. He is tempted by a beautiful woman who threatens to throw herself from a tower if he will not sleep with her; he refuses, and the woman and tower are revealed as demonic illusions. His trials are not adventures — they are ethical crucibles in which every choice has a real cost and the right answer offers no comfort. He is Lancelot's cousin, a solid and dependable knight rather than a transcendent one, and his solidity is precisely what the Grail requires. The Queste's argument is that ordinary virtue, painfully maintained, is sufficient for grace. Galahad does not return from Sarras — he dies in ecstasy. Percival remains and dies a year later. Bors alone comes back to Camelot to tell the story. He is the witness, the survivor, the one who carried the Grail narrative back into the fallen world of the Round Table where it could be heard. Without Bors, the Grail quest would have ended in silence. He is the tradition's argument that someone has to live to tell it.",
      "animals": [],
      "colors": ["Brown", "White"],
      "weapons": ["Sword", "Shield"],
      "consorts": ["Unnamed daughter of King Brandegoris (in Malory — their union was arranged by enchantment; she bore him Elian the White)"]
    },
    {
      "id": "merlin",
      "name": "Merlin",
      "title": "The Prophet",
      "group": "enchanter",
      "description": "Merlin — Myrddin in Welsh — enters the tradition through two separate channels that Geoffrey of Monmouth fused into one figure. The first is Myrddin Wyllt, the wild man of the Caledonian forest who went mad after witnessing the slaughter at the Battle of Arfderydd (c. 573) and gained the gift of prophecy. The second is the boy Ambrosius in Nennius's Historia Brittonum, who reveals to Vortigern that his tower keeps collapsing because two dragons — one red, one white — are fighting in a pool beneath the foundation. Geoffrey made the boy into Merlin and gave him the cosmological machinery: the prophecies, the engineering of Arthur's conception through shapeshifting (he transforms Uther into the likeness of Gorlois so Uther can sleep with Igraine), the creation of Stonehenge by transporting giant stones from Ireland, the establishment of the Round Table. In the Vulgate Cycle, Merlin's parentage is made explicit: his father is a demon, an incubus, and his mother is a virgin nun. The intention was that he would be the Antichrist, but his mother's piety and a hasty baptism redirected his powers toward the good. He retains his demonic gifts — prophecy, shapeshifting, knowledge of all things past — but uses them in service of Arthur's kingdom. His end is one of the tradition's great ironies. He falls in love with Nimue (or Viviane), the Lady of the Lake, and teaches her his magic. She uses it against him, sealing him in a crystal cave, or beneath a stone, or inside a hawthorn tree, depending on the version. The greatest enchanter in the world is undone by the enchantment he taught. In Robert de Boron's Merlin (c. 1200), the imprisonment is voluntary — Merlin goes willingly, foreseeing everything, choosing love over freedom. The tradition's Merlin is never merely a wizard. He is the architect of a kingdom he knows will fail, who builds it anyway, who sees the end from the beginning and still shapes the stone.",
      "animals": ["Hawk", "Stag"],
      "colors": ["Deep blue", "Grey", "Starlight"],
      "weapons": ["Staff", "Prophecy (his most potent instrument)"],
      "consorts": ["Nimue / Viviane (the Lady of the Lake — his student, his love, his jailer)"]
    },
    {
      "id": "morgan-le-fay",
      "name": "Morgan le Fay",
      "title": "The Sorceress",
      "group": "enchanter",
      "description": "Morgan le Fay — Morgana, Morgen, Modron in Welsh tradition — is the most rewritten figure in the Arthurian canon, and her transformations track the tradition's anxieties about female power with uncomfortable precision. In Geoffrey of Monmouth's Vita Merlini (c. 1150), she is the eldest of nine sisters who rule the Isle of Apples (Avalon), a benevolent shapeshifter and healer who receives the wounded Arthur after Camlann and promises to cure him. There is no enmity. She is a sovereign figure of the otherworld, cognate with the Morrigna of Irish tradition and the continental fata — the fates. Chrétien de Troyes calls her Morgan la fée and preserves her as a healer. But the Vulgate Cycle, written under increasing Cistercian influence, made her Arthur's half-sister (daughter of Igraine and Gorlois), sent her to a convent where she learned the liberal arts, then had her seduce Merlin to learn magic, and gradually transformed her into the principal antagonist of Camelot. She steals Excalibur's scabbard (which prevents its bearer from bleeding), plots Arthur's death, entraps knights in enchanted valleys, and creates the false Excalibur that nearly kills Arthur in combat with Accolon. Malory inherited this hostile Morgan but could not fully suppress the older tradition: at the end of Le Morte d'Arthur, when Arthur is carried to Avalon, Morgan is one of the three queens on the barge. The woman who spent the entire narrative trying to destroy Arthur is the one who receives him at the end. This contradiction is not a flaw in the tradition — it is the tradition. Morgan is the healer who is also the destroyer, the sister who loves and hates simultaneously, the figure the romance writers could not fit into their moral categories. Her colors are the colors of enchantment and ambiguity. Her power comes from the same sources as Merlin's — older, deeper, drawn from traditions the Christian framework could absorb but not entirely tame. Every version that tried to make her simply a villain had to let her save Arthur in the final scene. The stories could not help themselves.",
      "animals": ["Raven (in later folk tradition)", "Shape-shifted forms (various)"],
      "colors": ["Black", "Purple", "Green"],
      "weapons": ["Magic (enchantment, shapeshifting, illusion)", "Excalibur's scabbard (stolen)"],
      "consorts": ["King Uriens of Gore (her husband in Malory)", "Accolon (her lover and instrument against Arthur)"]
    },
    {
      "id": "lady-of-the-lake",
      "name": "The Lady of the Lake",
      "title": "Nimue / Viviane",
      "group": "enchanter",
      "description": "The Lady of the Lake is not one figure but a title, a function, a threshold between the mortal world and the otherworld that different texts assign to different women — and sometimes to the same woman performing contradictory acts. In the Vulgate Cycle, the primary Lady of the Lake is Viviane (also called Niniane or Nimue), who gives Excalibur to Arthur, raises Lancelot from infancy in her underwater domain, and eventually imprisons Merlin. In Malory, the Lady who gives Arthur the sword at the lake is killed by Balin — one of the early tragedies that stains the Round Table before it is fully formed. The Nimue who succeeds her becomes a protector of the court, using her magic to save Arthur from Morgan le Fay's plots. The two — or three, or four — Ladies coexist in the tradition without reconciliation, because the figure is not a character but a position: the keeper of the boundary between human and enchanted worlds, the one who holds the weapons that mortal hands cannot forge and should not own permanently. Excalibur comes from the lake and returns to the lake. Lancelot comes from the lake and, in his final failure, cannot return to its purity. The Lady's realm is underwater — a classic otherworld motif found from Celtic lore to Slavic rusalka traditions — and what the water represents is the source of power that mortals may borrow but never possess. She educates both Merlin's successor and the greatest knight of the age. She arms the king and disarms the enchanter. She gives and she takes. In the Post-Vulgate Cycle, Nimue is explicitly benevolent, a force of order counterbalancing Morgan's chaos. But the imprisonment of Merlin haunts every version: the woman who learned everything from the greatest mage in the world and used that knowledge to seal him away forever. Whether this is betrayal or liberation — whether Merlin went willingly or not — depends on which text you trust. The tradition does not choose. The lake keeps its secrets.",
      "animals": [],
      "colors": ["Blue", "Silver", "White"],
      "weapons": ["Excalibur (she is its keeper)", "Enchantment"],
      "consorts": ["Merlin (her teacher and, in some versions, her lover)", "Pelleas (in Malory, she marries him after enchanting Ettard)"]
    },
    {
      "id": "guinevere",
      "name": "Guinevere",
      "title": "The Queen",
      "group": "queen",
      "description": "Guinevere — Gwenhwyfar in Welsh — is the queen around whom Camelot turns, and the tradition has never known what to do with her except make her the pivot. The Welsh Triads (Triad 56) record three Gwenhwyfars, all married to Arthur, a trace of a tradition in which the queen was a function of sovereignty rather than an individual. In Geoffrey of Monmouth she is Roman-descended, noble, beautiful; Mordred seizes her along with the throne, and her betrayal is political rather than romantic. Chrétien de Troyes transformed her by inventing Lancelot. In Le Chevalier de la Charrette, Guinevere is kidnapped by Meleagant and Lancelot pursues her, enduring a series of humiliations — including riding in a cart, a conveyance for criminals — for her sake. When he hesitates for two steps before getting into the cart, she rebukes him. Two steps of hesitation, and she finds him wanting. The imperious quality is deliberate: Chrétien was writing for Marie de Champagne, who championed the doctrine that true love demands absolute submission. The Vulgate Cycle and Malory made the adultery sustained and mutual — not a single lapse but a way of life, conducted in full knowledge of its consequences. Guinevere is Arthur's wife and Lancelot's lover, and she is never presented as merely torn between them. She chooses both. She maintains both. When Mordred and Agravain expose the affair, she is condemned to burn at the stake, and Lancelot rescues her in a scene that kills Gareth and Gaheris and fractures the Round Table beyond repair. After Arthur's death, she takes the veil at Amesbury and refuses to see Lancelot again. 'Through this man and me hath all this war been wrought,' she tells him in Malory, 'and the death of the most noblest knights of the world.' She is not asking for forgiveness. She is stating a fact. The tradition has sometimes tried to make her a victim — passive, manipulated, caught between two great men — but the texts resist this. She acts. She chooses. She bears the weight of those choices. The three Gwenhwyfars of the Welsh Triads may be the truest image: the queen is not one woman but a role, and whoever occupies it inherits the impossible position of being the center of a court whose virtues will destroy it.",
      "animals": [],
      "colors": ["White", "Gold"],
      "weapons": [],
      "consorts": ["Arthur (her husband and king)", "Lancelot (her lover)"]
    }
  ]
}
