{
  "id": "basque",
  "name": "The Jentilak",
  "description": "The Basque mythological tradition is the only pre-Indo-European spiritual system in Europe that survived into the modern era with its language intact. Euskara — the Basque language — has no known relatives. It predates the arrival of Indo-European peoples on the continent by millennia, and the mythology it carries developed in complete linguistic isolation from every surrounding tradition. The anchor point is Anboto, a 1,331-meter limestone peak in the Biscayan highlands, riddled with caves and perpetually wrapped in cloud. This is where Mari dwells — the supreme goddess of the Basque world, a chthonic power who controls weather by moving between mountain caves, who has no creation myth because she simply IS. No origin, no birth, no death. José Miguel de Barandiarán spent nearly a century collecting the oral traditions of the Basque countryside, preserving a theology that was already ancient when Rome arrived in Iberia. What he documented is not a pantheon in the Greco-Roman sense — there is no Olympus, no genealogical chart of divine succession. It is a landscape theology: every cave, peak, river, and forest has its resident power, and the supreme deity lives underground.",
  "deities": [
    {
      "id": "mari",
      "name": "Mari",
      "title": "The Supreme Goddess of Earth and Weather",
      "group": "supreme",
      "description": "Mari — Anbotoko Mari, the Lady of Anboto — is the principal deity of the Basque mythological system and arguably the oldest surviving goddess figure in Europe. She lives in caves. She moves between mountain peaks — Anboto, Aizkorri, Oiz, Aralar, Supelegor — and when she changes residence, the weather changes with her. Barandiarán documented the belief in Zeanuri that she spends seven years in the cave at Anboto, then seven years in a cave at Oiz, cycling endlessly. When she is in Anboto, the weather is wet. When she moves elsewhere, drought follows. She appears in folk accounts as a woman dressed in red, as a fireball crossing the sky, as a sickle of flame, as a rainbow, as a gust of wind. She holds court underground, where she dispenses justice, punishes dishonesty and arrogance, and receives offerings left at cave mouths. She does not create the world. She does not die and resurrect. She has no origin myth. She simply IS — and this absence of origin narrative is itself theologically extraordinary. Every other major European deity has a birth story. Mari does not need one because she is not a person who became divine; she is the earth itself, conscious and judgmental, resident in the stone. Barandiarán identified her as a chthonic deity — subterranean, not celestial. This is the critical structural inversion. In nearly every Indo-European religion, the supreme deity is a sky god: Zeus, Jupiter, Odin, Dyaus Pita. In the Basque system, the supreme power is female, lives underground, and IS the earth. Whatever culture produced this theology was operating from fundamentally different premises about where power resides. Resurrección María de Azkue and Julio Caro Baroja both traced the persistence of Mari worship into the early modern period, documenting how Christian missionaries found her impossible to fully displace — she simply absorbed the Virgin Mary's name and kept living in her caves."
    },
    {
      "id": "sugaar",
      "name": "Sugaar",
      "title": "The Male Serpent",
      "group": "supreme",
      "description": "Sugaar — whose name means 'male snake' in Euskara — is Mari's consort, and his role in the Basque system is structurally unlike any consort figure in Indo-European mythology. He is not the supreme god with a goddess-wife. He is the secondary power, subordinate to Mari, and his appearances are almost always in service of her or in relation to her. He crosses the sky as a sickle of fire or a bolt of lightning. He takes the form of a serpent, a dragon, or a fireball. He meets Mari on Friday nights — the night of the akelarre, the Basque sabbat — and their union produces storms. The sexual dimension is explicit in the folk tradition: Sugaar is the rain and the lightning that fertilizes the earth. He is the water that enters the ground. Barandiarán documented that their coupling was understood as the mechanism by which storms are conceived — not metaphorically, but as the actual causal explanation for hail, thunder, and tempest. The offspring attributed to Mari and Sugaar in some traditions include Mikelats (associated with malevolence) and Atarrabi (associated with goodness), which gives the Basque system its own version of the dueling-brothers motif found across world mythology. But what matters most about Sugaar is what he is NOT. He is not the king of the gods. He is not the sky father. He is a serpent who visits the goddess in her cave, and the power relationship runs through her, not him. In a European context saturated with patriarchal sky-god theologies, this reversal is not incidental — it is structural. The Basque system preserves a theological architecture in which masculine divine power is mobile, transient, and subordinate to a feminine power that is rooted, permanent, and supreme."
    },
    {
      "id": "eguzki",
      "name": "Eguzki",
      "title": "The Sun",
      "group": "celestial",
      "description": "Eguzki — also called Eki — is the Sun in Basque mythology, understood not as a god in the anthropomorphic sense but as a daughter of Ama Lur, the Earth Mother (another name for the chthonic feminine power that Mari embodies). She traverses the sky each day, returns to her mother at night, and her light is the primary protection against the malevolent spirits that populate the Basque nocturnal world. The eguzkilore — the Carlina acanthifolia, a thistle-like flower that resembles a small sun — is placed above doorways in Basque farmsteads as a ward against evil spirits, because in folk belief, the spirits of darkness mistake it for the actual sun and flee. This is documented across the Basque countryside from Barandiarán's fieldwork onward, and the practice persists today. What is structurally significant is Eguzki's genealogy: the Sun is the daughter of the Earth, not the other way around. In the Indo-European systems — Greek, Roman, Norse, Vedic — the celestial bodies are typically autonomous powers or children of sky gods. In the Basque system, the Sun is subordinate to and born from the ground. The entire cosmological hierarchy runs from below upward: the earth is primary, the sky is secondary, and celestial bodies are the earth's offspring. This is chthonic theology carried to its logical conclusion. Eguzki illuminates, protects, and sustains — but she goes home to her mother every night."
    },
    {
      "id": "ilargi",
      "name": "Ilargi",
      "title": "The Moon",
      "group": "celestial",
      "description": "Ilargi — also written Ile or Ilazki — is the Moon, and her name may carry one of the most haunting etymologies in any mythology. Some Basque linguists, including Azkue, have proposed that Ilargi derives from 'il' (dead) and 'argi' (light): the light of the dead. Whether this etymology is certain or folk-derived, the association is deep in the tradition. The Moon in Basque belief illuminates the realm between the living and the dead. She is the protective light of the night, the counterpart to Eguzki's daytime protection, holding back the malevolent spirits that Gaueko commands. Like Eguzki, Ilargi is understood as a daughter of Ama Lur — another child of the Earth, not an independent celestial power. Barandiarán documented beliefs in which the Moon was addressed directly, and lunar cycles governed agricultural timing, ritual calendars, and the propitiation of the dead. The association between moonlight and the dead is not unique to the Basque world — it appears in traditions from the Celtic fringe to Southeast Asia — but the directness of the Basque version is striking. The Moon does not merely remind people of mortality. She is, by name, the light that belongs to those who have died. In a mythology without a clear afterlife narrative — Basque folk tradition has no Valhalla, no Elysium, no detailed underworld geography — the Moon serves as the closest thing to a visible connection between the living and whatever comes after. She is not a guide to the dead. She is their lantern."
    },
    {
      "id": "urtzi",
      "name": "Urtzi / Ortzi",
      "title": "The Sky",
      "group": "celestial",
      "description": "Urtzi (also Ortzi or Ost) is the most debated figure in the Basque mythological system — a possible sky god whose very existence as a deity is uncertain. The word 'ortzi' means 'sky' or 'firmament' in Euskara, and it appears in compound words for weather phenomena: 'ortzadar' (rainbow, literally 'sky-arch'), 'ortzi-motz' (cloudy sky), 'osteguna' (Thursday, literally 'Ortzi's day' — parallel to Jupiter's day, Thor's day). These linguistic traces suggest that Urtzi may have been a personified sky deity at some point in Basque prehistory, functionally parallel to the Indo-European sky father. But Barandiarán was careful to note that no folk narrative featuring Urtzi as a character has been collected. He exists only in the language, not in the stories. This is either evidence that a sky god was once worshipped and then faded, or evidence that the Basque language personified the sky grammatically without ever developing a full deity around it. The distinction matters enormously. If Urtzi was a deity who disappeared, it suggests the Basque system once had a sky god and actively demoted him in favor of the chthonic Mari. If he was never a full deity, it means the Basque system simply never developed a supreme sky god at all — which would make it unique among European theologies. Julio Caro Baroja leaned toward the second interpretation, noting that the entire Basque system is oriented downward, toward caves and earth, not upward toward the sky. Urtzi remains a ghost in the grammar: a theological possibility that the language remembers but the tradition chose not to develop."
    },
    {
      "id": "basajaun",
      "name": "Basajaun",
      "title": "The Wild Lord of the Forest",
      "group": "nature",
      "description": "Basajaun — literally 'Lord of the Forest' — is a huge, hairy, powerful figure who dwells in the deep woods and high mountain caves of the Basque Country. He is not a god in the strict sense but a being of immense age and knowledge, a wild guardian who protects flocks, warns shepherds of approaching storms with a great shout from the peaks, and possesses technological secrets that humans had to steal or earn. Barandiarán collected multiple versions of the foundational Basajaun narrative: that Basajaun alone knew how to plant and harvest wheat, how to smelt iron, how to build a mill, how to forge tools. Humans did not receive these gifts freely. In the most widely attested version, a clever man eavesdropped on Basajaun singing about when to plant and was able to overhear the agricultural calendar. In another, a man challenged Basajaun to a contest, and when Basajaun threw a stone that split a distant tree, the man was able to retrieve seeds of cultivated wheat that fell from the giant's clothing. The Basajaun myth is, at its core, a Prometheus story — knowledge possessed by a powerful being, obtained by human cunning — but without the punishment. Basajaun does not curse humanity for stealing agriculture. He simply continues to live in his forest. His female counterpart is Basandere, the Lady of the Forest. Some scholars, including those in Juan María Apellániz's archaeological circle, have speculated that Basajaun may encode a folk memory of contact between modern humans and an earlier hominid population — Neanderthals survived in the Iberian Peninsula longer than anywhere else in Europe, and the Basque Country sits at the geographic center of their last refugium. This is speculative, but the structure of the myth — a powerful, hairy, cave-dwelling being who possessed knowledge before humans arrived — is at minimum suggestive."
    },
    {
      "id": "akerbeltz",
      "name": "Akerbeltz",
      "title": "The Black He-Goat Spirit",
      "group": "nature",
      "description": "Akerbeltz — 'Aker' (billy goat) + 'beltz' (black) — is one of the most complex figures in Basque folk religion, because Christian reinterpretation rewrote him almost beyond recognition. In the pre-Christian stratum, documented by Barandiarán and corroborated by Caro Baroja, Akerbeltz was a protective spirit of livestock. Basque farmers kept a black billy goat in their stables as a representative of Akerbeltz, believing his presence would protect the animals from disease, predators, and malevolent spirits. An inscription reading 'Aherbeltse' on a Roman-era stone reused in the Church of Saint-Aventin in the French Pyrenees confirms that veneration of this figure predates Christianity in the region by centuries. Then the Inquisition arrived. During the sixteenth- and seventeenth-century witch trials that devastated the Basque Country — the Zugarramurdi trials of 1610 being the most notorious — Akerbeltz was directly identified with Satan. The akelarres (nocturnal gatherings, from 'aker' + 'larre,' the goat's meadow) were recast as diabolical sabbats, and the protective farmstead spirit became the devil himself. Women who kept the old customs — leaving offerings, maintaining the black goat in the stable, gathering at traditional sites — were tried and executed as witches. This is not ambiguous history. The transformation of Akerbeltz from livestock protector to Satan is one of the clearest documented cases of Christian demonization of a pre-Christian deity in Europe. Every subsequent European image of the devil as a goat owes something to this specific colonial encounter between Christianity and the Basque folk religion it could not fully absorb."
    },
    {
      "id": "herensuge",
      "name": "Herensuge",
      "title": "The Dragon Serpent",
      "group": "nature",
      "description": "Herensuge is the dragon of Basque mythology — a multi-headed serpent, often depicted with seven heads, that dwells in caves and rivers and demands tribute. The most widely attested Herensuge narrative is the legend of Teodosio de Goñi, a Navarrese knight who committed the sin of double parricide (tricked by the devil into killing his own parents) and was sentenced to wander the Aralar mountain range in chains as penance. While doing penance, he encountered a Herensuge about to devour a woman, and the archangel Michael intervened, decapitating the dragon and freeing Teodosio from his chains. The sanctuary of San Miguel de Aralar, one of the oldest and most important churches in Navarra, was built on the site of this encounter. Barandiarán documented this legend alongside numerous local variants — in some versions the dragon has seven heads whose offspring detach and grow into new dragons; in others the Herensuge is a single vast serpent that blocks rivers and demands human sacrifice. The relationship between Herensuge and Sugaar is debated. Both are serpentine. Both are associated with fire and storms. Some scholars treat Herensuge as a degraded or demonized version of Sugaar — the male serpent power reduced, under Christian influence, from divine consort to monster. Others see them as distinct traditions that share serpentine imagery because serpents were central to Basque chthonic theology: the snake lives in the earth, enters caves, moves between the surface and the underground, and thus embodies the fundamental Basque theological orientation toward what lives below. The dragon is the serpent that the new religion needed to kill."
    },
    {
      "id": "gaueko",
      "name": "Gaueko",
      "title": "The Spirit of Night",
      "group": "other",
      "description": "Gaueko — literally 'of the night' — is the lord of darkness in Basque folk belief, and his function encodes one of the most psychologically precise boundary rules in any mythology. The principle is simple: the day belongs to the living, the night belongs to the dead and their spirits. Gaueko enforces this boundary. He does not attack the virtuous or the cautious. He punishes those who violate the night — who go outside after dark to work, to boast, to prove they are not afraid. Barandiarán collected accounts in which Gaueko manifests as a gust of wind, a black cow, a great dark wolfhound that walks upright, and in each case he speaks a single phrase: 'Gaua gauekoarentzat, eguna egunezkoarentzat' — 'The night for the one of the night, the day for the one of the day.' Then he acts. The people who suffer at Gaueko's hands are not random victims — they are boundary violators, people who refused to accept that human dominion has a temporal limit. This is not a monster story. It is a cosmological rule given teeth. In the Basque system, the world is shared between the living and other powers, and the sharing is temporal: you get the daylight hours, they get the dark ones, and if you encroach on their time, there are consequences. Some accounts present Gaueko as potentially helpful — warning people to go home before the spirits of the dead emerge — which makes him less a demon than a border guard. He is frightening because borders are frightening, not because he is evil. The psychological sophistication is in the recognition that human agency is not unlimited. There are times and places that do not belong to you. Gaueko is the figure who makes that knowledge visceral."
    },
    {
      "id": "lamiak",
      "name": "Lamiak / Laminak",
      "title": "The Nature Spirits",
      "group": "other",
      "description": "The Lamiak (singular Lamia, plural Laminak in some dialects) are the most numerous and geographically embedded supernatural beings in the Basque world — river spirits, spring spirits, cave-dwellers who appear as beautiful women from the waist up but whose lower bodies betray their otherness: duck feet, hen feet, goat hooves, or fish tails depending on the region and the proximity to the sea. Barandiarán documented Lamiak traditions in virtually every valley of the Basque Country, and the density of place-names derived from them — Lamikiz, Laminaputzu, Lamitegi, Lamirain, Lamusin, Lamiñosin — testifies to how deeply woven they are into the landscape itself. They live near water. They comb their long hair on riverbanks. They are generous to those who leave them offerings — food at the river's edge, and in return they will finish ploughing a field overnight, or build a bridge, or complete stonework that would take human laborers weeks. The bridges attributed to Lamiak across the Basque Country — at Ebrain, Azalain, Urkulu, and elsewhere — are always described as built in a single night, because the Lamiak work only in darkness (again, the night-day boundary that Gaueko enforces). Their duck feet are the critical detail. They are almost human. They are beautiful, helpful, communicative. But the feet give them away — they cannot fully cross into the human world, and this visible mark of difference is the thing they most want to conceal. During the seventeenth-century witch trials, Lamiak were invoked in confessions as spirits that Inquisitors recast as demonic entities, but the folk tradition itself treats them as neither good nor evil. They are neighbors who happen to be inhuman, and the relationship works as long as humans respect the terms."
    },
    {
      "id": "jentilak",
      "name": "Jentilak",
      "title": "The Gentle Giants",
      "group": "other",
      "description": "The Jentilak — from Latin 'gentilis,' meaning 'pagan' or 'of the nations' — are the giants of Basque mythology, and their story is one of the most poignant transition narratives in any tradition. They were the original inhabitants of the Basque mountains: enormous, hairy, immensely strong, capable of throwing boulders from one peak to another (which is why the dolmens, menhirs, and cromlechs that dot the Basque landscape are called 'jentil-work'). They are credited with inventing metallurgy, the saw, the mill, and agriculture. They were not enemies of humans — the word 'jentil' carried no hostility, only difference. They lived before Christianity arrived. Then one night, a luminous cloud appeared in the sky — or a star, in some versions — heralding the birth of Kixmi (Christ). The oldest and wisest Jentil, who understood what the sign meant, told the others: 'The age of the Jentilak is over.' They walked into the earth. In the most widely attested version, collected by Barandiarán in Navarra, they disappeared beneath a dolmen in the Arratzaren valley, buried themselves under the very megalithic monuments they had built, and were never seen again. Only one remained: Olentzero, a single giant who survived the transition and became the Basque Christmas figure — a coal-maker who descends from his mountain on Christmas Eve. The Jentilak narrative is a conversion myth told from the side of the converted-over. It does not celebrate Christianity's arrival. It mourns what was lost. The giants who built the landscape, who invented the tools, who were gentle despite their strength — they recognized the new era and chose to leave rather than fight. The dolmens are their graves and their monuments. Every standing stone in the Basque Country is, in this tradition, a marker of the world that existed before the luminous cloud appeared and ended it."
    }
  ]
}
