{
  "id": "celtic-irish",
  "name": "The Tuatha Dé Danann",
  "description": "The gods of pre-Christian Ireland, preserved in manuscripts compiled by medieval monks who could not quite bring themselves to let the old stories die. The Tuatha Dé Danann arrived in Ireland wrapped in a dark cloud, burned their ships so there was no retreat, and won the land through battle and craft. Their mythology is anchored to a landscape shaped by the same tectonic forces that built the Giant's Causeway — sixty million years of Paleogene basalt cooling into forty thousand interlocking hexagonal columns, a geological event so precise it demanded a mythic explanation. Fionn mac Cumhaill built it to walk to Scotland; Fionn's Scottish counterpart Benandonner tore it up in retreat. The Causeway sits on the Antrim coast where Ireland faces Alba across the narrowest stretch of the North Channel, and the basalt that forms its columns is the same formation that surfaces at Fingal's Cave on Staffa — the geological truth beneath the myth of two giants building a bridge between nations.",
  "deities": [
    {
      "id": "dagda",
      "name": "The Dagda",
      "title": "The Good God, Father of All",
      "group": "danann",
      "description": "The Dagda — Eochaid Ollathair, the All-Father, the Great Father — is good not in a moral sense but in the sense of being good at everything. He carries the coire ansic, the cauldron of abundance that leaves no company unsatisfied, one of the Four Treasures of the Tuatha Dé Danann brought from the city of Murias. His club, the lorg mór, kills with one end and resurrects with the other — nine men fall with each swing of the striking end, and nine rise with each touch of the handle. His harp Uaithne, also called Daur Da Bláo (Oak of Two Blossoms), controls the seasons: it plays the three noble strains of Irish music — gentraige (joy), goltraige (sorrow), and suantraige (sleep) — and when the Fomorians stole it, the Dagda called it from the wall and it flew to his hands, killing nine men as it came. In the Cath Maige Tuired (Second Battle of Mag Tuired), preserved in a sixteenth-century manuscript now in the British Library (Harleian 5280), the Dagda mates with the Morrigan at the river Unshin on Samhain eve, securing her alliance before the great battle against the Fomorians. He is also tricked by the Fomorians into eating an enormous porridge from a hole in the ground, his belly swelling grotesquely — the texts do not spare his dignity. He wears a short tunic that exposes his backside, drags his club on wheels because it is too heavy to carry, and yet he is king and father and provider. The Lebor Gabála Érenn (Book of Invasions, compiled in the eleventh century and preserved in the Book of Leinster) names him ruler of Ireland for eighty years. What the Dagda models is abundance without refinement — the provider whose generosity is inseparable from his excess, whose power is comic and total and completely uninterested in looking dignified. The cauldron that never empties is not polite. It is the embarrassing, overflowing fact of enough.",
      "animals": ["boar", "horse"],
      "weapons": ["lorg mór (the great club)", "coire ansic (cauldron of abundance)"],
      "colors": ["brown", "red"],
      "consorts": ["Boann", "the Morrigan"]
    },
    {
      "id": "brigid",
      "name": "Brigid",
      "title": "Goddess of Poetry, Smithcraft, and Healing",
      "group": "danann",
      "description": "Brigid, daughter of the Dagda, governs the three crafts that most require the transformation of raw material into something that did not exist before: poetry, which transforms language; smithcraft, which transforms metal; and healing, which transforms the body. Sanas Cormaic (Cormac's Glossary, ninth century) calls her a goddess whom the filí (poets) worshipped because her protection was very great and very famous. The Cath Maige Tuired records that when her son Ruadán was killed attacking the smith Goibniu during the battle against the Fomorians, Brigid invented keening — the first mourning cry ever heard in Ireland — a sound that fused grief with art and became the template for Irish funeral lament across two millennia. She held two oxen, Fea and Femen, who gave their names to plains in Munster, and a boar named Torc Triath, king of the swine. Her sacred flame was tended by nineteen priestesses at Cill Dara (Kildare), a practice that survived into the Christian era through Saint Brigid's monastery, where the flame was kept burning continuously until the dissolution of the monasteries in the sixteenth century — and was relit in 1993 by the Brigidine Sisters, who tend it still. Her feast day, Imbolc (February 1), marks the first stirring of spring, the lactation of the ewes, the moment when the ground begins to soften. At the Giant's Causeway, the basalt columns were forged by the same process Brigid governs: raw material subjected to heat, cooled into precise geometric form, the volcanic equivalent of smithwork. She models the integration of what most cultures separate — the artist, the technician, and the healer understood as one figure doing one kind of work: taking what is broken or formless and giving it structure.",
      "animals": ["ewe", "cow", "swan"],
      "vegetation": ["dandelion", "snowdrop", "rushes (Brigid's cross)"],
      "colors": ["white", "green", "gold"],
      "consorts": ["Bres (Fomorian king, her husband)"]
    },
    {
      "id": "lugh",
      "name": "Lugh",
      "title": "God of All Skills",
      "group": "danann",
      "description": "Lugh Lámhfhada — Lugh of the Long Arm — arrived at the gates of Tara and was challenged by the doorkeeper: no one enters who does not possess an art. Lugh said he was a smith. 'We have a smith, Goibniu.' A warrior. 'We have a warrior, Ogma.' A harper. A poet. A sorcerer. A physician. A cupbearer. A brazier. Each time the doorkeeper named the Tuatha Dé Danann's existing master. Then Lugh asked: 'Do you have anyone who possesses all these arts at once?' The doors opened. This scene, from the Cath Maige Tuired (Second Battle of Mag Tuired), is the foundational statement of what Lugh represents: not the specialist but the polymath, the samildánach (equally skilled in all arts). His weapon is the Spear of Assal, one of the Four Treasures, brought from the city of Gorias — a spear so bloodthirsty it had to be kept with its tip submerged in a cauldron of poppy-seed solution to keep it from bursting into flame. He killed his grandfather Balor of the Evil Eye at the climax of the battle by casting a sling-stone through Balor's single enormous eye, driving it out the back of his skull so that its destructive gaze turned on the Fomorian army. Lugh's festival is Lughnasadh (August 1), the harvest feast he established in honor of his foster-mother Tailtiu, who died clearing the plains of Ireland for agriculture — a feast of gratitude for the labor of others, not a celebration of his own prowess. His father was Cian of the Tuatha Dé Danann; his mother was Ethniu, daughter of Balor — making Lugh the bridge between the divine Tuatha Dé and the monstrous Fomorians, the child of both civilizations. What he models is competence as integration: not mastery of one thing at the expense of everything else, but the recognition that all skills share a common root and the person who sees that root can learn anything.",
      "animals": ["raven", "lynx", "horse"],
      "weapons": ["Spear of Assal (Sleá Bua)", "sling-stone", "Fragarach (the Answerer — sword, in some traditions)"],
      "colors": ["gold", "white", "red"],
      "consorts": ["Dechtire (mother of Cú Chulainn, in some genealogies)", "Buí"]
    },
    {
      "id": "nuada",
      "name": "Nuada",
      "title": "King of the Tuatha Dé Danann",
      "group": "danann",
      "description": "Nuada Airgetlám — Nuada of the Silver Hand — lost his right arm at the First Battle of Mag Tuired against the Fir Bolg, when the warrior Sreng struck it off at the shoulder. Under Tuatha Dé law, no blemished king could rule, and so Nuada was forced to abdicate. Dian Cécht the physician fashioned him a fully functional arm of silver, but even this marvel was not enough — the silver arm could move and grip, but it was not flesh, and the law held. For seven years Bres, half-Fomorian and beautiful, ruled in Nuada's place and proved a tyrant: he taxed the Tuatha Dé into poverty, put the Dagda to digging ditches, and offered no hospitality. The poet Cairbre composed the first satire ever spoken in Ireland against Bres — the words raised boils on Bres's face, and a blemished king could not rule either. Meanwhile Dian Cécht's son Miach, a greater healer than his father, grew Nuada a new arm of real flesh and bone over nine days and nights — bone to bone, sinew to sinew, skin over all — and Nuada was restored to kingship. (Dian Cécht, in jealousy, killed Miach for surpassing him.) The Lebor Gabála names Nuada's sword as Claiomh Solais, the Sword of Light, another of the Four Treasures, brought from the city of Findias — once drawn, no enemy could escape it. Nuada fell in the Second Battle of Mag Tuired, killed by Balor's eye before Lugh avenged him. He encodes the tension every society faces between the ideal of leadership and the reality of damage: the wounded king, the law that demands perfection, the prosthetic that almost but not quite suffices, and the slower organic healing that finally restores what technology could only approximate.",
      "animals": ["hawk", "salmon"],
      "weapons": ["Claiomh Solais (Sword of Light)"],
      "colors": ["silver", "blue"],
      "consorts": ["Macha (in some traditions)"]
    },
    {
      "id": "ogma",
      "name": "Ogma",
      "title": "God of Eloquence and Writing",
      "group": "danann",
      "description": "Ogma Gríanainech — Ogma Sun-Face — is credited with the invention of Ogham, the earliest Irish writing system, composed of groups of parallel lines carved along the edges of standing stones. The Book of Ballymote (fourteenth century, now in the Royal Irish Academy) preserves the Ogham tract, Auraicept na n-Éces (The Scholars' Primer), which attributes the script to Ogma and names each letter for a tree: beithe (birch), luis (rowan), fearn (alder), sail (willow), nuin (ash). The system is arboreal — a forest encoded in stone. In the Cath Maige Tuired, Ogma is both champion and poet, a warrior-intellectual who seizes the great sword Orna from the Fomorian king Tethra after the battle and discovers that the sword can recount every deed it has performed. Under Bres's tyrannical reign, Ogma was reduced to carrying firewood — the god of eloquence hauling fuel, the sharpest possible image of what happens when a culture debases its own communicative capacities. His connection to the Causeway is through the stone itself: Ogham inscriptions survive on standing stones across Ireland and western Britain, the alphabet literally carved into basalt and sandstone, language made geological. The hexagonal columns of the Causeway are themselves a kind of natural script — repeating geometric units along a stone edge, patterns that look as though they were carved by intention. Ogma models the inseparability of physical strength and intellectual precision: the champion who fights at the front of the line is the same person who invented the alphabet. The culture did not separate these capacities, and the god who embodies both is a standing argument against the division.",
      "animals": ["stag", "dog"],
      "weapons": ["Orna (Tethra's sword, claimed in battle)"],
      "colors": ["gold", "grey"],
      "consorts": ["Etain (in some genealogies)"]
    },
    {
      "id": "dian-cecht",
      "name": "Dian Cécht",
      "title": "God of Healing",
      "group": "danann",
      "description": "Dian Cécht is the physician of the Tuatha Dé Danann who fashioned Nuada's silver hand, a prosthetic so fine it could grip and flex like the original — the first artificial limb in Western literature, described in detail in the Cath Maige Tuired. But the text does not let him remain the hero of that story. His son Miach surpassed him, regrowing Nuada's actual flesh arm through a nine-day procedure of sympathetic magic — placing the severed arm against the stump and chanting healing over it, bone to bone on the first three days, sinew to sinew on the second three, skin over all on the third. Dian Cécht, enraged at being surpassed, struck Miach on the head with his sword. He struck him four times: the first three wounds Miach healed himself, but the fourth cut through to the brain and killed him. Three hundred and sixty-five herbs grew from Miach's grave — one for every joint and sinew of the body — and Miach's sister Airmed gathered and arranged them on her cloak according to their properties, creating the first systematic herbal pharmacopoeia. Dian Cécht overturned the cloak, scattering the herbs, and the knowledge of their arrangement was lost. This is one of the most psychologically precise myths in the Irish corpus: the established practitioner who cannot tolerate being surpassed, who would rather destroy the advance than cede authority. During the Second Battle, Dian Cécht redeemed himself by presiding over the Well of Slaine, into which wounded Tuatha Dé warriors were lowered and emerged healed — a resurrection pool that kept the army fighting when the Fomorians could not replace their dead. He is both the healer and the obstacle to healing, and the tradition is honest enough to hold both.",
      "animals": ["serpent", "salmon"],
      "vegetation": ["the 365 herbs of Miach's grave (lost)", "watercress", "meadowsweet"],
      "colors": ["green", "silver"],
      "consorts": ["unnamed in the primary sources"]
    },
    {
      "id": "goibniu",
      "name": "Goibniu",
      "title": "The Divine Smith",
      "group": "danann",
      "description": "Goibniu is the smith of the Tuatha Dé Danann, one of the trí dé dána — the three gods of craft — alongside Luchta the wright and Creidne the metalworker. In the Cath Maige Tuired, these three form an arms-production line for the war against the Fomorians: Goibniu forges spearheads with three blows of his hammer, Luchta shapes the shafts with three cuts of his axe, and Creidne rivets them together with his bronze pins. Every weapon they produce strikes true and every wound it inflicts is fatal — the Fomorians cannot match this output. When the Fomorian spy Ruadán (Brigid's son, sent because his parentage gave him access to both sides) stabbed Goibniu with one of his own spears, the smith pulled the spear from his body and hurled it back, killing Ruadán, then walked to the Well of Slaine and was healed. Goibniu also hosts the Fled Goibhnenn, the Feast of Goibniu, an otherworld banquet where the ale brewed by the smith confers immortality on those who drink it — the smith-as-brewer, the forge and the feast inseparable. At the Giant's Causeway, the basalt itself is a product of the same process Goibniu governs: raw stone superheated beyond recognition, worked by pressure and cooling into forms of geometric precision. The hexagonal columns are what happens when molten rock is smithed by physics — the crystalline structure emerging not from chaos but from the exact rate of cooling, a forge that ran for thousands of years. He models the understanding that civilization rests on making — that the person who produces the tools, the weapons, the vessels, and the drink is not subordinate to the warrior or the king but is the infrastructure on which both depend.",
      "animals": ["crane", "boar"],
      "weapons": ["hammer", "forge-tongs", "the spear pulled from his own body"],
      "colors": ["black", "red", "orange"],
      "consorts": ["unnamed in the primary sources"]
    },
    {
      "id": "manannan",
      "name": "Manannán mac Lir",
      "title": "God of the Sea",
      "group": "danann",
      "description": "Manannán mac Lir, son of the sea (Lir meaning 'ocean' rather than naming a specific father), rules from Emain Ablach, the Isle of Apple Trees, identified with the Isle of Arran or the Isle of Man, which bears his name. He wears a cloak that shifts through every color of the sea, rides a chariot across the waves as though they were plains, and owns the horse Aonbharr (Splendid Mane), which can gallop over water as easily as land. His sword Fragarach, the Answerer (also attributed to Lugh), compels truth from anyone at whose throat it is held — no one can move or lie with Fragarach at their neck. The Immram Brain (Voyage of Bran), an eighth-century text, places Manannán on the sea between worlds, singing to Bran that what the mortal perceives as ocean is, from Manannán's perspective, a flowered plain where chariots race and salmon leap like calves. This is not metaphor for Manannán — his perception is literal, and the barrier between his world and the human world is thinner on the sea than anywhere on land. In the Acallam na Senórach (Colloquy of the Ancients, preserved in the Book of Lismore), he shakes his cloak between lovers to ensure they forget each other, the sea as barrier and forgetting. After the Tuatha Dé Danann were defeated by the Milesians and retreated into the sídhe (hollow hills), Manannán was the one who assigned each god their mound, raised the féth fíada (mist of invisibility) to conceal the otherworld entrances, and brewed the ale of forgetfulness that made the gods content with their diminishment. The Giant's Causeway extends directly into his domain — the basalt columns descend below the tide line and continue under the North Channel toward Staffa, a road that leads from Ireland into the sea, into Manannán's territory. He models the liminal: the figure who stands at the boundary between the known and the unknown, between Ireland and the Otherworld, between grief and forgetting, and who controls passage across every threshold.",
      "animals": ["horse (Aonbharr)", "crane", "seabird"],
      "weapons": ["Fragarach (the Answerer)", "crane-skin bag (corrbolg) containing treasures"],
      "colors": ["sea-green", "blue", "silver", "white"],
      "consorts": ["Fand", "Áine (in Munster traditions)"]
    },
    {
      "id": "danu",
      "name": "Danu / Anu",
      "title": "The Mother Goddess",
      "group": "sovereign",
      "description": "Danu is the figure who gives the Tuatha Dé Danann their name — the People of the Goddess Danu — and yet she is almost entirely absent from the surviving texts. She has no stories, no dialogue, no recorded actions. She exists primarily in the name itself and in the landscape. Sanas Cormaic (Cormac's Glossary) identifies Anu as the mother of the Irish gods and names the Dá Chích Anann (the Two Paps of Anu), twin breast-shaped hills in County Kerry, as her body made geographical. These are real hills, still called by that name, their profiles unmistakably anatomical against the skyline. In some scholarly traditions Danu and Anu are the same figure; in others they are distinct, with Anu governing prosperity and fertility in Munster while Danu remains the eponymous ancestor of the divine race. The continental Celtic goddess Dôn in the Welsh Mabinogi may be cognate, and the river Danube likely carries a form of her name across central Europe — a goddess so ancient her traces are hydrological, embedded in the water systems of the continent. Her near-absence from the narrative record is itself significant: she predates the stories, belongs to a stratum of belief older than the mythological cycle, a figure the monks who compiled the Lebor Gabála could name but not narrate because no tale of hers had survived the transition into their literate tradition. At the Causeway coast, where the basalt descends into the sea and the land meets the North Channel, her presence is in what underlies everything — the bedrock beneath the columns, the geological mother-layer from which the volcanic formations erupted. She models the ground of being: the source so fundamental it precedes character, narrative, and event, known only by what it produced.",
      "animals": ["cow", "mare"],
      "vegetation": ["oak", "hawthorn"],
      "colors": ["green", "brown", "earth tones"]
    },
    {
      "id": "morrigan",
      "name": "The Morrígan",
      "title": "Goddess of War, Fate, and Death",
      "group": "sovereign",
      "description": "The Morrígan — Great Queen, or Phantom Queen — appears as one and as three: herself, Badb (the hooded crow who screams over battlefields), and Macha (sovereignty goddess of Ulster). She does not fight in battles; she determines them. Before the Second Battle of Mag Tuired, she mates with the Dagda at the river Unshin on Samhain eve, straddling the water with one foot on each bank, and in exchange promises to bring the powers of her sorcery against the Fomorians — she will strip from them their courage, the blood of their hearts, and the kidneys of their valor. In the Táin Bó Cúailnge (preserved in the Book of the Dun Cow, twelfth century, and the Book of Leinster), she appears to Cú Chulainn first as a beautiful woman offering her love, and when he refuses her in the midst of combat, she attacks him as an eel wrapping his legs, a grey-red she-wolf driving cattle at him, and a white red-eared heifer leading a stampede. He wounds her in each form, and she later comes to him as an old woman milking a cow with three teats, each teat corresponding to one of her wounds; he blesses her three times for the milk and inadvertently heals her. She is found washing armor at a ford the night before men die — the bean nighe, the washerwoman at the ford, an image that persisted in Irish and Scottish folklore for centuries. After the defeat of the Fomorians, the Morrígan speaks a prophecy in two parts: the first celebrates the restored world, rivers full of fish, forests heavy with mast; the second foresees the end of all things, a world without honor, sons betraying fathers, summer without flowers. Both prophecies are true simultaneously. She models the capacity to hold triumph and catastrophe in one vision — the psychological function of facing what is coming without flinching, the part of the mind that processes violence before it arrives.",
      "animals": ["hooded crow (Badb)", "eel", "grey wolf", "red-eared white heifer"],
      "colors": ["black", "red", "grey"],
      "consorts": ["the Dagda (Samhain union at the river Unshin)"]
    },
    {
      "id": "aengus",
      "name": "Aengus Óg",
      "title": "God of Love and Youth",
      "group": "sovereign",
      "description": "Aengus Óg — Aengus the Young — is the son of the Dagda and Boann, conceived during an affair while Boann's husband Elcmar was away. The Dagda held the sun still for nine months so that Aengus was conceived and born in a single day, making him technically conceived in wedlock by the measure of time. He dwells at Brú na Bóinne (Newgrange), which he won from his foster-father Elcmar through a legal trick: he asked to hold the brú for a day and a night, and since in Irish law 'a day and a night' constitutes the whole of time, the claim was permanent. The Aislinge Óenguso (Dream of Aengus, preserved in a fifteenth-century manuscript, Egerton 1782) tells how he fell in love with a woman he saw only in his sleep, Caer Ibormeith, who existed alternately as a woman and a swan, switching form each Samhain. He found her at Loch Bél Dracon in the shape of a swan among one hundred and fifty other swans, all chained in pairs with silver chains. He called to her, transformed into a swan himself, and they circled the lake three times singing a melody that put everyone who heard it into a sleep lasting three days and three nights. The four birds that hover perpetually above his head are his kisses made visible. He is the patron of lovers, poets, and young men, and his domain at Newgrange — which predates the pyramids of Giza and is oriented so that sunlight pierces its passage tomb on the winter solstice — places him at the intersection of love, death, and astronomical precision. He models the force that makes you pursue what you have seen only in dreams, the willingness to transform yourself completely in order to meet the beloved in their own form.",
      "animals": ["swan", "songbirds (his four kiss-birds)"],
      "colors": ["white", "gold", "silver"],
      "consorts": ["Caer Ibormeith (the swan-woman)"]
    },
    {
      "id": "bodb-dearg",
      "name": "Bodb Dearg",
      "title": "King after the Dagda",
      "group": "sovereign",
      "description": "Bodb Dearg — Bodb the Red — succeeded the Dagda as king of the Tuatha Dé Danann after they retreated into the sídhe, the hollow hills, following their defeat by the Milesians. The succession was contested: Manannán, Midir, and Lir all had claims, and Bodb won by the assembly's choice, not by combat — a detail preserved in the Acallam na Senórach and the Lebor Gabála that reflects the Irish legal tradition of elected kingship rather than strict primogeniture. His sídh was at Síd ar Femen in County Tipperary, near the Galtee Mountains. He plays his most significant role in Oidhe Chloinne Lir (The Fate of the Children of Lir), one of the Three Sorrows of Storytelling. When Lir's second wife Aoife transformed his four children into swans out of jealousy, cursing them to spend nine hundred years on three different bodies of water, it was Bodb Dearg who punished Aoife by striking her with a druidic wand and turning her into a demon of the air for eternity. He could not break the curse — that required the sound of a Christian bell, which would not ring for centuries — but he ensured the enchantress suffered for it. He later decreed that no one of the Tuatha Dé Danann would ever again take the form of a swan, an edict born from grief over his foster-grandchildren. Bodb Dearg models the administrative king — not the warrior-hero or the wonder-worker, but the elected ruler who maintains order after the age of miracles, who adjudicates disputes, assigns the sídhe, enforces consequences, and keeps the diminished nation coherent in exile. He is the god of governance when governance is no longer glamorous, the steady hand after the golden age.",
      "animals": ["red hawk", "boar"],
      "colors": ["red", "gold"],
      "consorts": ["unnamed in the primary sources"]
    },
    {
      "id": "cernunnos",
      "name": "Cernunnos",
      "title": "The Horned God",
      "group": "other",
      "description": "Cernunnos is named exactly once in the surviving record: on the Pillar of the Boatmen (Pilier des nautes), a first-century Gallo-Roman monument discovered beneath Notre-Dame de Paris in 1711, where the inscription [C]ERNUNNOS appears above a figure with antlers from which hang two torcs. His image appears far more widely — on the Gundestrup Cauldron (found in a Danish bog, likely of Thracian or Gaulish manufacture, second or first century BCE), he sits cross-legged, antlered, holding a torc in one hand and a ram-headed serpent in the other, surrounded by animals: stag, bull, dolphin, lion, dog. He is elsewhere on the Val Camonica rock carvings in northern Italy (fourth century BCE), antlered and surrounded by serpents. He has no surviving mythology — no stories, no speeches, no genealogy — only images, repeated across the Celtic world from Ireland to Romania, consistent enough to establish a recognizable deity and sparse enough to invite projection. In Ireland, the closest analogue may be the figure of the fer benn, the horned man, who appears in early Irish legal texts as a boundary figure, and the stag imagery associated with Fionn mac Cumhaill and the Fianna, whose hunts in the forests of Ireland were rituals of pursuit and transformation. The Causeway coast was red deer territory for millennia — the giant Irish elk (Megaloceros giganteus), with antlers spanning twelve feet, survived on the island until roughly 7,700 years ago, and its bones have been found in peat bogs and caves across Antrim. Cernunnos, seated among animals with antlers branching from his skull, is the image of the human who has not separated from the animal world — the pre-agricultural consciousness that understood itself as one species among many, connected by the cycle of predation, transformation, and seasonal renewal. He models what cultures lose when they urbanize: the felt kinship with other living things, the antlers that grow and shed and grow again.",
      "animals": ["red deer stag", "ram-headed serpent", "bull", "dog", "rat"],
      "colors": ["brown", "green", "antler-white"],
      "consorts": ["none recorded"]
    },
    {
      "id": "fionn",
      "name": "Fionn mac Cumhaill",
      "title": "The Warrior-Seer",
      "group": "other",
      "description": "Fionn mac Cumhaill — Finn McCool in the anglicized form that stuck to the Causeway — is the mythic hero who built the Giant's Causeway itself, tearing up chunks of the Antrim coast to lay a path across the North Channel to Scotland so he could fight the Scottish giant Benandonner. When Benandonner turned out to be far larger than expected, Fionn's wife Oonagh disguised him as a baby; Benandonner, seeing the size of the 'infant' and imagining the father's proportions, fled back across the causeway, ripping it up behind him. The surviving stumps are the columns. This folk explanation for the basalt hexagons is so persistent that it is inseparable from the site — no visitor encounters the geology without encountering Fionn. But he is far older and stranger than the folk tale. The Fenian Cycle, preserved across the Acallam na Senórach (Book of Lismore), Duanaire Finn (the Poem-Book of Fionn, a seventeenth-century manuscript of much older material), and dozens of shorter tales, presents him as the leader of the Fianna, a roving warrior band that lived outside settled society, hunting in the forests and defending Ireland's borders. As a boy, he burned his thumb on the Salmon of Knowledge (Bradán Feasa) while cooking it for the poet Finnegas, who had waited seven years to catch it; sucking his burned thumb, Fionn absorbed the salmon's wisdom and could thereafter access supernatural knowledge by biting his thumb — the imbas forosnai, the illumination of tradition. He is both warrior and seer, hunter and poet, the figure who lives at the edge of civilization and protects it precisely because he is not domesticated by it. His son Oisín rode to Tír na nÓg with Niamh of the Golden Hair and returned centuries later to find the Fianna gone and Ireland Christian — the most devastating time-displacement story in Irish literature. At the Causeway, Fionn is the bridge-builder, the one who tried to connect Ireland to the world beyond the sea, and the story of his trick encodes a culture's humor about its own relationship to overwhelming force: when you cannot beat the giant, reframe the terms.",
      "animals": ["Irish wolfhound (Bran and Sceólang)", "deer", "salmon"],
      "weapons": ["Mac an Luin (Son of the Waves — his sword)", "Birga (javelin)", "Corrbolg (crane-skin bag, inherited from Manannán)"],
      "colors": ["white (fionn means 'fair/bright')", "green", "brown"],
      "consorts": ["Sadhbh (mother of Oisín, transformed into a deer)", "Gráinne (who eloped with Diarmuid)"]
    }
  ]
}
