{
  "id": "celtiberian",
  "name": "The Gods of Iberia",
  "description": "This is a pantheon reconstructed almost entirely from stone. The pre-Roman peoples of the Iberian Peninsula — Lusitanians, Gallaeci, Vettones, Celtiberians — left no mythological texts, no epic poems, no narrative theology. What they left are inscriptions: votive altars, dedicatory plaques, rock-carved prayers in Latin and in indigenous languages that linguists are still working to fully decode. The Cabeço das Fraguas inscription in the Lusitanian language records a suovetaurilia — a triple sacrifice of pig, sheep, and bull — addressed to named deities. The Botorrita bronze tablets preserve Celtiberian script on four plaques that include census lists, legal verdicts, and what may be ritual texts. The Panóias sanctuary near Vila Real has ritual basins carved directly into living granite, with Greek and Latin inscriptions describing step by step how to sacrifice, where to collect the blood, where to burn the viscera. This is religion documented in procedure, not narrative. The gods here have names, epithets, geographic affiliations, and evidence of devotion — but almost no surviving stories. Endovélico alone has over eighty dedicatory inscriptions, more than most Roman gods receive at a single site. The devotion was real. The mythology behind it is gone. What remains is the inverse of what we usually study: prayers without myths, ritual without narrative, names carved into stone by people who clearly believed these gods could hear them. The psychological weight of that silence — gods you can name but cannot narrate — is itself a kind of theology.",
  "deities": [
    {
      "id": "endovelico",
      "name": "Endovélico",
      "title": "The Healing Oracle of São Miguel da Mota",
      "group": "chthonic",
      "description": "Endovélico is the best-documented pre-Roman deity in all of Western Europe, and the documentation itself is the most remarkable thing about him. Over eighty Latin votive inscriptions have been recovered from his sanctuary at São Miguel da Mota in the Alentejo region of Portugal — roughly a third of all theonymic inscriptions found in the entire country. The site yielded not only altars but bronze and terracotta figurines, pottery, amphorae, and surgical instruments, suggesting it functioned as a combined healing sanctuary and oracular center. Dedicants came from across Lusitanian and Roman provincial society. The inscriptions date primarily from the first through fourth centuries CE, meaning the cult survived Romanization and thrived under it. His name likely derives from a Celtic root meaning 'very black' or 'deeply dark,' pointing to chthonic — underworld — associations. Romans syncretized him variously with Aesculapius (healing), Serapis (oracular power), and Silvanus (wild places), which suggests he defied neat equivalence. He was not one Roman god. He was several, or none. The archaeological record at São Miguel da Mota shows a sanctuary where people came to sleep and dream — incubation healing, the same practice documented at Epidaurus in Greece. The surgical instruments suggest that dreams and medicine were not separate categories here. You came to Endovélico's temple sick, slept on sacred ground, dreamed what the god showed you, and were treated. That over eighty separate individuals carved their gratitude into stone tells you the success rate was perceived as high enough to sustain the cult for three centuries."
    },
    {
      "id": "ataecina",
      "name": "Ataecina",
      "title": "The Underworld Goddess of Turobriga",
      "group": "chthonic",
      "description": "Ataecina — also written Ataegina — is the goddess of the underworld in Lusitanian and Celtiberian religion, and the Romans knew exactly who she was to them: Proserpina. Approximately fifty votive inscriptions attest her worship across Lusitania and Baetica, concentrated in the Badajoz region of western Spain. Her full cultic title, preserved in stone, is Dea Ataecina Turibrigensis Proserpina — the goddess Ataecina of Turobriga, who is Proserpina. The location of Turobriga itself remains disputed; Pliny placed it in Celtic Beturia, but no excavation has conclusively identified the site. Her name may derive from a Celtic root meaning 'reborn' or 'returning,' which aligns precisely with a Proserpina identification — the goddess who descends and returns, governing the seasonal boundary between death and renewal. One marble dedication found at Augusta Emerita (modern Mérida) is a curse tablet: the dedicant prays to Dea Ataecina Turibrigensis Proserpina to avenge the theft of several pieces of clothing. This is not abstract devotion. This is a person who lost their laundry and went to the queen of the underworld for justice. The intimacy of that appeal — bringing a petty grievance to a chthonic power — tells you more about lived religion than any theological treatise. Ataecina was not distant. She was the goddess you went to when the living world failed you, whether the failure was death or stolen garments. The gates of the underworld opened for both."
    },
    {
      "id": "bandua",
      "name": "Bandua",
      "title": "The Protector of Communities",
      "group": "war",
      "description": "Bandua is one of the most widely attested deities in pre-Roman Iberia and one of the hardest to pin down. Forty-seven inscriptions and counting, spread from Galicia in the north to the Alentejo in the south, with outliers as far east as Toledo and Zaragoza. The geographic range alone makes Bandua a supra-regional power — not a local spirit bound to one spring or one hilltop, but a deity recognized across Lusitanian, Gallaecian, Vettonian, and Celtiberian territories. The name appears in nearly every conceivable spelling variant: Bandi, Bandei, Bandu, Bandue, Bandiae. Almost every inscription pairs the theonym with a geographic epithet — Bandua Roudaeco, Bandua Etobrico, Bandua Brealiacui — tying the god to a specific community or locale. This pattern has led scholars to debate whether Bandua is a single deity worshipped under local titles or a category of protective deity, a divine function rather than a divine individual. The functional interpretation is compelling: Bandua as 'the protector,' invoked by each community under its own place-name, binding the deity to the people rather than to a universal myth. Some scholars have proposed that Bandua and Cosus may be the same deity under different regional names, both serving as tutelary war-gods parallel to Mars. What is certain is that Bandua was predominantly male, associated with communal protection, and worshipped with a consistency that survived Roman administrative reorganization of the peninsula. When your god's name appears on stone from the Atlantic coast to the Ebro valley, the cult is not local. It is a theology of belonging — each town claiming its own version of the same divine shield."
    },
    {
      "id": "nabia",
      "name": "Nabia",
      "title": "The Goddess of Rivers and Sacred Waters",
      "group": "nature",
      "description": "Nabia is the most frequently recorded female deity in western Hispania, attested in twenty-eight inscriptions across Gallaecia, Lusitania, and Vettonian territory. She is a water goddess — associated with rivers, springs, fountains, and the sacred dimension of flowing water — but her epigraphic record reveals something more complex than a simple nature spirit. At Marecos near Peñafiel and at Mount Candanedo, she appears as Iuppiter Nabiacus — Jupiter Nabiacus — syncretized not with a Roman goddess but with the king of the Roman gods himself. At least eighteen epigraphs across Lusitania and Gallaecia document hybrid forms where Nabia's name fuses with Roman divine hierarchies while retaining its indigenous character. Elsewhere she is identified with Diana, Juno, or Victoria, depending on the local context. This scatter of Roman equivalences suggests that Nabia was not simply 'the water goddess' in a narrow sense. She may have been two deities conflated under one name, or a single goddess whose portfolio — fertility, defense, sovereignty, health — was broad enough that no single Roman counterpart could contain her. The diversity of archaeological contexts where her inscriptions appear — urban sanctuaries, rural shrines, river crossings, mountaintops — reinforces this breadth. Water in pre-Roman Iberian religion was not decorative. It was the medium through which divine power moved in the landscape, and Nabia was its personification. The rivers that bore her name or her worship were not metaphors. They were her body, flowing through the territory, connecting the communities that prayed at her banks."
    },
    {
      "id": "trebaruna",
      "name": "Trebaruna",
      "title": "The Secret of the Household",
      "group": "war",
      "description": "Trebaruna survives in exactly three Latin inscriptions — from Idanha-a-Velha, Coria, and Lardosa — and in the Lusitanian-language inscription at Cabeço das Fraguas, where she receives the sacrifice of a sheep. That is the entire textual record of a goddess whose name may encode one of the most intimate theological concepts in the Celtiberian world. Her name is generally derived from Celtic *trebo- ('home,' 'dwelling,' 'settlement') and *runa ('secret,' 'mystery'): the mystery of the home, the sacred secret of the household. If this etymology holds, Trebaruna was not a war goddess or a nature deity but something rarer — a goddess of domestic sanctity, the divine power that makes a house a home and a settlement a community. At Cabeço das Fraguas she appears alongside Reue, the sky god, in what appears to be a liturgical sequence of sacrificial offerings to paired deities. Some scholars read her as Reue's consort — the queen to his king — which would place her at the apex of the Lusitanian divine hierarchy. The theonymic cluster she belongs to — Bandua, Reue, Arentius, Arentia, Nabia, Trebaruna — maps almost exactly onto the heartland of Lusitanian tribal territory and vanishes at the Vettonian border, suggesting these gods traveled with a specific people. Three inscriptions and a sheep sacrifice. That is all that remains of the mystery of the home. Whatever rituals attended Trebaruna's worship, whatever prayers were spoken at domestic hearths in her name, whatever the secret actually was — the stone remembers her name but not her story."
    },
    {
      "id": "reue",
      "name": "Reue",
      "title": "The Sky God of Thunder and Mountains",
      "group": "war",
      "description": "Reue — also written Reve, Reo, or Reva — is the most widely referenced deity in the core Lusitanian pantheon, attested in twenty-three epigraphs as of current scholarship. He is a sky god: associated with lightning, thunder, mountains, and the authority to sit in judgment. Romans syncretized him with Jupiter, which tells you his structural position — he was the supreme male deity, the celestial sovereign, the one whose voice was the storm. The Cabeço das Fraguas inscription prescribes for him the highest-status sacrifice: a breeding bull. In the Indo-European suovetaurilia pattern that the inscription follows — pig, sheep, bull — the bull goes to the chief god. Reue received the bull. His epithets tie him to specific mountains and high places, reinforcing the vertical theology: Reue is above, on peaks, in storms, looking down. His consort was likely Trebaruna, and together they may have formed the divine couple at the center of Lusitanian religion — sky father and household mystery, the public sovereign and the private sacred. The name Reue may connect to the Proto-Celtic *rewos ('open space,' 'plain') or to Indo-European roots related to flowing and abundance. The inscription at Cabeço das Fraguas gives his name in what appears to be a dative form — Reve Tre[...] — suggesting a full cultic title with a geographic or functional epithet that the damaged stone no longer preserves. Twenty-three inscriptions is a substantial corpus, but not one of them tells a story. We know Reue was supreme. We know he received bulls. We know he lived on mountains. The mythology that would explain why — the Lusitanian theogony, their storm narratives, their account of divine kingship — is irretrievably gone."
    },
    {
      "id": "arentius-arentia",
      "name": "Arentius & Arentia",
      "title": "The Divine Couple of the Beira Interior",
      "group": "chthonic",
      "description": "Arentius and Arentia are a divine couple attested in fourteen inscriptions, all concentrated in a remarkably tight geographic zone: the Beira Interior region of Portugal and the westernmost edge of Spanish Extremadura. They appear together in six inscriptions, Arentius alone in four, Arentia alone in one, and the remaining attestations include variant epithets. This is a cult with borders. Unlike Bandua or Nabia, whose worship spanned the peninsula, Arentius and Arentia belonged to a specific territory and a specific people. Their pairing echoes Gallo-Roman divine couples — Apollo Grannus with Sirona, Apollo Borvo with Damona, Mercury with Rosmerta — and like those pairs, the Roman syncretisms for Arentius shift depending on context: sometimes Apollo, sometimes Mercury, suggesting a versatile god whose functions ranged from herding to craftsmanship to healing. Arentia carries the epithet Equotullaicensi in one inscription, which may connect her to horses or to a specific locality. The divine couple structure itself is significant. In a religious landscape where many deities appear as isolated names on isolated altars, Arentius and Arentia are consistently relational — defined by their partnership, their shared altars, their co-presence. Whatever theology produced them understood divinity as something that functions in pairs: masculine and feminine, complementary, geographically rooted, inseparable in worship even when one name appears alone. The Beira Interior mountains where their cult thrived are granite country — the same living rock into which the Panóias sanctuary was carved. These gods belonged to hard stone and the people who lived among it."
    },
    {
      "id": "cossue",
      "name": "Cossue",
      "title": "The War God of the Northwestern Coast",
      "group": "war",
      "description": "Cossue — also rendered Cosus, Coso, or Conso — is a deity of the Iberian northwest, attested on nineteen altars concentrated along the Gallaecian coast and the Douro river region. His worship pattern is distinctly maritime and riverine: coastal settlements, harbor towns, river crossings. Romans equated him with Mars, which positions him as a war god, a divine warrior, a protector through force. His epithets — Udunnaeo, Viascanno, Paeteaico, Soaegoe, Oenaego, Neneoec(o) — are mostly opaque, tied to locations or communities whose names survive only in these dedications. One epithet is Latin: Domino, 'Lord,' which if counted among his altar corpus raises the total to twenty-one. Some scholars have proposed that Cossue and Bandua are the same deity under different regional names — both serve protective and martial functions, both carry geographic epithets, both are supra-local. The difference is distribution: Bandua stretches across the entire western peninsula, while Cossue clusters in the northwest, among the Gallaeci and the Celtic peoples of the coast. If they are distinct, then pre-Roman Iberia had at least two major war-god traditions operating in overlapping but different territories. If they are the same, then the naming itself becomes the theology — the same divine protector known by different names depending on which river valley you prayed in, which coast you sailed from. A votive offering from Oleiros in Pontevedra confirmed that Cossue's primary worship zone was the territory of the northwestern Celtic peoples. Nineteen altars on the Atlantic coast, facing the ocean. A war god who watched the water."
    },
    {
      "id": "lugus",
      "name": "Lugus",
      "title": "The Shining One at Peñalba de Villastar",
      "group": "war",
      "description": "Lugus — the Celtiberian form of the pan-Celtic deity known as Lugh in Ireland, Lleu in Wales, and Lugus across Gaul — is attested in Iberia primarily through a single extraordinary inscription at the rock sanctuary of Peñalba de Villastar, near Teruel in Aragon. The sanctuary sits along a 1,500-meter limestone cliff face bearing hundreds of inscriptions and graffiti, discovered by Juan Cabré in 1910. Approximately twenty-five Celtiberian inscriptions have been identified at the site, and the longest — first published in 1942 — contains a dedication to LUGUEI, the dative singular of Lugus. This is one of very few inscriptions anywhere in the Celtic world that attests Lugus as a singular deity rather than in the plural Lugoves. The significance is pan-Celtic: Lugus is the only god whose name appears in Gaulish, Insular Celtic, and Iberian Celtic sources, connecting the Celtiberians of the Ebro valley to a divine tradition stretching from Ireland to Anatolia. Place-names derived from Lugus mark his cult across Europe: Lyon (Lugdunum), Leiden (Lugdunum Batavorum), Carlisle (Luguvalium). In Iberia, Lucus Augusti (modern Lugo) carries his name. But at Peñalba, we have something rarer than a place-name — we have a prayer, carved into cliff-face limestone, in a language that was dying, addressed to a god whose mythology survives fully only in the Irish and Welsh traditions written down a thousand years later. The Celtiberian Lugus stands at the intersection of what the Irish sagas remember and what the Iberian rock preserves: the same name, the same devotion, separated by an ocean of lost narrative."
    },
    {
      "id": "iccona",
      "name": "Iccona Loiminna",
      "title": "The Great Mare of the Lusitanian Rock",
      "group": "nature",
      "description": "Iccona Loiminna appears once — in the Lusitanian-language inscription at Cabeço das Fraguas, the same text that names Trebaruna and Reue. She is generally identified as the Lusitanian cognate of the Gaulish Epona, the horse goddess, based on the linguistic parallel: Gaulish epos ('horse') maps onto a reconstructed Lusitanian *ekko-, and the suffix -ona ('great') appears in both names. If the identification holds, Iccona is the Great Mare — the divine horse, the protector of equines, the goddess of cavalry, fertility, and the bond between humans and the animals they depended on for survival, transport, and war. Epona's cult was one of the most successful religious exports in the ancient world — she is the only Celtic deity known to have been officially worshipped in Rome itself, adopted by the Roman cavalry as their patroness, celebrated on December 18th in the imperial calendar. Dedicatory inscriptions to Epona span from Britain to the Danube. In Cantabria, the form Epane appears on an inscription from Mount Bernorio. But at Cabeço das Fraguas, the name is not Epona — it is Iccona Loiminna, in the Lusitanian language, in an indigenous script, in a sacrificial context that predates Roman contact. This is the horse goddess before Rome found her. The epithet Loiminna remains untranslated — it may refer to a quality, a place, or a function that the Lusitanian language carried and that no Roman equivalent preserved. She received her sacrifice on that granite hilltop alongside the sky god and the mystery of the household, part of a liturgy whose words we can partially read and whose meaning we can only approximate."
    }
  ]
}