{
  "id": "chinese",
  "name": "The Celestial Court",
  "description": "The gods of the Chinese religious universe, anchored to Mount Tai — Taishan — the most revered of China's Five Sacred Peaks. For over three thousand years, emperors climbed Taishan to report to Heaven, and the souls of the dead were believed to gather at its base for judgment. The Celestial Court is not one tradition but three braided together: Daoist cosmology with its immortals and alchemical heavens, Buddhist compassion translated through Chinese sensibility, and the folk religion that was here before either arrived and absorbed them both. The Jade Emperor presides, but the system is bureaucratic, not monarchic — heaven runs like a vast imperial ministry, with departments for weather, seas, kitchens, and the underworld, each staffed by deities who can be promoted, demoted, or replaced. It is a cosmos that mirrors the Chinese state, and the Chinese state that mirrors the cosmos.",
  "deities": [
    {
      "id": "pangu",
      "name": "Pangu",
      "title": "The First Being",
      "group": "primordial",
      "description": "Before heaven and earth existed, there was only hundun — primordial chaos, formless and dark, shaped like a cosmic egg. Inside that egg, Pangu slept for eighteen thousand years. When he woke, he found the darkness suffocating and swung a great axe, splitting the egg in two. The light and clear matter rose to become heaven (tian); the heavy and turbid matter sank to become earth (di). Pangu stood between them, pushing them apart, growing ten feet taller each day for another eighteen thousand years until the sky was impossibly high and the earth impossibly thick. When he finally died — exhausted by the labor of keeping the cosmos from collapsing back into itself — his body became the world. His breath became the wind and clouds. His voice became thunder. His left eye became the sun, his right eye the moon. His blood became rivers, his veins became roads, his flesh became fields, his hair became the stars. His bones became minerals, his marrow became jade and pearls. His sweat became rain. Even the parasites on his body became human beings, in some versions — a creation myth remarkably without vanity, humanity as an afterthought crawling on the skin of something incomprehensibly larger. The Pangu myth does not appear in the earliest Chinese texts; it emerged in the third century CE, possibly influenced by Central Asian creation stories that traveled the Silk Road. But it filled a gap the older cosmogonies left open, and became the standard Chinese account of how something came from nothing. Mount Tai, the eastern peak, is sometimes called the first piece of earth to solidify from Pangu's body — the mountain that rose first when chaos divided.",
      "animals": ["Dragon", "Tortoise"],
      "weapons": ["Axe of Pangu (the tool that split chaos)"],
      "colors": ["Black", "White"]
    },
    {
      "id": "nuwa",
      "name": "Nuwa",
      "title": "Creator of Humanity",
      "group": "primordial",
      "description": "After Pangu's death made the world, the world was empty. Nuwa, serpent-tailed goddess, walked along the banks of the Yellow River and felt lonely. She scooped up yellow clay and shaped it into small figures, and when she breathed on them they came alive — the first human beings. She made them one by one, carefully, each with a face and limbs. But the work was slow and the earth was vast, so she dipped a rope into the mud and flicked it, and everywhere a droplet landed a person sprang up. The ones she shaped by hand, the old story goes, became the nobles; the ones flung from the rope became the commoners. It is a creation myth that embeds class structure into the act of creation itself — uncomfortable, honest, and very Chinese. But Nuwa's greater deed came after. When the cosmic pillar cracked and the sky tilted, pouring flood and fire across the earth, she smelted stones of five colors and patched the heavens. She cut the legs off a giant turtle and used them as pillars to hold up the four corners of the sky. She dammed the floodwaters with reed ash. She restored order — not through divine fiat but through labor, engineering, and material. She is often paired with Fuxi as consort and co-creator; in Han dynasty tomb art they appear intertwined, serpent tails coiled together, he holding a carpenter's square and she holding a compass — geometry and order embracing. Nuwa is not worshipped at Mount Tai specifically, but the mountain's role as the axis between heaven and earth depends on the sky she repaired holding firm above it. Every pilgrimage up those stone steps walks under a ceiling she patched with melted stone.",
      "animals": ["Serpent (her own lower body)", "Turtle"],
      "consorts": ["Fuxi"],
      "colors": ["Five colors (the stones she smelted: red, yellow, blue, white, black)"],
      "weapons": ["Compass"]
    },
    {
      "id": "fuxi",
      "name": "Fuxi",
      "title": "The Civilizer",
      "group": "primordial",
      "description": "First of the Three Sovereigns, serpent-bodied like his sister-consort Nuwa, the one who gave humanity the tools to be human. He looked up and studied the patterns of the sky. He looked down and studied the markings on the earth. He observed the tracks of birds and beasts, the veins of leaves, the lines on tortoise shells, and from all of this reading he derived the Eight Trigrams — bagua — the foundational binary code of Chinese cosmology, three lines stacked, each broken or unbroken, yielding eight combinations that map every natural force: heaven, earth, water, fire, mountain, lake, wind, thunder. The trigrams became the basis of the Yijing, the Book of Changes, the oldest continuously consulted oracle in human history. But Fuxi's gifts were practical as much as metaphysical. He taught humans to fish with nets. He taught them to herd animals and cook with fire. He invented the institution of marriage, establishing family as the basic unit of civilization, and he created the first Chinese writing system — knotted cords that preceded characters. Where Nuwa shaped the body, Fuxi shaped the mind. In Han dynasty iconography they are inseparable: two figures with human torsos and serpent tails wound together, he holding the carpenter's square (rules, structure, yang) and she holding the compass (curves, creation, yin), the two instruments required to draw anything that exists. He is associated with the east, with spring, with the trigram Zhen (thunder, arousing), and with the deep claim that nature is not random but patterned — and that a sufficiently careful observer can read the pattern. Mount Tai stands in the east, where the sun rises, where Fuxi's direction points, where the year begins. The mountain's ancient name, Dai Zong, 'the ancestral peak,' echoes Fuxi's role as the ancestor who taught humanity to see structure in the world.",
      "animals": ["Dragon", "Tortoise (whose shell revealed the trigrams)"],
      "consorts": ["Nuwa"],
      "weapons": ["Carpenter's square"],
      "colors": ["Green", "Gold"]
    },
    {
      "id": "jade-emperor",
      "name": "Jade Emperor",
      "title": "Supreme Ruler of Heaven",
      "group": "celestial",
      "description": "Yu Huang Shangdi, the Jade Emperor, Supreme August Emperor of Heaven, presides over the Celestial Court from his throne in the highest of the thirty-six heavens. He is not the oldest god, nor the most powerful in raw cosmological terms — the Three Pure Ones (Sanqing) stand above him in Daoist theology — but he is the administrator, the sovereign, the one who runs the universe day to day. His court mirrors the imperial bureaucracy of China so precisely that scholars have never fully disentangled which modeled which: departments of thunder, rain, wind, water, earth, and the underworld all report to him through a chain of celestial ministers. He holds court, reviews petitions, promotes and demotes gods. The Kitchen God reports to him annually on each family's behavior. The City Gods report local affairs. Mount Tai's own deity, Tai Sui, serves as one of his officers. In the Journey to the West, the Jade Emperor is the one who assigns Sun Wukong the absurd title of 'Keeper of the Heavenly Horses' — a bureaucratic insult that triggers the Monkey King's rebellion against heaven itself. His birthday, the ninth day of the first lunar month, is one of the most important Daoist festivals, marked with elaborate offerings and the burning of joss paper. In folk religion he is the god ordinary people pray to — the one who listens when you burn incense at the family altar. His consort is the Heavenly Queen Mother, not to be confused with Xiwangmu, though popular tradition has merged them. His jade symbolizes purity and incorruptibility. Mount Tai's role as the place where emperors performed the Feng and Shan sacrifices — reporting to Heaven and Earth — was in essence a report to him: the earthly emperor climbing the sacred peak to face the heavenly emperor above it.",
      "animals": ["Dragon (imperial symbol)"],
      "colors": ["Gold", "Imperial yellow", "Jade green"],
      "consorts": ["Heavenly Queen Mother (Tianhou)"]
    },
    {
      "id": "xiwangmu",
      "name": "Xiwangmu",
      "title": "Goddess of Immortality",
      "group": "celestial",
      "description": "The Queen Mother of the West is one of the oldest deities in the Chinese tradition — older than Daoism itself, appearing in oracle bone inscriptions from the Shang dynasty, over three thousand years ago. In her earliest form she was a wild, terrifying figure: tiger-toothed, leopard-tailed, dwelling in a cave on Kunlun Mountain, surrounded by plague and death. She was the goddess of catastrophe, of the western wilderness where the sun died every evening. Over centuries she transformed — or rather, the culture's relationship to her transformed — into the serene, radiant Queen Mother of Daoist immortality, enthroned in a jade palace on Kunlun, the axis mundi of Chinese cosmic geography. She tends the Peaches of Immortality, which ripen once every three thousand years in her garden, and she hosts the Pantao Hui — the Peach Banquet — to which all the gods and immortals are invited. In the Journey to the West, Sun Wukong's theft of these peaches is one of his greatest crimes. She possesses the elixir of immortality; in the myth of Hou Yi and Chang'e, it was Xiwangmu who gave the divine archer the elixir after he shot down nine of the ten suns, and it was Chang'e who drank it and floated to the moon. Her sacred mountain Kunlun is the western counterpart to Taishan in the east — together they anchor the Chinese sacred landscape, west and east, death and birth, immortality and mortality. She rules over female immortals as the Jade Emperor rules heaven. She has been a tiger spirit, a plague goddess, a mountain queen, and a transcendent mother — her evolution across millennia is itself a map of Chinese religion's arc from shamanic terror to cosmic order.",
      "animals": ["Tiger", "Phoenix", "Three-legged crow", "Nine-tailed fox"],
      "vegetation": ["Peaches of Immortality"],
      "colors": ["Gold", "Crimson", "White"],
      "consorts": ["Dong Wang Gong (King Father of the East, in some traditions)"]
    },
    {
      "id": "tai-sui",
      "name": "Tai Sui",
      "title": "God of Mount Tai",
      "group": "celestial",
      "description": "Dong Yue Da Di, the Great Emperor of the Eastern Peak, is the deity of Mount Tai itself and one of the most functionally important gods in the Chinese religious system. While the Jade Emperor rules heaven in the abstract, Tai Sui administers the concrete machinery of fate: births, deaths, fortune, disaster, and the bureaucratic processing of souls. Mount Tai has been the mountain where the dead go since at least the Han dynasty — the belief that souls travel to Taishan after death is one of the oldest continuous religious ideas in China. At the mountain's base lies Fengdu, the ghost city, and within the mountain's spiritual jurisdiction the ten courts of the underworld operate, judging the dead and assigning them to rebirth. Tai Sui oversees seventy-five departments staffed by lesser deities managing everything from lifespan records to the distribution of epidemics. Emperors came to Taishan not to worship the mountain in a vague sense but to report to this specific bureaucracy: the Feng sacrifice at the summit addressed Heaven, and the Shan sacrifice at the base addressed Earth, together completing the circuit of cosmic governance. The Tai Sui temples (Dong Yue Miao) across China — the largest is in Beijing — are structured like government offices, with halls for each department, where worshippers submit petitions to specific bureaus for specific needs: longevity, children, justice for the wrongly dead. The Chinese phrase 'tai sui tou shang dong tu' — 'to disturb the earth above Tai Sui's head' — means to provoke a power you cannot afford to anger. He is not a god of love or beauty. He is the god of how things actually work: the cosmic civil service, the paperwork of fate, the mountain that processes every soul.",
      "colors": ["Black", "Dark green", "Gold"],
      "animals": ["Ox"]
    },
    {
      "id": "zhongli-quan",
      "name": "Zhongli Quan",
      "title": "Chief of the Eight Immortals",
      "group": "celestial",
      "description": "The eldest and leader of the Eight Immortals (Ba Xian), the most beloved group of figures in Chinese folk religion — eight humans who achieved immortality through Daoist cultivation and now wander the world, each carrying a magical instrument, each representing a different condition of life. Zhongli Quan was, in legend, a Han dynasty general who lost a crucial battle and fled into the mountains, where he met a Daoist sage who taught him the secrets of alchemy and the Dao. He mastered the transmutation of metals, learned to produce the elixir of immortality, and ascended to become an immortal. He is depicted as a large, bare-bellied man fanning himself with a palm-leaf fan — the fan that can revive the dead, a tool of resurrection carried with the casual ease of someone cooling himself on a hot afternoon. His belly is exposed not from carelessness but from abundance: he is the image of a man who has eaten enough, rested enough, and released enough worry to stand in the world with nothing to hide. The Eight Immortals together span all of society: young and old, male and female, rich and poor, noble and common, able-bodied and disabled. Zhongli Quan represents the military man who found peace, the alchemist who stopped seeking gold once he found the Dao. The Eight Immortals are said to have crossed the sea together, each using their own magical instrument as a vessel — 'the Eight Immortals crossing the sea, each showing their divine power' (ba xian guo hai, ge xian shen tong) is a proverb meaning everyone contributes their own talent. They are associated with Mount Penglai, the mythical eastern island of immortality, and with Taishan as a gateway between the mortal and immortal worlds. Zhongli Quan is the one who leads them — not with authority, but with the quiet confidence of someone who has already died to the world and found it still worth visiting.",
      "weapons": ["Palm-leaf fan (can revive the dead and create fire)"],
      "colors": ["Red", "Gold"],
      "animals": ["Crane"]
    },
    {
      "id": "guanyin",
      "name": "Guanyin",
      "title": "Bodhisattva of Compassion",
      "group": "earthly",
      "description": "She who hears the cries of the world. Guanyin is the Chinese transformation of Avalokiteshvara, the bodhisattva of compassion who originated in Indian Mahayana Buddhism as a male figure and, upon arriving in China, gradually became female — one of the most remarkable gender transformations in the history of religion. The shift was not arbitrary: Chinese culture needed a maternal divine figure, and Guanyin filled that space so completely that she became, for many ordinary Chinese people, the deity they actually pray to — more than the Buddha, more than the Jade Emperor, more than any Daoist immortal. She is the one who answers. In the Lotus Sutra, Avalokiteshvara vows to appear in whatever form a suffering being needs — man, woman, child, monk, king, dragon, ghost — and this doctrinal flexibility gave the Chinese imagination permission to reshape the bodhisattva entirely. She is depicted in flowing white robes, holding a willow branch (to sprinkle the nectar of compassion) and a vase of pure water (to cleanse suffering). In the Journey to the West, she is the one who orchestrates the entire pilgrimage: she selects Tang Sanzang as the pilgrim, she assigns Sun Wukong as his protector, she provides the golden headband that keeps the Monkey King in check. She intervenes at critical moments, not with force but with guidance. She is the narrative's actual architect. Her most famous origin story in Chinese tradition is the legend of Princess Miaoshan, a king's daughter who refused to marry and endured torture, execution, and a journey through hell, emerging as Guanyin after sacrificing her own eyes and arms to cure her cruel father's illness. Her temple on Mount Putuo, an island off the Zhejiang coast, is one of China's Four Sacred Buddhist Mountains. At Taishan, Guanyin's presence is woven into the temple complexes that line the climbing route — Buddhist and Daoist shrines standing side by side, because in Chinese religious practice, the boundaries between traditions matter less than the prayer being answered.",
      "animals": ["Dragon", "Parrot", "Fish (carp, symbolizing her saving souls from the sea of suffering)"],
      "vegetation": ["Willow branch", "Lotus"],
      "colors": ["White", "Gold"]
    },
    {
      "id": "sun-wukong",
      "name": "Sun Wukong",
      "title": "The Monkey King",
      "group": "earthly",
      "description": "Born from a stone egg on the Mountain of Flowers and Fruit, nourished by the elements, animated by wind and sunlight — Sun Wukong emerged already outside every category. He is not human, not god, not demon, not animal, and this is precisely the source of his power and his problem. He taught himself to be king of the monkeys. He crossed the ocean to learn immortality from the Patriarch Subhuti. He mastered the seventy-two transformations, learned to ride clouds, and acquired his signature weapon: the Ruyi Jingu Bang, a pillar of iron that once held down the seabed in the Dragon King's palace, which can shrink to the size of a needle and grow to fill the sky. He erased his name from the Book of Life and Death in the underworld. He ate the Peaches of Immortality from Xiwangmu's garden. He swallowed Laozi's elixir pills. He defeated one hundred thousand heavenly soldiers. He declared himself 'Great Sage Equal to Heaven' — Qi Tian Da Sheng — and meant it. And then the Buddha dropped a mountain on him and held him there for five hundred years. This is the setup. The actual story begins when the bodhisattva Guanyin recruits him to protect the monk Tang Sanzang on his pilgrimage to India to retrieve the Buddhist sutras — the Journey to the West, one of the four great classical novels of Chinese literature. The journey is his transformation: from rebel to guardian, from ego to service, from someone who could defeat anyone to someone learning that defeating is not the point. The golden headband Guanyin places on him tightens when Tang Sanzang chants a sutra — discipline applied from outside until it becomes discipline within. Sun Wukong is the trickster who becomes the saint. He is worshipped in Chinese folk religion as a protector, a figure of irreverent hope, the proof that even the most uncontrollable force in the cosmos can choose to walk beside someone weaker and carry them to safety. At Taishan, where the underworld processes souls, Sun Wukong is the one who once walked in and crossed out his own name — the ultimate act of defiance against the mountain's bureaucratic machinery.",
      "animals": ["Monkey"],
      "weapons": ["Ruyi Jingu Bang (golden-banded compliant staff)", "Golden chain mail shirt", "Phoenix-feather cap", "Cloud-walking boots"],
      "colors": ["Gold", "Red"]
    },
    {
      "id": "mazu",
      "name": "Mazu",
      "title": "Goddess of the Sea",
      "group": "earthly",
      "description": "Lin Mo, born in 960 CE on Meizhou Island off the coast of Fujian province, did not cry when she was born. The silence was so unusual that her parents named her Mo — 'silent.' She was a real person, or at least the tradition insists she was, with a birthdate and a hometown and a family of fishermen. As a girl she showed extraordinary spiritual gifts: she could meditate in trance, project her spirit across distances, and sense storms before they arrived. The defining story came when she was sixteen: her father and brothers were caught in a typhoon at sea, and she fell into a trance to rescue them, her spirit flying across the water to pull their boats to safety. Her mother, seeing her unconscious body, shook her awake — and the trance broke before she could save her father, who drowned. She died young, at twenty-seven or twenty-eight, and was immediately venerated as a goddess by the fishing communities of Fujian. From there her worship spread with the Chinese diaspora everywhere the sea mattered: Taiwan, Macau (named for her: A-Ma-Gao, Bay of A-Ma), Southeast Asia, Japan. She is Tianhou — Empress of Heaven — in her fully elevated form, a rank granted by successive imperial dynasties who found her useful for blessing naval expeditions and trade routes. She has been promoted through the celestial bureaucracy over a thousand years, from local spirit to imperial goddess — her career trajectory mirrors the dynastic merit system itself. Her temples are the most numerous of any single deity in southern China and the Chinese diaspora, often built at harbors and coastlines, their incense visible from the water. Mazu is not connected to Mount Tai directly, but she connects to its system: as Tai Sui governs the passage of souls through death, Mazu governs the passage of bodies through danger. She is the prayer before departure, the light that guides the boat home.",
      "animals": ["Sea turtle", "Red-crowned crane"],
      "colors": ["Red", "Sea blue", "Gold"]
    },
    {
      "id": "zao-jun",
      "name": "Zao Jun",
      "title": "The Kitchen God",
      "group": "earthly",
      "description": "Every Chinese household has a god, and he lives above the stove. Zao Jun, the Kitchen God, is the divine surveillance operative of Chinese folk religion — the lowest-ranking official in the Celestial Court's bureaucracy, stationed in the most intimate room of the house, watching everything the family does for an entire year. On the twenty-third or twenty-fourth day of the twelfth lunar month, one week before Chinese New Year, his paper image is taken down from the wall above the stove and ceremonially burned, sending him up to heaven to deliver his annual report to the Jade Emperor. The family smears his lips with honey or maltose candy before burning — to sweeten his words, to make him say only good things, or, in the more cynical folk interpretation, to glue his mouth shut so he cannot report their sins at all. A new image is posted on New Year's Day, and the cycle begins again. His origin story varies: in one popular version, he was a man named Zhang who abandoned his virtuous wife for another woman, squandered everything, went blind, and was reduced to begging. One day he stumbled into a kitchen where a woman fed him — his first wife, whom he did not recognize. When she told him who she was, he was so ashamed that he threw himself into the cooking fire and died. The Jade Emperor, moved by his suffering and his wife's loyalty, appointed him god of the kitchen — eternal witness to domestic life, redeemed through the scene of his destruction. He is the most humble god in the pantheon and the one closest to daily life. His connection to Mount Tai is structural: Tai Sui runs the cosmic bureaucracy, and Zao Jun is its most local field agent, the divine clerk in every home feeding information upward through the chain of celestial command.",
      "colors": ["Red", "Yellow"],
      "animals": ["Cricket (associated with the hearth)"]
    },
    {
      "id": "guan-yu",
      "name": "Guan Yu",
      "title": "God of War and Righteousness",
      "group": "earthly",
      "description": "He was a real man. Born around 160 CE in Hedong, in what is now Shanxi province, Guan Yu was a general who served the warlord Liu Bei during the collapse of the Han dynasty — the period immortalized in the Romance of the Three Kingdoms, one of China's four great classical novels. He swore a blood oath with Liu Bei and Zhang Fei in a peach garden: though they were not born on the same day, they vowed to die on the same day. He wielded the Green Dragon Crescent Blade, a guandao so heavy that legend says it weighed eighty-two jin. He was captured by the rival warlord Cao Cao, who showered him with gifts, titles, and a war horse named Red Hare — the finest horse in China — trying to buy his loyalty. Guan Yu accepted the horse (because it could carry him back to Liu Bei faster), defeated Cao Cao's enemies as a gesture of repayment, and then left, riding through five passes and killing six generals who tried to stop him, to rejoin his sworn brother. This is the act that made him immortal in Chinese memory: loyalty that cannot be purchased. He was eventually captured and beheaded in 220 CE. And then his afterlife began. Century by century, dynasty by dynasty, he was promoted: from local spirit to duke, from duke to prince, from prince to king, from king to emperor, and finally to the divine title Guan Di — Emperor Guan, God of War. But not war as aggression — war as righteousness, as the willingness to fight and die for what is right. He is worshipped by soldiers, police officers, martial artists, and — seemingly paradoxically — by businessmen and triads alike, because what all of them need is the same thing: someone who keeps their word. His temples are everywhere, his red face and long black beard are among the most recognized images in Chinese culture, and his statue stands in restaurants, shops, and police stations across Asia. At Mount Tai, where souls are judged, Guan Yu represents the standard of judgment itself: not cleverness, not power, but righteousness — yi — the virtue that holds when everything else fails.",
      "animals": ["Red Hare (his legendary horse)"],
      "weapons": ["Green Dragon Crescent Blade (guandao)", "Red Hare (horse)"],
      "colors": ["Red (his face)", "Green (his robe)"],
      "vegetation": ["Peach blossoms (the oath in the peach garden)"]
    }
  ]
}