{
  "id": "elamite",
  "name": "The Gods of Susa",
  "description": "Elam is the civilization that ancient Near Eastern studies keeps forgetting to mention. For three thousand years it occupied the highlands and lowlands of southwestern Iran -- Susa, Anshan, the valleys beyond the Zagros -- and it fought Mesopotamia to a standstill more than once. Shutruk-Nahhunte sacked Babylon and carried off the Code of Hammurabi. Untash-Napirisha built Chogha Zanbil, the best-preserved ziggurat on earth. The Elamites wrote in a language related to nothing else we know. They had their own script, their own legal institutions, their own gods. When scholars speak of 'the ancient Near East,' they usually mean Sumer, Babylon, Assyria, and sometimes the Hittites. Elam is the missing fourth -- the civilization next door that had its own answers to every question Mesopotamia was asking. Its pantheon reflects this independence: gods of oath and judgment, of the rainbow and the sun, organized not around a single city-temple but across a network of sacred precincts stretching from Susa to the Persian highlands. The central religious institution was the kiten -- the oath, the treaty, the sacred bond enforced by divine witnesses. Elam reminds us that the ancient world was never a single story.",
  "deities": [
    {
      "id": "inshushinak",
      "name": "Inshushinak",
      "title": "Lord of Susa, Judge of the Dead",
      "group": "supreme",
      "description": "Inshushinak is the god who owns Susa. His name says it plainly -- 'Lord of Susa' in Sumerian -- and for as long as the city stood, he stood over it. He was the tutelary deity of the Elamite lowlands, the divine patron under whose authority oaths were sworn, treaties sealed, and the dead were judged. His earliest attestation comes from the treaty between the Akkadian king Naram-Sin and an Elamite ruler of Awan, around 2250 BCE, where he appears among the divine witnesses. By the Middle Elamite period, Untash-Napirisha had raised a ziggurat to him at Chogha Zanbil -- the best-preserved ziggurat in the world, still standing to this day in Khuzestan province. At the heart of Inshushinak's cult was the kiten: the sacred oath, the inviolable bond. Parties to legal agreements committed themselves by touching his kitin -- his protective essence -- and those who broke faith forfeited that protection. He was judge of the living and the dead. In the afterlife, Inshushinak presided over the judgment of souls, attended by Lagamal as prosecutor and Ishnikarab as defender. A well-established scholarly theory connects this Elamite tribunal -- Inshushinak, Lagamal, Ishnikarab -- with the later Zoroastrian judgment by Mithra, Sraosha, and Rashnu. If the connection holds, it means the Elamite dead were being weighed in a divine courtroom a thousand years before Zoroaster. Psychologically, Inshushinak embodies the principle that justice is not abstract -- it is local, embodied, tied to a place and its sacred institutions."
    },
    {
      "id": "napirisha",
      "name": "Napirisha",
      "title": "The Great God, King of the Gods",
      "group": "supreme",
      "description": "Napirisha is the supreme god of the Elamite highlands -- the deity of Anshan, the eastern heartland. His name is transparently Elamite: napir ('god') plus risha ('great'). He is, literally, 'The Great God.' In the older texts he appears as Humban, the sky god, and modern scholarship has established that Napirisha is an epithet that eventually replaced the original name entirely. This is itself revealing: the Elamites did not simply inherit their pantheon -- they reshaped it over time, and the highland god of the sky became the national sovereign of the gods. From the Middle Elamite period onward, Napirisha stands at the head of the great triad -- Napirisha, Kiririsha, and Inshushinak -- and he is always named first. This ordering reflects a political reality: the primacy of Anshan over Susa in royal ideology. Untash-Napirisha ('Untash whom Napirisha loves') built temples to him at Chogha Zanbil, where his sanctuary stood at the foot of the ziggurat alongside those of Kiririsha and Ishnikarab. His consort was Kiririsha, the 'Great Goddess,' and his son was Hutran of Awan. For anyone studying comparative religion, Napirisha demonstrates something important: supreme gods are not universal archetypes that drop from the sky. They emerge from specific landscapes, specific political arrangements, specific moments when one city's patron absorbs the authority of another."
    },
    {
      "id": "kiririsha",
      "name": "Kiririsha",
      "title": "The Great Goddess, Mother of the Gods",
      "group": "supreme",
      "description": "Kiririsha is the great goddess of Elam -- her name means exactly that in Elamite. She originated in the coastal city of Liyan (modern Bushehr, on the Persian Gulf) and rose to national prominence during the reforms of Untash-Napirisha around 1250 BCE, when she was installed as consort of Napirisha in the state triad alongside Inshushinak. Her temple at Chogha Zanbil stood north of the central ziggurat, adjacent to Ishnikarab's sanctuary. Earlier scholarship conflated Kiririsha with Pinikir, proposing that the Elamites used 'taboo names' to disguise divine identities. This theory has been thoroughly discredited by Henkelman, Vallat, and others. Kiririsha and Pinikir originated in different regions (Liyan and Awan respectively), were worshipped separately at Chogha Zanbil, and both appear in a single bronze relief inscription from Susa -- which would make no sense if they were the same deity. Kiririsha was compared in ancient sources not to Ishtar but to Ninhursag, the Sumerian mother goddess. She was 'mother of the gods,' a title reflecting fertility, sovereignty, and the generative power of the land itself. Her journey from a Gulf Coast local deity to the supreme goddess of a highland empire is one of the great untold stories of ancient religion -- a trajectory that mirrors and inverts the better-known movements of Mesopotamian goddesses."
    },
    {
      "id": "humban",
      "name": "Humban",
      "title": "God of the Sky",
      "group": "supreme",
      "description": "Humban is the old name -- the original name -- of the Elamite sky god. In the earliest texts, before Napirisha absorbed his identity, Humban stood as the supreme deity of the Awan region, comparable to the Sumerian An or the Akkadian Anu. His name appears in the Naram-Sin treaty (c. 2250 BCE) as the second deity invoked after Pinikir, and he persisted as a distinct divine name even after Napirisha became dominant. This persistence matters. In Henkelman's analysis of the Persepolis Fortification texts -- administrative records from the Achaemenid period, over a thousand years later -- Humban still receives offerings under his own name. The tradition survived the fall of Elam itself. Henkelman's monograph The Other Gods Who Are (2008) treats the role of Humban extensively, tracing the Elamite-Iranian acculturation through which Elamite religious practices were absorbed into early Persian culture. The 'paradise' -- the royal walled garden that became a Persian institution and eventually entered Greek and then English as 'paradise' -- has older Elamite roots that Henkelman connects to Humban's cult. Whether one god with two names or two aspects that history collapsed into one, Humban represents the deep layer of Elamite religion: the stratum that was already ancient when the Middle Elamite kings began their great building programs."
    },
    {
      "id": "pinikir",
      "name": "Pinikir",
      "title": "Mistress of Heaven",
      "group": "astral",
      "description": "Pinikir is the oldest goddess we can name in the Elamite record. She appears first in the treaty between Naram-Sin of Akkad and an Elamite king of Awan, around 2250 BCE, where she leads the list of thirty-seven divine witnesses -- the first deity named. Her title was kikki galirra, 'Mistress of Heaven,' and she was an astral goddess, possibly representing the planet Venus, associated with love and sexuality in the Elamite context. She originated in Awan, the first major Elamite political center, and her primacy in the treaty list likely reflects the fact that Awan's king was the Elamite signatory. At Chogha Zanbil, her temple was positioned to the right of the royal entrance -- a place of honor. She is compared in both ancient and modern scholarship to Ishtar and Ninsianna, the Mesopotamian Venus-goddess, but the comparison only goes so far. Pinikir had her own trajectory: she spread beyond Elam into Hurrian religion, where she was worshipped as Pirinkir, and from there into Hittite Anatolia. Her journey is almost the inverse of the Mesopotamian cultural exports scholars usually track. She moved north and west, not south and east. For anyone mapping how divine figures travel between civilizations, Pinikir is an essential and underappreciated case study."
    },
    {
      "id": "nahhunte",
      "name": "Nahhunte",
      "title": "The Sun God, Lord of Justice",
      "group": "astral",
      "description": "Nahhunte was the Elamite sun god, worshipped primarily in the lowlands around Susa. In Elamite curse formulae, his name functioned as a metonym for the sun itself -- to invoke Nahhunte was to invoke the daylight, the power that sees all and permits no concealment. This is the same logic that connects sun gods to justice across the ancient Near East: Shamash in Mesopotamia, Ra in Egypt. The one who sees everything becomes the one who judges everything. Nahhunte's name appears in the theophoric names of several Elamite kings -- Shutruk-Nahhunte, Kutir-Nahhunte -- kings who were among the most powerful rulers in Elamite history. Shutruk-Nahhunte sacked Babylon around 1158 BCE and carried off some of the most famous objects in Mesopotamian civilization, including the stele bearing the Code of Hammurabi (which is how it ended up in Susa, where French archaeologists found it in 1901). The sun god's name was written into the identity of the king who humbled Babylon. Nahhunte received a temple at Chogha Zanbil and remained a significant deity throughout the Elamite period. He represents the solar theology that runs through nearly every ancient civilization -- but in an Elamite key, independent of Mesopotamian Shamash, answering the same question about cosmic justice from a different cultural starting point."
    },
    {
      "id": "simut",
      "name": "Simut",
      "title": "Herald of the Gods",
      "group": "astral",
      "description": "Simut was the Elamite herald of the gods, associated with the planet Mars and often paired with the goddess Manzat. He appears in the Naram-Sin treaty, in the inscriptions of the Middle Elamite kings, and -- remarkably -- in the Persepolis Fortification Archive from the Achaemenid period, where offerings to Simut and Manzat are recorded in the district west and southwest of Persepolis. That span of attestation covers nearly two thousand years. In Mesopotamian god-lists, Simut was equated with Nergal, the war god and lord of the underworld, and his association with Mars reinforces the martial reading. But 'herald of the gods' is a more specific title: it suggests an intermediary role, a deity who moves between the divine assembly and the human world. At Chogha Zanbil, Simut's temple was located in the outer precinct, grouped with Shala and other deities. Earlier Elamite sources mention that Simut, along with Inshushinak, Shamash, and Upurkupak, 'owned' lands in Elam -- estates administered and rented by priests. This is a concrete institutional fact: the god held property. Whatever Simut meant theologically, he also meant revenue, administration, and the daily management of a religious economy. The herald of the gods was also a landlord."
    },
    {
      "id": "manzat",
      "name": "Manzat",
      "title": "Goddess of the Rainbow",
      "group": "astral",
      "description": "Manzat is the deified rainbow. Her name was borrowed into Akkadian as the common word for 'rainbow,' which tells you something about the direction of cultural influence -- the Elamite goddess became the Mesopotamian vocabulary. She originated as a Mesopotamian deity but was so thoroughly adopted into Elamite worship that she became a standard member of the Elamite pantheon, perpetually paired with Simut, the herald god. Scholarship generally treats them as a divine couple. Elamite king Igi-Halki restored an old kukunnu (high temple) of Manzat at Deh-e Now, and Untash-Napirisha built her a temple at Chogha Zanbil, where she was honored as 'Lady of the Siyan Kuk' -- lady of the sacred precinct. The Persepolis Fortification texts record offerings to Manzat and Simut in eight locations in one district alone, suggesting a thriving cult well into the Achaemenid period. And then -- silence. No attestations of Manzat from Elam survive after about 1050 BCE. She either vanished from worship or continued under a name we cannot yet identify. The rainbow goddess who gave her name to a Mesopotamian word simply disappears from the record. For students of how gods die -- or how they change their names and survive -- Manzat is a haunting case."
    },
    {
      "id": "shala",
      "name": "Shala",
      "title": "Goddess of Grain and Storm",
      "group": "astral",
      "description": "Shala was a goddess of grain and weather, the consort of the storm god Adad, and she represents a specific kind of theological import: a Mesopotamian deity worshipped in Elam under her original Mesopotamian name. The Elamites did not rename her. They did not assimilate her into an existing Elamite goddess. Adad and Shala received a joint temple at Chogha Zanbil, referred to with the Elamite term silin -- a word variously translated as 'rainwater,' 'abundance,' 'prosperity,' or 'growth.' The temple was dedicated to Adad, the god of rain and thunder, and Shala, his spouse. She is always attested alongside him; her character was defined by that partnership. Mesopotamian texts call her his 'great wife' and 'beloved wife who gladdens the heart.' Her name may be Hurrian in origin, suggesting she traveled south from northern Mesopotamia before traveling east into Elam. Shala matters for what she tells us about Elamite religious practice: this was not a hermetically sealed system. The Elamites borrowed gods when those gods served a purpose -- when the grain needed rain and the rain needed a theology. They simply placed the foreign temple alongside their own, in the same sacred precinct, without apology or synthesis."
    },
    {
      "id": "lagamal",
      "name": "Lagamal",
      "title": "The Merciless, Prosecutor of the Dead",
      "group": "underworld",
      "description": "Lagamal's name means 'no mercy' in Akkadian, and his role matched his name. He was the prosecutor in the Elamite judgment of the dead -- the advocatus diaboli who stood opposite Ishnikarab, the defender, before the tribunal of Inshushinak. This triadic judgment structure -- judge, prosecutor, defender -- is one of the most sophisticated afterlife theologies in the ancient Near East, and it was Elamite, not Mesopotamian. Henkelman and Krebernik both accept the interpretation that Lagamal served as accuser in this underworld court. The logic is embedded in the names themselves: Lagamal, 'who has no mercy,' prosecutes; Ishnikarab, 'who hears the prayer,' defends. In Mesopotamian contexts, Lagamal was associated with Nergal and classified as an underworld deity. A variant of his name, Lagamil ('merciless'), appears in an incantation from Der, the border city between Mesopotamia and Elam. He was a liminal figure -- a god who belonged to the boundary zone between civilizations and between life and death. The scholarly connection between the Elamite judgment triad and the later Zoroastrian judgment by Mithra, Sraosha, and Rashnu runs directly through Lagamal. If the link holds, the merciless prosecutor of Susa became, in transformed guise, part of the theology that shaped Persian and eventually world religion."
    },
    {
      "id": "ishnikarab",
      "name": "Ishnikarab",
      "title": "Who Hears the Prayer, Defender of the Dead",
      "group": "underworld",
      "description": "Ishnikarab -- also written Ishmekarab in Akkadian -- was the close associate of Inshushinak and the defender of souls in the Elamite judgment of the dead. The name translates as 'who hears the prayer,' and in the underworld tribunal the role was precisely that: to hear the plea of the deceased and advocate on their behalf before Inshushinak, while Lagamal pressed the case for condemnation. At Chogha Zanbil, Ishnikarab's temple stood at the foot of the ziggurat alongside those of Napirisha and Kiririsha -- placement that signals top-tier divine status. North of the ziggurat, the temple was adjacent to Kiririsha's sanctuary within an oval enclosure wall. Florence Malbran-Labat considers Ishnikarab a goddess and possibly the spouse of Inshushinak, though other scholars note that the deity's gender remains genuinely uncertain -- a reminder that our categories do not always map onto ancient ones. What is not in doubt is the function: Ishnikarab was the one who listened. In a religious system organized around the kiten -- the sacred oath -- having a divine advocate who would hear your prayer at the moment of ultimate judgment was not a minor theological detail. It was the promise that even before the merciless prosecutor and the implacable judge, someone in the divine court was structurally obligated to listen."
    },
    {
      "id": "hutran",
      "name": "Hutran",
      "title": "The Overwhelmer, Divine Warrior of Awan",
      "group": "underworld",
      "description": "Hutran was the warrior god of Awan, and his name means 'overwhelmer' -- a title that leaves little ambiguity about his function. He was most likely a god of war and soldiers, the divine force invoked when Elamite armies marched. In the theological framework of the later Middle Elamite period, an inscription of Shilhak-Inshushinak identifies Hutran as the son of Napirisha and Kiririsha, placing the warrior of Awan into the supreme family of Anshan. Scholars view this as a later ideological construction rather than original mythology -- a political theology that unified regional gods under a single dynastic genealogy. This is how pantheons consolidate: the local warrior becomes the son of the national king and queen of the gods. Hutran's origin in Awan is significant because Awan was the earliest major Elamite political center, the dynasty that signed the Naram-Sin treaty. To be 'of Awan' was to carry the weight of the oldest Elamite institutions. As the divine son who was also a warrior and an overwhelmer, Hutran embodies the Elamite capacity for organized violence that kept Mesopotamia wary for millennia -- the military theology of a civilization that fought Akkad, Ur, Babylon, and Assyria and was never permanently conquered until the Achaemenid Persians absorbed it from within."
    }
  ]
}
