{
  "titles": {
    "golden-age": "Chapter 1 – The Golden Surface",
    "falling-star": "Chapter 2 – Calling Star",
    "impact-crater": "Chapter 3 – Crater Crossing",
    "forge": "Chapter 4 – Belly of the Furnace",
    "quenching": "Chapter 5 – Elixir at the Nadir",
    "integration": "Chapter 6 – Return Reflection",
    "drawing": "Chapter 7 – Arrive Assembled",
    "new-age": "Chapter 8 – Life in the Dirt"
  },
  "chapters": {
    "golden-age": "Sand covers the floor of a lifeless studio. Organ pipes line the walls. Echo, a bit old for a dancer, waits in the center. \nPatterns of vibrating particles take form before her eyes. The spotlight strikes. She squints through budding wrinkles. Her eyes track the moving floor. Pipes erupt with flame. She holds. Her eyes lift, ready. \nThe draw of a bow pulls her into motion. She moves with fluid elegance, like the sand and flame. A bell tolls. She drops in. This is her space. This is her bliss. Overflowing with life, her timeless movements are one with the dancing elements. \nA half-silvered mirror catches her eye: a bell grips her heart and pulls her to her knees. Aquariums shatter. Water soaks the sand.\nShaken, she looks up at the mirror: nothing, no one—only herself. The strap of her shirt has fallen over her shoulder. She feels exposed. Unsafety floods her senses. She hides the adrenaline and defends herself with poise. Placing a hand on her chest, she settles, then stands. \nEcho yells, inaudibly, “It’s too loud.”\nNothing. Concerned, uncertain, pissed—she exhales. The space she was in is inaccessible. She dances anyway. \nThe beat hardens. She dances harder to meet it. It gets louder, harder. She re-finds the pocket. Defiant, triumphant, she dances. Wet sand takes form, into dancing bodies, lifting with the music, and taking shape with her. \nThe bell tolls again: her heart bursts. She falls, eyes gasping. \nThe room quiets. She lies loose. Darkness.\nThe room strobes, her body convulses—like a puppet.\n\nSix Hours Earlier, at her tower house—a small yellow flower grows from a crack in the curb at the apex of a cul-de-sac. A black caterpillar chews dead grass at the base of a (rusting) golden mailbox. Jaq, twenty-eight, bright, soft, kind, spills from the tower-topped right-hemisphere of her yellow duplex. \nShe opens the mail. It spills to the ground. She pans for gold: Water Bill, Jury Bill, Trash, Rental Insurance … Alma Pater University. She rushes inside. \nJaq enters the duplex. She sets the mail beside a picture of her and Echo in a field of narcissus (daffodils). Jaq wears gold and has golden hair. Echo is darker, raven hair and carbon clothes. \nJaq closes the door to her bedroom, sits down on the bed. Her room is immaculate besides corners of paper and clothes bursting from her drawers and closet. \nShe stares at the golden envelope for a moment, starts to open it, gets nervous, jumps under her covers, pulls up her hood, stares at it again, then, to avoid making a rip, pulls at the tab. It rips. She pulls. \nTears gather like dew before sunrise. A smile blossoms. She turns the page. Her joy wilts. \nEcho opens the door and leans in, “I booked something!” she says. \nJaq tries to compose herself with a sniffle. “That’s great. What is it?”\nEcho enters the room. “I think it’s some kind of music video.” She notices the crying. “What’s up with you? You doing ok?”\n“Couldn’t be happier.”\nEcho sits next to her on the bed, looks at Jaq, sees its bad, gets under the covers. “Are you sure?”\n“Yeah” She breaks into a cry. “I got into school.”\n“The wizard school!?”\nJaq nods. \n“You must be so excited! What’s wrong? Isn’t it what you always wanted?”\nJaq hands her the papers. Echo looks over them. She sighs — in pain with her sister. “Love you.” Jaq sobs. \n“Why does it have to be so expensive? There’s something wrong with our world. You shouldn’t have to feed a broken system just to learn. Maybe this, maybe this just wasn’t the way.”  \nDefeated, “Apparently it wasn’t.”\n“Can’t you just go out into the world and learn what you want? I don’t understand—what is it about mythology?”\n“Myths are spells! We’re all under a thousand spells. Myths are lies, and I want out. I don’t want to be under any spells anymore, but I don’t even know what they are.”\n“I thought you wanted to be a storyteller?”\nJaq winces. \n“Sis, this letter is a gift. It’s saving you from years of distraction.”\nJaq takes a deep breath and sighs. \n“I’m not ready.”\n“How do you know? \n“I know because my dreams are still better than anything I could ever write, and every time I try, an inner voice just starts laughing at me, like all I’ll ever write is a dream within a dream I can’t even understand.”\n“Sis, (laughs), you are so intense. What if writing is your way out?”\n“I need training! I need mentors. There are lineages.”\nEcho prepares to agree before Jaq takes a swipe. “Besides, you just think I’m in a hurry, because you are a thirty-something-year-old dancer.” \nEcho recoils as though stabbed. Jaq squints with regret. Echo stands from the bed and turns to Jaq.\n“Look, I know you are hurting, and I know you feel insecure about yourself and that you take swipes at people when you want to push them out of your business, but it’s mean, Jaq, it’s the worst, and it hurts the people who love you most.”\n“Sis…”\nThe door slams. Jaq curls into an anxious hole in her stomach. \n\nA little later, the phone rings. Jaq lifts it to her ear, teary. It’s Anteros. “Hi! How are you?” \n“Can you meet me at our spot?”\n“What happened? I’ll be right there.”\n“Thank you.” \nShe hangs up. \n\nShe drives across town. Cars cross this way and that through endless freeways. \n\nAnteros finds her with artificial blossoms, on artificial turf, under an artificial tree, in dry tears. He sits down next to her, sees the letters, picks them up, sighs, puts his arm around her, kisses her head, thinks. A moment passes. \n“I have an idea.”\n“What?” She asks\n“Why don’t we go on a mythic adventure? I can work from anywhere. They pay me a ton. Let’s see the world. You can teach me stuff.”\nShe cries. \n“I can’t.”\n“Why not?”\nShe sobs. \n“Because I don’t love you.”\nAnteros smiles and laughs it off with experience. “Oh yeah?”\n“You’re amazing and everything I am supposed to want, I just, it’s all chemistry and synapses that put me under a spell. I don’t believe in love. It’s all just sex and trauma bonding and dumb bodies telling our weak brains what to think with their stupid feelings.”\nHe holds her tighter. Her body loves him. \nHe’s amused. “You really don’t believe in love?”\n“How could anybody? We are just dead matter under the illusion of consciousness. Nothing is anything but a bunch of stuff bouncing off stuff making bodies, and our bodies just want to mate, and eat.”\n“Jaq…”\n“I don’t want to mate and eat! I want to know. And when I’m in your spell, I don’t think I can know anything. I get lost. I get scared.”\n“Jacqueline, if there is a spell, it’s spun from your enchantments. If I traveled the world with you, I’d be in your web forever — learning mythology, maybe, sounds great, but losing myself.”\n“I’m sorry about the school. I love you, and I just want you to be happy. He hugs her. “And can I tell you something?”\nShe draws back to look in his eyes. \n“I think you love me too.”\nShe pushes him away. “NO! Tero! I am telling you: I do not believe in love, so I cannot be in love with you.”\nHe tries to smile. “Jaq, I think you are living proof that someone can love without believing.”\n“You are so naïve!” She smiles, “or such a good liar!”\n“What do you mean?”\n“How do you always say the right thing? The big, loving, caring thing? And then expect me to really believe you’re so pure. No one is that pure! Sometimes I wonder if any of it’s real at all!”\nHe’s heartbroken, sullen. “Do you really not see my care and my words as love?\nJaq winces at herself, then continues anyway. “Every belief is based on another belief is based on another belief, and I haven’t examined any of them.” She starts crying, fogged over with doubt. “I don’t know. I don’t know anything. How can I know. There is no knowing.” \nAnteros stands from the base of the tree, dejected, looks at her once, then walks away. \n\nJaq sits in the waiting room of a hospital. She looks at her black phone. It buzzes. She unlocks it and reads a text from Echo: I’m mad at you. A string of unanswered apologies ascend the screen. But you’re still my emergency contact. And the audition is at a home address. 66 Deadwood. I want you to have it. \nJaq starts to type a response when the nurse announces, “Jaqueline Stone, he can see you now.” \nJaq gets up to follow the nurse. I’ve got you, remains unsent. \n\nShe enters the the hospital room. Adam, a stern but sick man in his sixties who seems much older, motions for her to sit. She asks, “How are you?”\n“I am how I am.”\nJaq sits. \n“What’s on your mind, Jaq?”\n“Why am I so mean to my sister? I hate myself for it. I don’t know where it comes from.”\n“You treat her the way you treat the part of yourself just like her.”\n“And how do I treat the part of myself that’s like her?”\n“You know the answer to that question. You might not have before. I think you do now. I think you have begun to realize what you repress.”\n“You think I should be more like her? What, am I supposed to party all night and try every drug and kink and new toxic person?”\n“She’s chasing her dream, Jaq, every day, while you run from yours.”\n“The long road isn’t running away.”\n“You’re ready.”\n“I’m not ready.”\n“You’re ready, and you know how I know?”\nShe hangs on his answer. \n“Because you are triggered by the people around you trying to answer their own callings.”\n“Ok… What do you even think I’m ready for? I don’t understand. Why didn’t you write me a letter of recommendation? I know you knew they would give me no money. You could have said something!”\nHe sits back in his hospital bed. “You know I can’t do that. We are only allowed one relationship. We have had this conversation. You are a gifted poet. Go find your education. The world won’t give you anything.”\nShe takes it in. A nurse enters and sets down his breakfast: olives, dates, apples, white bread and quince jelly.\n“I told my boyfriend I don’t love him.” Adam exhales. “Am I crazy?”\n“Love serves the perpetuation and evolution of our species. We have selected for it. As a result, we have conditioned ourselves in countless ways to believe in love. You want to be a mythologist and a writer, you should know: myths are lies, and love is the ultimate myth. You only want to love, because your dream says you should—a dream reinforced by the body’s desire.”\n“Then you don’t believe in love?”\n“The question is not whether or not love is real, Jaq. The question is what love is.” He takes a bite of his stone fruit.\n“What is love?\nHe swallows. “Love is a complex. When we find a relationship in which we unconsciously recognize all our past relationships, and when this person represents the parts of ourselves we want to integrate, in the future, lust looses the arrow of Cupid.”\n“Oh.” A thousand connections pour through. \n“Your complex is patterned by your atheism, and by an imprint of the paternal love god you’ve killed. I don’t need to know more detail. I can see from a thousand miles away: you are drawn to men with paternal qualities in whom you see the god of love, who you then doubt, and this will destroy them, which will destroy you. This is your tragedy.” \nJaq starts to speak. He cuts her off. \n“The only way out, is to see through love. Detach from it. Be a free individual. Love will try to take you over, if you let it, but remember, it’s not real. Everything is separate. The difference about you, Jaq, is you question the spells.”",
    "falling-star": "Jaq wakes up… \nWashes her face in the bathroom mirror—and tightens a yellow robe. “Hey Sis, how was the audition?”\nShe asks the air, leaning into the hallway. “Sorry, I couldn’t hear you. Washing my face. What did you say?” \nNothing. Jaq remembers. She panics—draws out her phone. I’ve got you, remains unsent. No texts from her sister. Her hair raises. She runs for… \n\nEcho’s Room. The bed is empty, unmade, covered in unchosen clothing. \nShe texts her sister. It won’t send. She calls: Voicemail, “This is Echo. Leave a message.”\nNervous, “Hey, Sis, just checking in on you. Give me a call.” She sits on her sister’s bed.\nShe calls someone else. “Hey, have you heard from Echo?” She looks out the window. ”Oh, ok, no, no, just trying to get ahold of her, thanks.”\nShe makes another call, eyes fixed on a tidy closet. “Hey, is this Echo’s agent?”\n“Echo? Echo Stone? Of course! My darkest star. What’s the project?”\n“Actually, I’m her sister, Jaq, and she didn’t come home last night. She went to an audition…”\n“What audition?”\n“You didn’t send her to…” she looks at her text, “…66 Deadwood?”\n“I told her!”\n“Told her what? I don’t understand!”\n“Ask the police! My clients keep taking these calls, against my advice, and it’s the last I ever hear from them.”\nJaq shivers. \n“Don’t call me.”\n\nIn her bedroom, swallowed by covers, Jaq lays by her phone. “Hello, Officer, my sister is missing. She went to an audition last night, and I haven’t heard from her since. It was at a house. She gave me an address, but...”\n“What is your name?”\n“Jaqueline Stone”\n“Age”\n“28”\n“Marital status?”\nShe pauses, “Single”\n“Are you a gun owner?”\n“Excuse me, what does this have to do with my missing sister?”\n“Ma’am, it’s just part of the form.”\n“No! I am not a gun owner.”\nFive minutes later, the Officer finally asks, “Now, what was that address?”\n“66 Deadwood.”\n“Oh! 66 Deadwood. I’m sorry ma’am, we get this call. Your sister is not on the premises.”\n“What are you talking about?”\n“We have closed our investigation into this location.”\n“Investigation? What are you talking about?”\n“The place has been searched. It’s a school.”\n“Are there students there?”\n“Not anymore.”\n“Where are the students?”\n“Chasing their dreams. None of them come home.”\nJaq is deflated, unsure. “So you won’t send anyone?”\n“We’ve been there, miss. Everything is perfectly normal. If your sister didn’t say goodbye, consider it personal.”\nA falling star lights her face—the whole room. His phone clicks. The meteor thunders—into the ground outside her window. \n\nJaq opens the door to her front yard. Her drought-gold lawn has been turned over, as though plowed. A meteorite, the size of an arrowhead, glows from the center of a large crater. It cools. The starlight fades. She picks it up. Before she can look, she sees her mailbox, pure shrapnel, at her feet—a broken flag, a gold leaf letter. \nShe puts the meteor in her purse and picks up the envelope: It’s to her, from 66 Deadwood. On the back she finds one black spot. \nIn her room, on her phone. “I’m freaking out.”\n“We’ll find her. I’m sure it will all be ok.”\n“It’s not just that.”\n“What is it?”\n“You’re not going to believe me.”\n“What?”\n“You know the address she scent?”\n“66 Deadwood? It’s unforgettable.”\n“I got a letter—from 66 Deadwood.”\n“What?! What the fuck does it say?”\nJaq looks at the gold leaf letter. “It says it’s an invitation.”\n“To what?”\n“An initiation.”\n“In what?!”\n“Myth and story.” \n“Whaaaattttt is going on!? That is not real. This is some kind of devil shit. You need to call a priest.”\n“Nin! This is serious!”\n“Do you think your sister got this letter?”\n“I do.”\n“What else do you think?”\nShe looks at the shining page. “I think… it’s all I ever wanted. I think there’s no way it’s real. I think I need to find my sister.”\n“Shouldn’t the police send someone?”\n“They wont. I talked with them.”\n“What about Anteros?”\n“I can’t ask him.”\n“Why not?”\n“We had a fight yesterday.”\n“What did you do?”\n“I told him I don’t love him.”\n“You did not!”\n“I did.”\n“Why did you do that?”\n“I just, I don’t know. I doubt sometimes.”\n“Is it like a too-perfect kind of thing? I can never trust too perfect. It always feels like there’s something…hiding.”\n“That’s what I’m saying! But whatever. I have to go look for my sister.”\n“At the house?! Without Tero or the police? Are you crazy? Tell me you’re not curious!” \n“Of course not! I mean, maybe, a little, but I’m curious about everything.”\n“Jaq, you know I love you, but I don’t think this is a good idea.”\n“I know. But it’s my sister, and she’s missing.”\nNin gets serious. “Yeah. Do you want me to come with?”\n“No. Thank you. I want you to be on the phone. And if I’m gone for too long, I want you to get help.” \nJaq looks at her watch. It’s getting late. She looks at the envelope.",
    "impact-crater": "She drives, through tunnels of Autumn leaves—golden boughs, at the golden hour, in a golden dress. \n \nA mansion of brick, the soon-setting sun looks down on the world below. She arrives at dusk. Cars line the driveway. Jammed between statues of pebble: Cupid, satyrs, wolves and dragons find shade under petrified trees. She parks, puts in her earbuds, calls Nin and asks, “Are you there?”\n“I’m here…”\n“What do you see?”\n“A lot of people—a long line on a brick path. This place is a mansion.”\n“Like a haunted house?”\n“Nin!”\n“Sorry.”\nJaq takes a breath to settle herself. It doesn’t work. She leaves her car, looks at the house, begins her approach. “Stay on the phone, I’m gonna talk with someone.” \nShe taps on the nearest shoulder. “Excuse me, can you please tell me what you’re here for?”\n“I have been called to purify my warrior spirit. I am to become a great hero.” \nJaq nods and backs away, “Oh. Okayyy.”\nShe looks down at the brick path—a mosaic of golden camels. A bit further up the cue, she taps another shoulder. “Hello, can you tell me why you’re here?” \nA young man in fine clothes leans in to answer, “The secret to success, (according to my insiders) is in this house.” \n“Are you here to become a solider?”\n“Do I look like a pawn to you?! Or a sucker!? Success is success. You know what success is—to be rich and powerful.”\n“And the secret is in there?” She looks at the house, leery. \n“The secret of pure power and incorruptible will.”\nJaq backs away from the crazy. “Thank you.” She moves on. \nNin asks, “What the hell was that?!”\n“I don’t know man.” \nShadow hooks her eye—through a gate and around the house. She follows. “I’m going around the side.”\nShe opens the gate. \n\nIn the Mythouse Garden everything is wasting. The shell-stone fountain in the center is dry as a dead man’s navel—cracked. She sees a door to the house. \nIt’s unlocked. “I’m going in.”\n“Are you sure?”\n“Of course not.” She enters. \n\nThe Halls draw her fear and enchantment: red velvet curtains, black and white tile, paintings, sculptures, statuettes—modern styles and ancient aesthetics. “It’s pretty in here.” Nothing. “Are you there?” Nothing. “Shit.” She puts the earbuds in her purse. \nGlass cases, figurines—worldly, historical—Shadow darts by. She chases. \nIt disappears behind a shelf. She nears. She sees a small coffin—no larger than her hand. She looks closer. It’s shaped like a woman’s body—wings wrapped around her womb. Jaq turns the lid, like the cover of a book: an adze, a copper Was scepter, the size of a key. She picks it up. \nShadow hooks her eye, again. She follows it down the hall, to a door. She approaches: it’s red. She looks at the keyhole. She looks at the adze. It fits. Her heart beats faster. She opens the door and enters… \nThe Salon, puts the key in her purse and takes in the space: calendars, globes, circular maps, wheels and books—just one long shelf. \nFrom left to right, they read: Descent of the Goddess, Book of the Dead, Riddle of the Sphinx, Hymn to Demeter, Allegory of the Cave, Golden Bough, Three Metamorphosis, Night Sea Journey, Rites of Passage, Ways of Initiation, Alice in Wonderland, Individuation, Wizard of Oz, Eternal Return, Hero with a Thousand Faces, Star Wars, Heroine’s Journey, Writers’ Journey, Save the Cat, Nekyia, Hero with an African Face, Transformational Arc, Story Circle, Heroine of 1001 Faces, Collective Journey, and, stuffed into the shelf, on top of the books, she sees a worn folder. All the shadows in the room, including her own and the figure she followed, are drawn, into its folds—like a genie to a lamp. \nMusic fills the space. Everything vibrates. She takes the loose folder. It reads, in marker, Story Atlas & the Golden Wheels. She opens it. Red pen, a work-in-progress. \nMusic crescendoes. She snaps out of it, puts the manuscript in her purse, and exits to …\nThe Hall. Young women approach, like a gander of geese, almost dancing, oddly. Their skin is glossy, but matte, like candy wrappers. Their bodies are too plastic, like dolls, their eyes too clear, like diamonds. Jaq, friendly as can be, tries to make contact. \n“Oh my god, hi! Can I ask you a question?” \nThe music changes, so do the women. The sound of strings makes them move, like cymatic-puppets. Jaq spools with fear and runs. \nThey chase. She struggles to flee in her heels. The hallway fills with dancers. She picks off her shoes, running, hopping, and puts them in her purse. \nAt the end of the tunnel, she sees a red door of red windows. A wedge holds it open. She grasps the knob, an apple, kicks the wedge free, slams the door shut and crosses the threshold. \nJaq enters the studio. Dancers pound the door. She backs away and scans the room: organ pipes, a desert floor, a silvered mirror, a lifeless woman. \nSound fills the space. Forms vibrate in the sand. A mandala shapes around the woman. Percussion lifts her chest. \nThe door bursts open. Puppets pour through, like the sand of an hourglass, their bodies in states of masked decay. Jaq panics. She scans the room. Shadow shoots from her purse—to the doors of a storm shelter. Jaq follows. \nChased by the zombie chorus, she opens the shelter doors. The hoard swarms. She turns her gaze to the the great below. Darkness. She withdraws to retreat. It’s too late. Bowled over—overwhelmed—they fall, down. \n\nSun Sets outside the Mythouse. \n\nA stair squarcase spirals inward, constricting the dancers, swallowing Jaq. They fall, into infinite regression, into abyss. The staircase becomes a vortex. The vortex becomes a liquid. She’s sucked through the eye. \nThe hurricane becomes a cyclone, becomes a spout, becomes spray: the snort of a sperm whale, a spinning platform of water droplets. She yawns, uncontrollably, and descends, towards waiting jaws. The mouth becomes a crack in earth. She’s eaten. \nShe comes through a tunnel, through a cavernous opening. Two holes wait beneath her. She falls at the ground between. She screams an inaudible scream, then divides, like a cell—in two—and falls through the slits. \nOn the other side, as though she’s passed through a prism, she sees herself in refraction, a rainbow of selves, translucent, wave-like, shimmering. Ripe fruit falls, like rain, all around her split forms. Awe displaces fear. She reaches for an apple. It turns gold to the touch. She snaps to a single body. \nShe opens her hand. Inside is a walnut—shaped like a coffin. It carries a seed. Thousands fall, like splinters, to the earth. She falls asleep. \n\nBlack. \n\nIn river caves, in a Gondola, Jaq comes to. It’s dim. She looks behind her. Zombie women, stuck at the bank, look in their own reflections. Beautiful women—Barbie perfect—stare back. One of the girls, deep in her own enchantment, falls into the water. A storm begins to stir. \nJaq’s pilot, the boatman, Set, wears the robe of Death—black, hooded. He parts the way with his long was scepter. The water is dark. It darkens. He rasps, “Life is abandoned, here, why can you see?”\nJaq observes her surroundings. It’s black as night. “I, I can’t see anything.” She hears the water, his pole. “Everything is dark, like the earth underground… like a grave… like the inside of a jar.” \nGlowing bubbles rise from below. Set’s eyes—empty, black—reflect their hope. “You see. You will believe.”\n\nOn a golden island, under heavy rain, Golden Apples shine like little suns and fall. The hood of a cobra protects Jaq. She lies, sleeping, balled, in a crater. A puddle pools. The snake wraps around a young tree. It sprouts from an old stump—massive, long dead—with roots that circle the world. \nWolf observes. Apples swerve to spare him. She stirs. The serpent dries into bark. Wolf becomes stardust, fades, and gifts the space with his being. \nShe awakens, alone, clutching her purse. It’s open. Something sparkles. She looks inside. It’s her meteor. Dazzled, she grasps the stone. It splits in two. She lifts a lobe. Down falls a chain, fine as thread, seven metal links: Gold, Silver, Iron, Mercury, Bronze, Copper and a hook of lead. \nShe puts on the earrings, looks in the water, and sees her reflection—ruby lips and sparkling eyes, beautiful as the starry sky. Beneath the surface, beneath the image of her starlight earrings, her feet glow like coals, bright as a furnace. \nThe water sizzles. \nSteam billows. \nRainbows flare. \nThe steam subsides, like a veil, revealing her heels of meteor steel: quenched, cooled, dark, silvered. \nVenus, jewel of the solar corona, crests the horizon. Sun follows. Its beam parts the sea, threads a cave and climbs a mountain. The base, lead, is topped by a belt of copper, then slopes of tin, mercurial crags, rusty rocks, sliver clouds and a golden capstone. It shines like the sun. \nJaq pinches herself. Nothing. She looks around, then down at her heels. She clicks them three times. Embarrassed, nothing, she tries again. \nThere’s no place like home.\nJaq jumps, looks around. “Who’s there!?”\nI think you’re supposed to say, “There’s no place like home.”\n“Where are you?”\nDid you steel a book?\nJaq looks in her bag—no book. “How did you know?”\nI am that book.\nJaq sits, out of focus. “The Story Atlas?”\nStory Atlas.\n“Atlas… Can you help me?”\nI don’t know. \n“My sister. She has to be here, I have to rescue her.”\nDid you read the book?\n“I flipped through it.”\nDo you know what it’s about?\n“Story Structures? Myths?”\nAnd transformation. I recognize this place.\n“Where are we?”\nNot where.\nJaq thinks. \nGolden apples on a golden island at sunset? Are you disoriented and overwhelmed—like you’ve been swallowed by a whale?\n“You could say that.” Jaq remembers the jaws becoming a cave. She remembers the earth swallowing her. \nThis world appears to be drawn from my pages.\n“What do you mean?”\nI recognize too much. It’s like my diagrams were used as blueprints to make this space. It’s not normal, for the second, minute and hour hand to tick though time aligned—for a journey through day, night, month and year to happen at the same time. But what do you see?\nShe scans the area, confused. \nGolden apples, falling, beneath the horizon, with an upside down sunset, under a waning half moon? As you enter a new world? It’s all too perfect—it’s too aligned—even for a story. \n“What does that mean?”\nIt means: The space we are in is time. \nThe sun approaches. Beneath, the golden sand begins to quiver, to vibrate, into yellow bricks, into a road. Zombies crown the horizon. They dance down the path—towards the island. \n“Do you know where my sister would be?”\nIf we are in a story, I am clearly your guide. I do not, however, know where she is.\n“Then how can you help me?”\nIf this place is based on my blueprints, I can tell you the when of where we are, and I can tell you the myths in what you see. \n“Okaayyy. Are you a genie, do I need to rub the earring and make a command?”\nI’m not in the earrings, or heals. I’m in their space. And you don’t have to speak out loud. I can hear your silent questions.\nJaq thinks the question, a little bratty, a little stilted, Oh great and powerful Atlas, meta-temporal wizard, whilst thou define, whenst we are art in this temporeality? \nWe stand at the crossroads of day and the night sky, summer and winter, wake and dream, life and death. This is the other side of sunset, the fall equinox, the mouth of Hell, Hades and the Duat. Behind was a calling, ahead is initiation. The where of this now is a golden island of sunset—a hole in the horizon—a threshold crossing.\nThreshold crossing? Like The Threshold of Adventure?\nThe term used by Joseph Campbell to describe this stage in the hero’s journey, a stage unveiled by Rudolf Steiner, in ways of initiation. This is when we are swallowed, into the belly, into the nightsea journey. This is when we leave our world to go somewhere new, when the hero, as a beast of burden to an inherited morality, enters the desert to prove his value—to become a lion. Did you come through a wardrobe or rabbit hole, over a rainbow or through a mirror? Did you set with the sun. Were you planted with seeds? Did you see Sky making love with Earth. You would call it storm.",
    "forge": "Trumpets, almost too low to hear, announce loudly. The ticks of a clock sink bricks in a lengthening path. Zombies—puppets to the solar sound—near, their faces covered by golden lego goggles. Wax balls stuff their ears. \nThey pass by Jaq, blind to the world, dancing, like vibrating sand. The golden apples mosaic into small particulates. Trees become sawdust. Earth becomes sand. \nBricks solidify beneath her feet, lighting a path—a tributary—to the line of zombies. She approaches the ant-line. A brick rises, through the air, to her face. She panics, swats through the lego sand, and watches, defeated, as the goggles reconstitute. \nThe zombies look at her, all at once, and dance her way. What’s happening?\nThis is a test, on the road of initiation.\nWhen is a yellow brick road?\nThe zombies near. She squenches her face and accepts the brick. Dancers turn forward again, to their march. Jaq locks into step. A cave takes form before them. \n- Jaq moves confidently through an office. An executive approaches. She responds, as though to an assistant. Yellow brick roads are the paths of sun, soul and seed through night, death and gestation.\nOn the Yellow Brick Road, Jaq’s clothes shift shape. She moves through dreamscapes. \n\n- A night club stage, Jaq sings and dances. Her dress is red, like her lips— bright as a furnace. People cheer. She smiles with pride. Yellow arrows light the Camino, sun is charioted in a golden cup boat, to the end of the rainbow, over and to the pot of gold, Oz, El Dorado, the golden island of the golden city with the golden apples, golden poppies at the p(a)lace of sunset. Where wool comes over the eyes.\n- A battlefield, Jaq, a general, gives a pre-battle speech. Sun leads the way through night, through winter, to complete a golden ring—the ring of the golden age, the age of Saturn, the age of predictability.\n\n- A Golden desert, Jaq staggers, weary, loaded down as the camel beside her. For children, this Eden was a nursery. For the adolescent gods, it became a prison. The golden road is a traveling Eden, defined by obiescence, that safeguards his  children. Cronos, however, has a habit of eating them.\n\nOn the Yellow Brick Road, she panics and swats at the bricks on her face. The legos reconstitute. He does not want new life or free will to break his rings.\n- On a college campus, beneath a leafless tree, she reads, StoryAtlas: Psychles, bound in a golden cover. The quad is golden brick. This is what those bricks represent—what begins as a golden path of support…\n- Becomes a Prisonous Cavern ... becomes a golden chain of responsibilities. Jaq imagines herself with a flaming sword, staring into the layer of a green dragon—a road of gold at her feet. \n\nThe Yellow Brick Road, Illuminates a dim cave. Jaq dances into the abyss like her fellow zombies. Golden gears in a machine, until, you are someone else’s prison bars.\n\nIn Plato’s Cave, Gold flickers and glows, like fire, from a central hearth. Facing outward, employees—with gold-tinted glasses, chain mail and cuffs of gold—shuffle paper. They watch their shadows, intently. They fight dragons, slay monsters and win tournaments. Jaq hears clacking. \n\nA yellow brick billiard table—amber balls of packed sand, of crystallized honey-sap. BB, a skeleton of gears and bone, in a golden mantle, lines up. Mechanical, he sinks the eight. \nThe man he was playing, face in a brick, walks away. BB looks at her, at her hand—a cue of lead. “If you can put down the cue, you can leave.”\nThe table is set. She squares, breaks, nothing drops. BB lines up. \n“Welcome to Hume’s table. All that exists, fits in these walls. Everything is a billiard ball.” He sinks a shot—mechanistically. “Matter is dead.” Two more: the base of her cue turns gold. “Causality is all that is that, all that there is.” He sinks two more. Her cue gilds to the hilt. “There is no life. There is no freedom. There is only common sense.” He sinks two more, then finishes, with the eight. Her cue turns solid gold. A cuff appears on her wrist. She cannot let it go. BB laughs. \nThe table is set for a new game. Jaq’s guide whispers to her, “This is not right. This place is upside down.”\nShe thinks back, silently, What do you mean?\nHe’s training you to the normal, but it isn’t normal here.\nHow can I win?\nThis is a test and a training.\nCan you help me? She walks around the table. \nLet me ask you a question. How did the table get set? How did the cue find your hand? Ask him the questions. I will give you the answers he hides.\nShe lines up to break, then asks BB, “Have you told the whole truth?” She breaks. A ball sinks. \n“Objectively.”\nHer guide responds, He limits your attention to the observed.\nShe thinks another shot. “What of the unobserved?”\n“There is no unobserved!”\nHis lies guard a broken door. A ball sinks. Her cue returns to wood.\nJaq asks, “What happened to your prison?” A ball sinks. \n“My prison is well and thriving!” He directs her gaze across the cave.\nAtlas explains, his fanaticism hides doubt. Golden bars are beams of light. Golden weights are balls of energy. Golden chains are waves of freedom. \nBB continues. “The momentum cannot be stopped.” \nShe misses. \nHe sinks four balls with one stone, dominoes, then the eight. “Prepare to never leave.”\nThe table is reset. What do I do?\nAtlas responds, The doors are wide open. You have to believe.\nIn what?\nThe impossible—that you can save your sister, that there is free will, that the world is not dead, that everything is not separate. \nBut I can’t! I know the world is dead. I know it’s all matter. I know it’s all separate. There is no love. “I don’t believe in free will!”\nThen you have imprisoned yourself.\nBB smiles. She tries to line up her shot, but struggles, until she’s having a seizure. The world spins. She is completely disoriented. The harder she fights, the more intense it gets. Her eyes are not ok. They close—but keep moving. \nBe still.\nJaq falls unconscious. The world goes dark. \nShe comes to—wide eyed—looks around. BB waits. \nAtlas tells her. You have known for a long time.\nShe lines up. “Matter is energy.” And breaks. The balls glow and ring like bells….one sinks. Her next shot is blocked. “There are swerves in causality.” She hooks her cue and sinks the shot. She does it again, but is left with no choice. \nBB sees and laughs. “Impossible.”\nJaq remembers falling—through the slits—as a rainbow body. \nShe sees it on the table: a quantum option. BB twists with laughter and repression. “Are you mad?!”\nShe shoots her shot. The cave flickers with darkness. Shadow streaks by. Light returns. They observe: her ball has fallen.\n“You cheated!”\n“Reality cheated.”\n“That doesn’t count!”\nShe looks at her wrist. The golden cuff is gone. “I think it does.”\nShe leans in, she lines up—another impossible shot. A flicker, a clack, her balls have disappeared. \nThe cue in BB’s hand becomes a sickle. His golden body turns to lead. “We will meet again.” He fades away. \n\nWater drips from a stalactite. Kedalion, an old dwarf, blueish, appears to Jaq. “You did it! You’re here!”\n“Why hello. Who are you?”\n“Oh, no one remembers my name anymore, it’s you that’s important!”\nJaq tilts her head—tender hearted. “Me? Why me?”\n“I will tell you everything, but we have to wake you up.” \nJaq scans the landscape: Sleepers. “But I am awake.”\nHe directs her focus to a distant figure. She sees herself—restrained, a brick on her face, in a tie of golden mail. “Follow me.” \nHe leads them through the mazey masses. \n“I don’t understand. How am I here and there?”\n“This is a cave of dreams. Your dream is to be here.”\nThey come to her sleeping self. \n“Will she, will I, actually…?”\n“Haven’t you?” Chains slough from her sleeping shoulders. She opens her eyes—one-self again. \nDancing zombies search the cave—frantic. \n“How do we get out?”\nHe points to an oculus—a small hole in the roof of the cave. It twinkles, like a guiding star. “Climb.”\nThey weave through shadow projections. Zombies swarm behind. Kedalion leads Jaq to the light above. \n\n…Into a mortar shaped bowl of stone. Light pours through, as though milling the rock. Kedalion directs her to sit. She peers back, over the lip, ever curious. He yanks her down. “They want to get you!” \nThey wait and wait. Kedalion looks. Jaq looks too. Zombies spread like a wave. Shadow darts across the wall—into the cavern depths. Dancers follow. \n“He cheated for you.”\n“Who?”\n“Pan’s shadow. You have seen him before.”\n“It led me to the book.”\n“You have the book?! Where?! Can I see it?” \nShe looks at her heels. He looks at her heels, then up at her earrings. His eyes widen, no way! Rare joy shocks his system. He gets excited. “Can it hear me?”\nJaq waits. Her guide responds, I think it’s okay, Jaq nods.  \n“Does it know where you are?”\nUnsure, Jaq answers, “a meta-temporal reality.”\nKedalion smiles and frowns. “This is true, then you know this world is shaped by the book. That does not, however, answer my question. Do you know where you are? Do you know what this place is”\nAtlas whispers, No.\nJaq responds, “No.” \nKedalion grasps a clod of earth. “Have you heard it said, God is Dead?” Jaq nods. Sod grows from the soil. “This is an echo of an earlier prison. Before the loss of faith in God, first was lost the faith in life—in nature.” The sod dies in his hand. The clod crumbles—into dust. “Before it was said, God is dead, it was said the great god, Pan, is dead. Pan means all. All is dead.” \nFive-leafed ivy—tree stars—circle the oculus. A stem breaks. A star falls—slowly. “Pan is the god of nature. Nature is dead. Life is denied—in us, in the world. But let me ask you, Jaq…” \nThe tree star lands gently in his hand, sparkling with moisture. He gives it to her. “Is there not life in this leaf?” Jaq pauses, holding the leaf, dreadfully unsure.\n“Jaq! Of course there is life! What do you think you are? Pan is NOT dead, my dear, he cannot be dead, and you are in his broken heart.” \nShe recoils, stunned. \n“Everything you see here is him, everyone you meet.”\n“I don’t understand. How is this place a book?”\n“Before he fell, the devil was known as the Peacock Angel. His role was to anoint kings. He did this by spinning straw—into gold—into solar crowns, by creating myths and weaving acolytes into the center of his webs.. These stories, however, were eventually not enough. So he made greater prisons—first for dissenters, but then, for imagination itself.”\n“What do you mean, prisons?”\n“Paradigms, palaces of memory, where he can breaks spirits, where he breaks the world’s spirit.”\n“Are you saying what happens here happens everywhere?”\n“In a way. But three thousand years ago, his prison failed, and he had to create a new prison, a worse prison, this prison.”\n“And how do I escape this prison?”\n“The only way out is to heal Pan’s heart.”\n“You mean the world? Is that what his shadow wants?”\n“Conscious parts of Pan’s broken psyche repress my deformations. But as much as they disidentify with shadow, it can’t be willed away. The more it’s repressed and denied, the more likely it is to crack reality and trigger change.”\n“And that’s why it brought me here?”\n“That’s why he helped you win. You will meet many broken pieces of Pan on your journey. Some are threats. This is a good sighting.”\n“Then you are Pan?” She puts the tree star in her purse. \n“Have you seen a statue of Shiva? Dancing the dance of creation and destruction? He dances on a dwarf. I am that dwarf. I am that part of Pan—the part outside his self-identity, his shameful, his ugly, his crippled.”\nJaq wraps her purple scarf around his lonely shoulders. “I don’t think you’re shameful. If beauty isn’t everywhere, and in everything, fuck beauty. But I think it is everywhere, and I think you are beautiful.”\nThey look up at the oculus. “You are escaping the lesser prison of dead matter. Ahead is the greater prison, the older prison.’\n“You said it was destroyed.”\n“It was. But no one remembers how. And the prison of dead matter is bursting at the seams. I am afraid the old days will return.”\n“No one remembers, at all?”\n“Only Eros, the meteor, the phantom, forced underground like a beast, into the unseen. You have to find him.”\n“How?”\nHe looks down. She looks down, at her starlight heels. \n“I’m here for my sister.”\n“Find Eros.”\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nRoad of the Forge\nMount Cosmos casts shadow over the cavern’s eye. Jaq crawls free, through ivy. It swallows at the opening but is repelled as though by poison. Kedalion looks up from the darkness below. She lends a hand. \n“It’s not safe for me in the light. I stay safe down here, in the cave.” Her stomach tightens with abandonment. She looks at the mountain—its peak is blinding, like the sun. \n“Can I ask you something, though?”\n “Of course.” Jaq turns to him.\n“Can we be friends? I don’t have any friends, and I think you’re really nice.”\n“You think I’m nice?” She drops close, intimate. \n“Yeah.”\n“We can be friends. You really won’t come?”  She rubs his shoulder, the scarf. “You could be my Kedalion.”\nHis eyes go vacant. He remembers…\nOrion, under the stars, eyes wrapped in bandages. He sits on the great shoulder, guiding him through the night.  “How do you know that name?”\n“I love myths! And that’s what this place is, right, a world of myths? I like that myth. I like your myth: Orion’s guide to sunrise.”\n“To new eyes.” Kedalion smiles and sighs. \nMount Cosmos shifts its shadow, away from the cave. Jaq beacons her friend,  “Oh, you must come with me!”\n“You know, on that journey with Orion, I was out of sight… the whole way.”\nHe withdraws into shadow. She smiles—tender.  \nVerdant walls close on a path of gold. Ivy withers and dies as it reaches the bricks. Jaq looks down at her starlight heels, then up at the mountain. Sticks crack. Unseen animals vanish like a loud breeze. Birds fill the space with cacophony, then silence. She traces the road through silver clouds, to the peak of gold. A rumble approaches. \nA boulder of lead caroms down the mountain, widening the path, bowling over trees. Sisyphus, a brawny Greek man, also lead, chases after. The boulder nears. It turns to stone, stops. Sisyphus becomes flesh. \nJaq is in his way. He looks at her. She looks at him. He asks, “Where is your stone?”\nSand whips through her ankles, around her hips and shoulders, engulfing her bag and forming a boulder. Flashing gold and silver, blue steel, mercurial green, bronze, copper and red, it dies into lead, then dries into rock. \n“Why will you climb?”\n“For my sister.” She looks at the stone. \n“You think you’re here for your sister?! I climb for me. You must climb for you. This is the way. You are here for power and freedom beyond courage. Your sister has these, doesn’t she? And you want them. This is why you are confused.”\nJaq fights hard to be hard, to be stone. \n“Look at you. You can’t even touch your destiny. Flimsy. Weak. Where is your fire?! Where is your drive? You don’t deserve those shoes, and you will never keep them.” \nShe looks at her heels, then looks at him, puts her hands on the boulder, loads, pushes—nothing. \n“It’s a start. I’m going to sleep. Keep trying. Imagine the climb the best you can. I will dream of it.” He lays down—his stone a pillow. “Watch the fire. Don’t let it get low. Nature wants to swallow us—into its cycles, into eternity.”\n“But it’s not night.”\n“It never is on Mount Day, even when it gets dark.” He turns in. \nShe observes the path. Overgrown at the edges, cracked, life does its best to crumble the bricks. They barely hold. A canopy of branches looms over the trail. Light beacons through the tunnel. \n\nHours Later, he wakes to her helpless struggle. “The climb is a dream of inner work.” \n“I don’t understand.”\n“Have you not figured out—you are in an imagination? This is not any stone. This is your stone, your philosopher’s stone, your alchemical opus. It will be cooked by the mountain as you climb. Impurities will fall away. Matter will be purged from spirit, and your stone will wane. If you can reach the top, only gold, pure essence—individuality—will remain.”\n“Individuality—why is that the goal?” \nThey look up and to the left at the great mountain. “When you begin pursuing purity, it is common to believe in the purity of love—in love as truth” \nHe stops to think, to remember, slip after slip, lost grip after lost grip. “But as you grasp the nature of true purity, as you recognize the purity of your own individuality, you realize, the purest ethic is to be perfectly self-serving. On the outside, we wear the clothing of love, but the pure golden core of the individual is and always will be individuality.”\nThe summit glints like a flawless diamond. “This insight should kill your inner servant, your pure submission. It should make you your own monarch. It should crystallize the pure empowerment of your self-focused-interest. This is the golden way. To reach the summit, you must put yourself above all else. To reach the top, you must come, like Midas, to see gold and only gold. When you see through the taboo of greed, you will see it is good, as gold, as dominance, as hierarchy and obeisance.”\nHe looks at her. “Now lean, into your boulder, and conquer your destiny!” She looks at the rock, frozen with conflict, pushes, harder, undecided, with all her might. Nothing. \n\nLater, Jaq leans against her stone. It seems bigger than ever. “Your weakness is holding you back. You don’t love your sister. You don’t believe in love. It’s just chemicals and body, remember. Purify yourself of this weaknesses, Jaq! If you want to save your sister, do it for yourself!”\nPain ruins the fairness on Jaq’s face. With hurt and conviction, she roars, intentional, lost, uncertain, sure. The stone moves, a smile breaks, her pride is in motion. Sisyphus leans into his burden. With practiced form and structured breath, he sets the stone rolling, then comes alongside his disciple. \n\nJaq struggles. It hurts. “This mountain was for men. Less can make it now. They get chopped in two, by the head cutters, while women are praised up the hill.  And shouldn’t they be? Isn’t this your turn? Your year? To be the great ones—to claim your power and status?”\nJaq agrees, step after tortured step. \nA distant train calls through the air. She observes the golden engine, its cars of silver and iron, mercury, tin and copper, a caboose of lead. He feels her weakness. \n“The train? You want to climb Mt. Self on a train? Wake up to the dream, Jaq! You are your choices. Your choices are metaphors. You are your metaphors. To summit the mountain of Self, you must climb the self within. Become the choices, become the metaphors, of top. You cannot get there on the train.” \nLight pulses, like an arrow, up the yellow brick road. Greenery recedes Into shadow. They continue. \nThey start up the mountain. The trees thin. “It may look like we’re leaving the forest. Do not be fooled. This is the forest of instinct and body. It will follow you. It will try to corrupt you with every step. Never forget, nature is the enemy of purity and self-power. Do not let the body become its ally.” She labors. “Mind moves matter. Push.” \n\nLater, in a rhythm, staring down at the passing slope, Jaq falls into a trance. The ground beneath her—pebbles and dust—becomes space and stars. Mesmerized, she looks ahead. \n\nIn Space, on a Cosmic Path, celestial lights guide her way. The boulder keeps her safe, like a bee in amber. She walks. It rolls—a wheel through the heavens. She sees a planet: \nSaturn, its rings cut the black, like a sickle. Orbiting hourglasses, like moons, wane and flip as they circle the planet. Jaq nears with Sisyphus. She sees the ring more closely: a golden train on a golden track. The engine becomes a serpent—eating its tail. \n\nOn Mount Cosmos, Jaq rubs her eyes. Stars fade. She rolls the stone up a dusty path. Saturn shines overhead. \n“Where are we, really?”\n“Mount Seven, Mount Cosmos, Mount Meru, Olympus—the solar system and days of the week, the alchemical path of philosophers, through deadly sins of the Kundalini.”\n”Kundalini, like the chakras?”\n“To climb without, we climb within.”\n“How do I climb within?”\n“Become powerful as the sun! Pure as gold! Free of fallen material illusion—become an individual! Isn’t that what you want?”\n\nA quarter moon wanes. Mindless as an automaton, her movements robotic, she queries Atlas. What does he mean, ‘pure as gold’? \nIt seems you will meet the gods of metal, their planets and days of the week. You will project yourself, your parts, into these parts of Pan. To climb beyond a planet, to leave it behind, is to purify yourself. According to your guide, if you reach the top, you will be pure as gold.\nThat’s good right? And then I can save my sister?\nI’m not sure. The ground shifts. She’s on the…\nCosmic road—planets in line ahead of them. Atlas continues, I can only tell you when you are. \nWhen am I? Jaq looks forward, her stone aligned with the planets ahead. \nA road of tests and trials. And it seems this road is the week and the daily planets—their metals, gods and deadly sins. At its best, this is a night sea journey of fun and games, quick lessons and the developments of your inferior functions—your undiscovered self and special powers. You are the searching seed: germ on the journey to womb. You may be climbing, but this is a descent, like the descent of Inanna. \nSaturn’s Cave, Jaq enters with Sisyphus on attic planks. Cronos drinks, melancholy, cold, in a head band of pewter and an eye patch of gold. Clocks, trains and dolls wind time through space. She sees a forge, crucible and a glass pelican, stacked piles of raw galena. The room is gilded lead. A raven retreats to the shadows, behind jars of fermented frogs. \n“Saturn, Saturday, the skeletal root chakra of solidity and sloth. You know him as Cronos: reaper of death, keeper of time, lord of the cycles. His abundance is of changeless predictability. His Justice is delivered in the fourth dimension. To reach Venus, you must transcend the fear of death, which paralyzes you, makes you passive, makes you accept the world without your will—without you in it.”\nSheep huddle in a corner, away from the Titan. A black ram, behind a train, locks eyes with Jaq. “No, you must bring yourself into the world. You must make it what it is with you fully in it. To transcend Saturn, you must grind against the wheels, break the cycles. Take responsibility for yourself. This climb is a reclamation of authority you have given away!” \n\nJaq looks at her feet. “To defeat the titanic, you must overcome the drives of nature—in your body, from the earth. They sap your strength, drain your focus and steel your authority.”\n“Is that what Saturn represents?”\n“All titans are body, earth and its drives.” She watches as Cronos feasts. “Saturn drove the Titans, as as Father Time, as lord of the wheels. He was the first to see day and night, life and death, fall and spring as clocks, as predictors of time, as rules for the harvest, as beacons for a Golden Age.”\n“Wasn’t that good.”\n“Cronos is the god of grandfathers in the attic with their train sets, where the world is not chaotic, where he can make perfect loops, and live in them—ideal loops, delusional loops, that eat their tails.” \nSaturn seals the cave with a massive stone. Above, a crystal lens is fixed in an oculus. A crescent moon shines through. \n“Is that why he eats his children?” Sisyphus nods and widens his eyes. “What do we do?”\n“Why don’t you ask your guide?”\n“You know about my guide?”\n“You seem to forget, you are the new one here.”\n“Ok.” She queries Atlas. “How did his children escape?”\nLightning strikes behind the oculus. Storm brews. Cronos was fooled. In place of his youngest son, Lightning, he was given a stone—a stone that was swaddled, like a baby, in wool.\n“Am I supposed to be lightning?!”\n“Lightning is pure spirit. It climbs faster, brighter and higher than any fire. It strikes with divine authority and will. No, you are not ready to be lightning. You are ready to be…”\nAtlas whispers, a trick.\n“A trick. You are ready to separate reality from illusion, from body, to create beyond matter—to trick.” Sisyphus withdraws into shadow. \n\nJaq looks at Saturn. He looks at her. “Who are you?”\n“I am Nobody!”\n“Nobody? Every is body.”\nJaq looks for Sisyphus but finds herself, alone. “Yes, I am my body, and it is that black sheep, over there.”\n“You think I am a fool?”\n“I think you are an alchemist! An astrologer! How could I possibly take you for a fool?”\n“How can you be that black sheep?”\n“The black sheep is me. When you least expect it, I will be gone, and all you will be left with is that black sheep.”\n“And you are its spirit? I don’t believe in spirits.”\n“Oh but you must believe in spirits. Haven’t you had your drink?” He refills a drained cup—pewter. “Pewter, you have been drinking lead. Am I real, or am I the poison?”\n“You are trying to confuse me.”\n“But how could I confuse you? You whose every thought fits together with perfection. Why would you doubt yourself? You know I can only be one thing.”\n“Yes, little nobody. Entities are not to be multiplied beyond necessity. You are a dream, and I am already sleeping.” He empties his cup, then settles, to sleep, on folded arms. \n“What a man, who cannot be fooled, who sees his eyelid is already lead.” The great eye closes, like a sunset behind clouds of wool. She slips into shadow with Sisyphus. \n“Good job.”\nShe blocks his approval with angst and an eye roll. “How do we get out?”\nHe smiles. “I thought you were the ram?”\n\nAt Dawn, Saturn opens his eye, yawns, stretches. He saunters across the room. Fighting sloth with discipline, he rolls away the stone. His flock pours forth. Jaq and Sisyphus hang, like baldrics, from two great rams. Puffy as clouds, one black one white, they step through the cave-mouth and fly—out, into space, and on to Venus. \n\nOn the Cosmic Road, their sheep turn to rolling boulders. Like cloud—lifting to the heavens—they join a flock of stars. “You are not expected to understand, not everything. Listen. Observe. To move through this space is to be trained.” Stars become glints—off water, between stones, on a beach. \n\nBeneath the waves, stars bubble. Jaq and Sisyphus climb, in scuba suits lined with brass, up sandy slopes. Golden tethers pull them on. \n\nOn Venus’ Beach, Sisyphus, copper and green, rolls a pearl from the sea. Jaq follows. Their burdens clump with sod. A white buffalo stands in the surf. Flushed doves scatter and vanish. Cats and rabbits flee to lifeless reeds. Venus approaches—red hair, green eyes, beautiful as the morning star. \n“Venus, Friday, Freya, the force of procreation, chemistry and emotion, the second chakra, where pleasure and hedonism defeat love—where harmony and beauty mask lust for fertility with sensual desire.” \nVenus crowns the bull with flowers, then wraps around his neck. He casts off, into the starry sea. \n“Transcend the second chakra with chastity, simplicity, moderation and understanding. The world is a self-renewing prison of duty-free pleasure. When you transcend the needs of Venus, the need for procreation, you will have her power of seduction—a power sought by Zeus. A power that seeks Jupiter, for love finds power beautiful, as a lifeline, as survival, as a bet on procreation—these are the same to her.” \nA wave breaks. The travelers are gone. Their copper remains, like shadows, in the sand—greening. \n\nOn the Cosmic Road, Jaq clings to the flying bull. Sisyphus is transforming—from copper, into bronze, into tin. The starry sea becomes a flood. The bull becomes a chest of wood. \nOn Jupiter, Storms rage. Water chases. They struggle, up, to a plateau. Zeus sits on a throne at an altar of stone. The pantheon, including Mars, Mercury and Apollo, encircle the space. “Jupiter, Thursday, digestion, gluttony and the delusion of animal hunger: Liberation from the third chakra of personal power comes from self-control, humility, temperance, moderation and fasting. This is the path from tyrant to teacher. To reach Budha, Mercury, you must overcome your appetites. This is the ascetic test. Hunger must be tricked.”\n“How?”\nHe turns to the bull: “Sacrifice.”\n\nHardened by the deed, Jaq makes the offering. Zeus looks at two piles on his alter: a clump of fat hides scrap and bone. A stomach is stuffed with cuts of meat. Zeus nods. Lightning strikes. Thunder echoes. Fat burns. Jaq and Sisyphus take their haggis.\n\nBack on the Cosmic Road, they glide through space, in bubbles of mercury. Celestial lights red shift around them.\nThis isn’t right. Atlas says to Jaq. Have you forgotten—this place is a prison? \nWhat other choice do I have? And if this is a prison, why do I feel so strong? I think maybe this isn’t a prison. I think maybe this is a path to power, like the letter said. Maybe my sister is already there. Maybe all those missing people really are becoming great. \nJaq, what’s happened to you? Can’t you feel self becoming reason? \nWhat would you know of self? You could never understand. You’re just a book.\nWhat would you want with a conscience anyway?\nSilence. \nAtlas? \nHe doesn’t answer. \n\nBack on Mt. Cosmos, Jaq and her Tin Man roll stones. They climb the mountain. Overhead, planets wander. Meteors shower. Stars wink. Jaq blinks.\n\nOn the Ziggurat of Mercury, from atop its peak, Hermes, Budha, greenish in winged shoes, holds a mace of twisted snakes, of flowing metal. Supply chains—the size of wagons—extract from every direction. A raven lands on his shoulder. He listens, then turns around. \nJaq summits the platform with Sisyphus—pure quicksilver. His mercurial friend greets him—familiar and suspicious—with unc. “Mercury, Wednesday, circulation and the heart chakra, four, where open communication can leak like generous charity. This is where we learn to hoard—especially truth, especially selfishness. With eloquence, we learn to placate, to content others with simplicity, to hide our greed, so we can feed.” \nShe looks at him—her innocence fading, like pain. At the center of the platform, she sees a jar. It’s bronze. She opens it. Ares, Iron, leaps forth, followed by men in full armor.  \nOn Mars, the train car of iron is packed with war dogs, and soldiers. Their eyes crack with rust. Joints, swords and guns—they fight stiffness, frantically, with oil cans. The dogs are cyborgs, pets of all shapes and sizes, conscripted for duty. They pant, sweet. A big golden dog, ridgeback and wolf, smiles at Jaq. It’s nice for a second. Until the whistle. The pack goes rigid. The train slows. Everyone is a warrior. \n“Mars, Tuesday, the muscular fifth chakra of courage, voice and assertiveness. Here, patience is overcome by wrath. Fear and aversion must be charged with a willful recklessness. You must communicate belligerence, anger, compassionlessness and the severity of your threats. This is the warriors’ path to overwhelming peace. You must remain devoted—to reach the moon—or be limited by kindness.” They near an…\n\nUnfortunate city. Courageous dogs burst from the platform. Soldiers storm the poor town.  “Stay on the train. Mars is a violent planet.” The doors close. Urine puddles. The engine chugs and departs. She eyes the others, suspicious. \n\nJaq’s eyes burn, like molten iron. Woodpeckers chip into passing poles. “You cannot accept yourself, or you will stop climbing. This is your bravery. This is your pilgrimage of valor.”\n\nMagnetic sands, rusted tracks, tremble and vibrate. Coal fire, steam, black dunes—for miles—and a sea of sapphire. Wheels spark with static—it catches the ferrous sand. Thunder crackles. Lightning spreads, like webs, across the iron desert. \n“Ares rusts. Least immortal of gods and metals, he feels weakness as danger, as threat, as victimization, as justification as justice—frail self-scared justice. Through his rusty weakness, he can be goaded through mood swings, blinded by either or, and fooled into flimsy decisions.” The train slows to a stop. \n\nThe platform receives their iron car. Stones roll down the ramp, without any help. Jaq and Sisyphus follow. Their burdens are heavy—anchored, like magnets—to the red planet.\n\n“Ares’ iron is drawn from ore. To recall an earlier source, magnetic sands, makes him feel brittle, insecure, moody and weak.” Meteors shower. “When he learns we are here, it will trigger his anger and make him imbalanced. His mind will turn to absolutes. Pulled by the moon ahead, he will lose himself in duality. Driven by his own torment, he will come to us.” \nThe train whistles. Its wheels spool with static charge. Sparks fly across sand and desert. The train charges with electricity, and leaves with white noise. \nSilence.  \n“Then what?”\n“You will overwhelm him with decisiveness, with a voice of thunder, or fall. This will awaken his mortal fear. It will cause his retreat to a higher power, to the moon, where we will follow.”\nA crescent moon descends into night, Jaq and Sisyphus are sapped. It’s cold. Sand clings to their rusty stones. They labor. \nRebellious, bratty, “Are we really going nowhere?”\nAnnoyed, “Going is going. This is The Way.”\nIt gets dark. Stars fill the desert. Meteors shower. Jaq is drearitable.. The eyes of Sisyphus rust closed. “Are we really going to do this all night!”\n Sisyphus scans the horizon, sighs, looks back at Jaq, and nods. A constellation of satellites forms behind him. \n\n\n\n\n\n\n\n\nGolden (Middle) Way\n\nMagnetic Sands drain Jaq and Sisyphus. They lean on iron boulders. A fire simmers between them. “Try to rest without sleeping. This is not a safe place to dream.”\n\nHours later. A meteor sparks across the sky. The crow of a cock echoes like a cannon. Stars fall and light up the night. She sits tall, looks over at Sisyphus, and tries to wake him. Nothing. He does not stir. \nThe fallen starlight slams into black sand—not far from them. It glows in the distance. A jet flies over head, then helicopters, which circle and land near the impact. She tries to wake Sisyphus, again. He does not stir. \nA team of black cars and helicopters break free from the site and storm her way. She stands, afraid. Dogs bark. She shakes Sisyphus, again: nothing. \nIn a flash, Eros, a man of meteor steel, flies from the site. He hovers before her, with eyes of starlight. Jaq is mesmerized. For a second, she sees Anteros. \nThe caravan converges. They’re surrounded. Men in black open fire. He lifts his hand. Bullets catch in a field of magnetism, then fall. He lowers his hand—like Superman to Lois Lane. She takes it. \nThey blaze from her camp and into the sky, across the desert, towards his crater. He shows her the world from above. Subtle storms simmer and crackle across the sand. Clouds fill the sky. It starts to rain, to thunder. Jaq gathers her courage. \nLightning strikes. They turn invisible. Thunder chases. \n\nFrom cloud to crater, a mere warp in the sky, Jaq and Eros descend. A dog sits, puzzled. Back cars and helicopters swarm the space. Men in black scour the area—earpieces in. Jaq sees a cave in the crater. He leads her to its mouth. \n\nThe cave becomes a corridor—iron ore walls, lapis lazuli veins, flecks of gold, a stairwell. They go deeper, into the mountain. The walls—carved chalk—are filled with bottles of wine. They come to a door. It opens on a masquerade. \n\nObsidian Roots hold the space, hollow, like an underground henge. Music plays. People dance. Neolithic leather, tuxedos, gowns, overalls, togas—all eras of evening dress. Some wear more, others less. Some wear next to nothing. Jaq covers her eyes in shock, then spreads her fingers. \nEros takes her hand. They move through the crowd. She finds herself dancing—and mixing shadows. The obsidian palace transforms, into a…\nPainted Cave—animals on the walls. The party raves, she raves with it, uninterrupted, in a…   \nStone Circle. An eclipse frames Jaq & Eros in a ring of fire. Their eyes touch. The eclipse completes. \n\nDarkness.\n\nIn an obsidian bed, in a carbon-black blindfold, he holds her closely. The glee of uniting lovers comes through as exuberance. She lets him lead. Her heart beats. Her breath changes. Her fingers go cold. The stiff pieces of her separate being dissolve into fluid wholeness.\nShe reaches for the blindfold, then stops. A smile breaks across his face. She changes with his change. Surprised, she smiles too, overflowing with love—more than she can contain. Light floods the room. Darkness carves out the stars.\n\nConstellations hang over lunar dust. What were dunes are now craters. Rings of rust surround silver stones. They wear space suits. Sisyphus’ face mask shines like a mirror. “What have you done?” Jaq comes to—startled by the reflection of her face in the boulder. “Ares has already fled.”\nShe sees her environment, all of it, in the gathered light of her boulder’s surface. “Where are we.” \n“The bone.” He resumes his labor and rolls the stone. “We are on the moon. Our minds are playing tri\ncks, already. What happened last night?”\nShe rolls the stone mirror. “I guess it was a dream.” She remembers the meteor. She remembers it cratering\n into the desert, \nthe cave, \nEros. \n“It is the oddest thing. I don’t remember a conversation in the dream, but I remember the dream as a conversation. \n“What was said?”\nShe descends blue stairs. “When I arrived at the masquerade, I asked where we were. Eros, who showed me the way, said this is ritual, that this mountain is stripping me of life, that we were where vitality goes, that my sister wasn’t there, yet, that we would be soon—you and me both. \nSisyphus shakes his head. “Then what happened?”\n\nAn Obsidian Bed, timeless, eternal, holds the lovers. Jaq moves to remove her blindfold, then stops. “I told him I believe.” \n\nA lunar crater wanes with shadow. They roll their stones. The moo of a heifer echoes and fades. “Moon pulls your doubt. It tests your certainty. Remember, you don’t believe. Forget what you heard.” She reflects on her stone. “Tell me the rest.”\n“Why are you so interested?” \nHe withholds. \n“He said, repression by the majority is oppression of the minority—that everything this place represses, is still in the mountain walls.”\n“Delusional. Repression is not real. If there is something you do not like or want in the psyche, cut it out. Split it away. Make it not you. You reflected, like a lunatic, on what you’ve shed. Let it go. Fight temptation. Don’t reflect.  To be pure gold, be pure of silver, pure of reflection.” \n“How do I reach the peak?”\n“Climb. Focus on the sun. Commit to purity, to Self, and you will summit.”\nThey reach a mirror wall. It circles the mountaintop. “Relinquish duality. Cut off your shadow. Shatter the mirror.” \nShe looks in her hand: a silver gun. She looks at the mirror and sees her sister,  nearly rotting—drained of life. \n“The moon, Monday, envious sixth chakra and nervous system where all could be known were it not for emotion, were it not for delusional belief in intuition, were it not for doubt, restless worry, and the pearls of ignorance. To reach the sun, you must want it, you must remember: gratitude is weaker than jealousy. It separates you, from your true talent, from serving your self. True wisdom and mental calmness follow transcendence of social welfare. You must free yourself from the giving of alms. Light comes from the aim of self fulfillment. Excess is the overflow of self-purity.”\nShe raises the gun at her reflection—at Echo. A doe scatters and flees behind her. “She’s not you!” Her heart pangs. She fires the silver bullet. The mirror shatters—with her face mask. She gasps for breath and falls to her knees. Sun blinds her untrained eyes. Yellow scales—golden bricks—form beneath her. She finds herself on the…\nCosmic Mountain. One small step, and she’s left the moon, on a path to the solar summit. \n\nThe golden road cracks. She looks down at her heel. An amber stone, a freed bee. “Now is not the time to stop!” \nThe bones of a lion catch her eye, then a horse and a jaguar—covered in sand, petrified. Sisyphus does not slow down. \n\nAt the solar peak, they come to a Parthenon and enter. Immortal grapes and apples, faces in permanent laughter—a banquet frozen in gold. At the top of the mountain, at the dais of the hall, Ra, solid gold, crowns a godly throne. From underneath the throne comes streams of flaming fire so that she cannot look thereon. His raiment shines more brightly than the sun and is whiter than any snow. \n “The sun, Sunday, vainglorious first chakra and skin of enlightened pride. Where individuals become singular, where those who should be humbled are humbled, where power is accepted as fairness, where anarchy lifts the tyrant, where ambition was prophecy, where faith in the summit is faith in integrity. On the sun, as in light, there is no matter, no mass—only pure, unbound, will. Nature, as you will see, cannot live on the summit. Here, it has been transcended.”\nA man is bound before Ra, by a single golden chain, over a crack in earth. It glows. She looks down at her hand—a golden ring on her finger. \nSisyphus is gold. Silver dapples come and go from his skin. \nRa speaks, motionless, “At last, my initiate and loyal servant.” \n“I am not your servant!” He tries to put on the ring. Spots clear as it nears his hand. The staff of Ra glows. Sisyphus soars, like a swatted gadfly. His ring tumbles after, returning to stone. \n“Look at you, Jaq. Refined, empowered, pure of the mountain’s body.” She approaches. Ra is a statue. \n“Free from the wheels of eternity, from low minded lust, from belligerent hunger, foolish love, the corruption of body and ignorant lunacy of reflection. You have completed all the rituals, all but one, to claim your power.”\nShe looks down at the man in the mask. An eagle of robotic gold lands on his chest, rips open his liver. The hole in his guts, like the hole in the mountain, is shaped like a tin of cooked fish. Her gaze falls through—into the glowing abyss. \n“I’m here for my sister.”\nHis staff glows with anger. Jaq braces. It cools. “You came to learn your place! Power is a pyramid. You are here for your power, all you can have, and all you can have is under me. Power submits to power, Jaq, and you are just a little girl.” \nShe removes the iron mask. It’s Eros. Her heart flutters. “Give up your foolish rebellion. Remove those ridiculous earrings. Deposit them in the abyss, through his pathetic wound.”\nThe staff flashes. The road becomes a snake. It draws itself up from the base of the mountain and coils around them. \n“This is Mount Power, Jaq, and thou shalt learn: love makes you weak. The path to greatness is paved with sacrifice.” She looks at the wound. Blood flows from his body, down the chain and onto narcissus (daffodils). They grow in his ichor. “You have nowhere to go. You have no other choice. Claim your power. Abandon love!” They are encircled by coils. The golden snake constricts. \nJaq looks at Eros. He speaks weakly. She leans in, close. “Love is life.” She gasps. His arrow pierces her heart. \nRa decrees, “Ignore him! Or fall all over again.”\n The staff glows golden red. The North Star, directly above, swells with blue light, expanding into sixteen points. “He is evil, Jaq. You must set him free. Return his chaff to eternal flame. Send his spirit, to heaven above.” \nJaq whispers to Eros, “How do I break the chains?”\nRa continues, “Purify the world! Purify his spirit. Let him transcend!”\nEros tells her, “Doubt everything.” The dam breaks. Blank, she lets it in. Flooded with doubt, seized, she falls to her knees. \n“You failure.” \nMeteors shower from the polestar. They whistle, like a volley of arrows, and pummel the mountain, ruin the Parthenon and pierce the robotic eagle. Starlight breaks the golden chains. Eros falls—into the abyss. \nJaq leaps to save him. Ra laughs. She pulls him up, arm in arm, elbow in elbow. “And where will you go?”\nEros breaks the chain—from his arms, from his ankles—and drops the links into flame. Jaq looks at Ra. Silence. His throne begins to rumble. \nEros gives his hand. Jaq takes it. They fly. \nThe serpent path winds, like a golden tape measure, into the staff of Ra: a caduceus, a candy cane, a North Pole. Eros and Jaq evade the collapse. Ra disappears. The mountain starts to erupt, then stops. Meteors pound the slopes. They dodge the missiles. Jaq looks down. \nThe mountain tremors and quakes. Resisting eruption, it vibrates and hums. Its sand buzzes into patterns like the surface of a beehive. A massive stone—pure amber, cracks, leans and falls. An avalanche follows. Bees erupt from below—from everywhere.\nJaq asks her guide, “what’s happening?”\n“You’ve cleared the golden threshold. Control is coming down. Your team is dividing. The plan has been betrayed.” \nEros turns, from the zenith of their escape, back to the mountain, racing its avalanche to… \nMars, to the Crater, to the tunnel. They narrowly escape: into the mountain walls.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nVia Negativa\n\nEros & Jaq descend cavernous corridors: stone walls—lapis lazuli—speckled with diamonds. Water drips, slowly, emanating calm. \n“Where are we?”\n“With the repressed.”\n“You mean the impure?”\nEros clinches. His fist bursts into flame—like a shooting star—then cools to the glow of a fallen meteor. “Purity is a delusion of self-identification. Show me purity. I will show you denial. Body is real. Hunger is real. Lust is real. They cannot be split away, only cast into shadow, where they thrive—unobserved. ‘Pure’ leaders have long shadows.”\n“Was this your revolution?”\n“Our revolution was integration—of all that had been cast out. Of all that was called impure. A revolution of oppressed masses, foreigners, minorities, feminine and indigenous, it was a revolution against static hierarchy—against a world cast in precious metals.”\n“How?”\nHe stops, reaches down with his smoldering hand, and grasps a clod of clay. It spins in his palm, as though on a wheel. He continues walking, she follows, it forms—into a jar. \n“As humans emerged from nature’s dream, they made a world of stone and clay. In stone, as in earth, as in the body of a mother, they saw life. Earth, they saw, as fertile. Vitality was seen in nature.” \nThe jar spins. It transforms, into a goddess. Her arms are raised in jubilance to the sky. His hand fires the figure. Her malachite eyes melt into copper. “Hotter fires unlock new metals. These metals unlocked cities and made the ages. You’ve heard of the Golden Age, The Age of Silver and the Age of Bronze.”\nThe copper eyes cool. “Through the age of precious metals, earth, which had been seen as vital, became seen as impure.”\nHe clinches the goddess in his hand. She crumbles. He wipes the eyes clean. “To work with these early metals, they were purified, of their dirt, of their matter. Dirt, earth, body and the feminine became seen as corrupt. The mythology of metal was used like a weapon—the weapon of purity, the weapon of a golden age. This weapon turned immigrants and minorities into impurities. Women became devils. Emotion, lust and bodily drives, were framed as deadly sins, as filth of the body.” The copper heats in his hand, into silver, gold. Impurity fumes, burns, away from the metal. \nThey come to an iron door. “Humans were fixed to the base of pyramids. This continued, for a long time. The feminine became more repressed.” A pyramid peaks in his hand. Gold, silver, and a base of bronze. He opens the door, into…\nA mountain forge. Jaq enters behind Eros. She sees a crucible, alchemical equipment, a hammer and anvil. He looks at her heels, extending his hand like a stirrup. \n“What do you think they wanted?”\n“Who”\n“The men in black”\n“To kill us?”\nHe pulls back his hand and shakes his head. “They kill everything.” She thinks. She does not know. “What did Jesus say? What is the new cornerstone?”\nJaq asks Atlas, what is the cornerstone of Christianity?\n “The Author did not come here.”\n“You could hear me?” \nHer earrings shine like stars. “Throughout the age of precious metals, technology of the future fell from the sky. Starlight, love-arrows, unidentified falling objects, metal too hard to shape. But everyone knew: someday someone would draw swords from the heavenly stones—unstoppable swords, and impervious armor—with authority from the sky. When it finally happened, the Bronze Age collapsed.”\n“Is meteor steel that much stronger?”\n“It was, but that wasn’t what brought down the mountain. Its starlight was a revelation, it was poetry, and it reframed life.”\n“I don’t understand. What’s in the poetry of meteor steel?”\nHe extends his hand. “Let me tell you its story.” She pauses, remembers her trust in the blindfold, removes her earring, takes off a heel and puts them in his stirrup. He takes the meteor and places it in his forge. She sits on a three-legged stool. \n“Long ago, before the rise of civilization, there was a love for earth. Like the mother, it gave birth. She was a goddess. Earth was revered. Clay was revered. Women of clay were women of life. \n“The imagery of nature, and its potential for metaphor, is timeless—on your scale. Blossoming has always been blossoming. Technology presents new poetry. Progress brings time to the dream of life. From the age of clay through the ages of gold, silver, bronze and steel, the poetic journey of technology through time has long been grounded by material science. Those who see with mythic eyes, see the history of metals as revelation.” \nHe draws her steel from the forge and places it on the anvil—a bigger meteor—then picks up his hammer. “When metals were unlocked, so was civilization. Without gold, without copper and eventually bronze, cutting stone was too much work. \nHe begins to hammer and thunder. “These metals defined the ages—copper gold, silver and bronze. They rose as a sequence of foundations. But do you know the best kind of gold”\n“Pure gold?”\n“And silver?”\n“Pure silver.”\n“And what were the impurities? This mountain is an ascent of purification. But what happened to Bronze?” She shakes her head. “It lost to steel. It lost to the age of heroes.” Lightning strikes his hammer. It falls on the precious stone. “And do you know our first steel?” The meteor glints in her eye. “Light from the heavens. Stars that birthed new beginnings. Stones destine to be drawn as blades.” She stares at the molten sword.\nHe pours milk into a basin. It shines like the moon—like the Milky Way. “Give me your tree star.” Jaq draws the leaf from her purse. He wraps it around his tongs. “What’s different about this sword?”\n“It can cut through Bronze?”\nUsing the tongs, he lifts the sword by its heel. It reflects in the milk. “Yes, but it’s not bronze. Why is the steel smith black? Why is the metal dark?” \nHer face lights up, “impurity!”\n“The stone that had been cast out.” \nHe soaks the sword. It steams. “The gathering of heat had not been quenched.” He draws the blade, by its heel, from the pool. “This is forgotten poetry, forgotten revelation, and it craters for your attention. This steel is Achilles. This steel is Excalibur, Sosruquo and Siegfried, Iron Man and the Iron Giant, Black Panther, Wolverine & Deadpool’s sword, Stardust and the Rings of Power, Mandalorians, Vulcans, Blue Eyed Samurai and the Man of Steel—Meteor Steel. It’s all meteor steel, a revelation of fallen starlight, and it wants to be known.”\nHe gives her the sword. She hesitates. “What am I supposed to do?” \n“You have two choices. Solve everything, save everyone, lift the curse, transmute our world. Or, behead the snake, kill the tyrant, and start it all over again.”\n“How do I save my sister?”\nEros is disappointed, “I can say no more. And if you do not understand, you must win us another chance.” He gives her the sword. “Its weak spot is the heel.”\n“You expect me to fight?” \n“The sword has a memory. It knows what to do. As long as you hold this blade, you cannot be harmed. It cannot be taken—only given.”\n“What do I do with this?” She lifts the ring in her palm. It shines like a little sun. \n“All weapons are weaponized imbalance. You learned this on the mountain. You met my purified friends—imbalanced by isolation. Lead made gold is powerful. Your ring is called, Thy will be done, Der Ring of Gyges, the Ring of Power. Its beauty and perfection veils the true essence of its wearer. Its shine grants protagonism. Anything you imagine, whatever thou shalt will, will find voice. You’ve used the ring before.”\n“When?”\n“The meteors.”\n“I didn’t imagine the meteors.”\n“No! You doubted. Your doubt expressed as Meteors. They said, ‘disruption is unpredictable, and it comes from the unknown.’ Like you, the meteor is an anomaly—especially here.”\n“If I can change the world, shouldn’t I fix everything?”\n“Fix everything, if you can, but if you put others under your will, you will no longer be a hero. You will be a tyrant. It will bend everything and everyone to the journey of its hero, if you let it.”\n“Is that so bad? To be a hero?”\n“Be a hero! The world needs heroes! You are more than a hero. You are a young girl not as young as she used to be, who hasn’t accomplished as much as she hoped to accomplish, who’s mean to her loved ones and struggles with depression.”\n“Why would you say that to me?”\n“The ring hates weakness. It will make it an enemy, especially your own. Doing will become easy. Restraint will be your challenge. It will tempt you—to remake the world in your image. Don’t.”\nDetermined, “How do I find my sister?”\n“Why are you asking me?” He nods at the ring. “Wake up to the dream, Jaq! The answer can be anything.” \nShe looks at the golden chink. It glows. She tosses it into the air. The loop spins. It’s a wheel of fire. \nOn the other side, she sees a cavern, a throne room. Spread against an obsidian trunk, she sees her sister, Echo. A thousand corpses hang from the tree—like cocoons. Jaq looks at Eros, her eyes on fire. \n“I didn’t come to turn the page.”",
    "quenching": "Jaq fumes through the passage, all but invisible, her sword gleaming. Above, the vault sparkles, a moving mosaic of night sky, a dome of starry billiard balls. \nAre you there?\nAtlas answers, I’m here, in new form, I see. Do you miss the heels? \nYes I miss the fucking heels!\n\nBeneath the obsidian canopy, she raises her eyes with cautious wonder. Mummies hang, thousands of them, from the tree of Obsidian—the soldier, the tycoon in training—in spider silk. She broils. When are we?\nMidnight, new moon, winter solstice, eclipse: we are entering the Nadir, the quiet, the extinguished throne room, the zeroic.\nWhat happens here?\nOld light goes out.\nThey near the tree—it’s hollow. She enters and looks up. The serpent of gold spirals, inside the trunk, to the sky. Where its tail meets the ground, she sees an Obsidian throne—a monolith. It’s empty. \nAtlas asks, What happened?\nShe turns. Behind her, over the opening, Echo hangs, in bandages, from her wrists, a cocoon. Jaq quiets. I was told what I shalt do. A cauldron boils—black—between Echo and the throne. \nWhat shalt thou do?\nFigure it all out. Transform the dream, somehow, or kill the tyrant, defeat the dragon, save my sister, bring down the mountain, reboot the prison, you know… I guess it should have been obvious. \nWould everything return…to how it was?\nIt seems so.\nThis is why I was put down. This is why my author couldn’t finish me.\nWhy?\nHe saw me as a weapon and became afraid.\nA weapon, how are you a weapon?\nWhen he saw the hero’s journey as an eternal return, when he saw me as a narrative prison, as a golden ring of ego and tyranny, he put me in his pocket. He made me to be a secret weapon—for a thousand revolutions—but here I am, and here you are, renewing the status quo. \nShadow moves across the wall of Mt. Power, to his throne, consolidating, like a genie, into Obsidian. \n“You think I can’t see you?”\nShe knows the voice from the statue of Ra. \n“You think I don’t know of your precious rebellion? You think I don’t know about the caves?”\n“Why did you help me? Why did you bring me here?”\n“To be my silver platter. To bring me my sword.” He opens his hand. \nShe remembers, it can only be given. The Sword has a memory. She looks at him and sees something different. “I think you’re afraid.”\nHe laughs. The dragon strikes—like lightning. She’s faster. She is lightning—raw spirit. Righteous, angry, heroic, she decapitates the snake. It’s body burns, like an electrocuted fuse. Thunder rolls. \nShe lowers her sword. “No more illusions. No more thou shall.” Her ring glows. \nShe looks at Obsidian, deformed with hate. “How dare you!” She screams. She’s lost it. “How dare you steal from us! How dare you take our lives! How dare you break the truth! You can’t have anything from me! You are pure evil, and you I’m going to kill you!” \nObsidian smiles. shadow steams from his space. “Pure evil? Look at you, trying to tear down reality, overwhelmed with rage. Do you really think humanity would be where it is without me? Without this place? I manufacture consent to order the world, to save it from chaos, to empower individuals, to transcend the limitations of nature and progress! Manipulation? There is no manipulation. I purify.” \n“You hide the missing piece. You keep the world broken. You steal from these people, but you cannot take from me.” \nObsidian is pleased. “So much spirit! But what are you going to do? You are just a lost little girl with no answers—only chaos and destruction.” \n“For a long time, I believed I knew nothing. But y9u know what I do know?” \nHis eyes glint. \n“Glass breaks.” \nHe seethes with shadow and lunges for Jaq. Obsidian blades extend from his arms. They shatter against her steel. He swings again, she breaks his arms again—again and again. Her heart has hardened—it’s in her face: hate. He stumbles backward, as though helpless. Without hesitation, “this is for my sister!” She goes for his throat. He’s smoke, silence, ash. \nThe mountain rumbles. Pebbles fall, like meteors. A stone thunks the crown of her head. The belligerence clears. She snaps from her former state. “Oh no. What have I done? What miserable exile is to come?” \nShe looks in desperation for an answer, where she knows there is none. Hopeless. The walls crumble. . \nAre you there?\n Silence.\n Fuck.\n“Ha Ha Ha Ha Ha”\nShe looks at her ring and seethes. The vat fumes. She approaches. Her reflection echoes in the crescent vessel. She hears spirit spiriting—laughter. Her focus adjusts. Strange fruit dangles behind her: stolen people. “Behold your weakness, all the metals, all the corruption you split away.”\nDeflated, unthinking, she removes the ring. Morning, she lets it go — instantly reaching — back, towards the cauldron. Too late, it’s been done. The ring melts—into her Cauldron of Stories. \nA mess, she looks at the ground and starts to dig. Primal, frustrated, she grunts. It’s too hard. She hits at the earth with the heel of her sword. It gives and kicks up. She cuts deeper, then grasps the dirt. With her other hand, she holds the sword — both — over the molten metal. \n“You wouldn’t dare.” \nHer arms reflect in the bowl. It will be okay. \nI know. \n“Fuck you! And fuck your purity.” She releases the sword and soil. \n    “No! That’s mine!”\nIt boils and steams. The sword melts. The molten elixir transmutes with beauty, like a peacock’s tail, like a rainbow, it erupts in colorful symphony, then settles.\nShe looks in the dark waters. As she leans over the bowl, she sees the reflection of Echo. Leaning further, she sees herself. A smile cries, like a sliver of moon. She lifts the dish to her lips, kisses her reflection, and drinks in her other. \nThe shallow dish remains, empty, silvery, shining. Her hologram reflects in the bowl—upside down. In the empty space, in her holographic face, she sees the world around her: planets and cosmos, the universe in a raindrop. Starlight reflects in her eyes and grows, until she is light—until light fills the space. \nDarkness. She falls unconscious. \n\nMidnight at the Mythouse, flashlights cut through darkness. Exasperated and hopeless, Anteros and Nin trudge, through a moonless night—knee deep in snow. The remnants of a brick path have waned into shards. Thorns, winter-dead trees, surround them in every direction. They look at each other. Nin’s face fills with tears. She crumbles to a rock—to a standing stone. \nAnteros sighs, then thinks to himself, I would do anything. The surge of urgency lurches him forward into a senseless march. His thumb snags, immediately, on a thorn of lifeless rose. Blood drips, into the snow. He watches, and falls, into a trance. \n\nIn a garden, surrounded by green, Jaq looks forward, still. Cupid sits beside her. “Welcome, Jaq-of-the-Green. Your sacrifice has brought you here, for a lesson earned by letting go. It felt heroic, didn’t it, to slay your dragon?” \n“Yeah.”\n“The heroic ego had to die, for you to get here. It was angry, wasn’t it?”\nEmpty, “Yes.” \n“So offended, so righteous, so blind.” \nShe looks down, ashamed. \n“And now?”\n“I feel defeated.”\n“What feels defeated?” Space opens. “What lost can’t win. Why did you drink the mettle?”\n“I was pissed.”\n“About what.”\n“That I let him make me what I was.” She looks at him. “For letting him split me in pieces—for letting him teach me to hate myself.” \n“You hated him.” \n“I hated myself.” \n“Good.” She is surprised at what she said. “And now?”\n“I want it all back! I want to be all of me. I missed it. I felt terrible. I felt emotionless. I didn’t care about power or purity or anything like that. I just wanted to be with myself. I just wanted to be whole. I just wanted to be me.” \n“What you did was very special. We are in awe. We felt that with you, and it changed us. But there’s more to what you did—to how you reshaped the dream. You are who knew what to do, but you don’t know what you did. You don’t know yourself. When you drank in yourself and all you had othered, how did it feel?”\n“Like everything—all at once.” \n“And then?” \nFrom deep stillness, “I was extinguished—I am extinguished.” \nCupid nods. “It’s time for a magic question.” Leafs lift in the breeze, showing their blue. “Do you feel less like you, less yourself, when you’re quiet, when you’re empty, when you’re still?”\nTears flow. “No.” She sobs. “I feel.” She can’t speak. “Like I’m all here.” \n“You are meant to remember this. You have been quenched, like hot steel, in a field of awareness. What you are experiencing is not particularity. This is presence.” Her breath clears with passing emotion. Vitality comes with the breeze, through damp lashes, awakening her vibrant eyes.  \n“Do you remember the pool table?”\n“Yes”\n“Remember the pool table. We have to go back there. You did not fully escape. Shadow saved you from learning. Can you see it in your mind?” She sees the table. \nImagine a musical instrument inside each ball. A French horn, a drumstick, a guitar—in amber—they’re racked. \nNow, imagine, whenever a ball is touched, whenever it would clack, it makes the sound of the instrument. Return to the game. Now listen.\nShe watches as BB breaks and hears the instruments—a chord, a sequence of notes. The secret is not in the table. It’s in the sound. No matter how many sounds or instruments you hear, your eardrum, like a microphone, vibrates with a single vibration. This vibration is all the vibrations of all the instruments. \nThe spiritual journey and philosophical quest is motivated by estrangement and separateness— from god, lover, cosmos, humanity, or anything we hope to be one with. The journey of understanding is from a perception of the world as particularized and isolated to a vision of togetherness. This is a journey to elixir. Mythic elixirs throughout the world and across time carry the secret of waves. \nThe song of cicadas arrives like the tide. A frog rabbets. An owl whos. The breeze comes through. “When you hear the frog, when you hear the cicada, you hear one sound—one wave. When you hear all the waves of all the notes of all the instruments in a symphony, you hear one wave. Waves can be one and many. \n“And we are waves.”\nAll of us. \n“One sound.”\nAnd many sounds.\n“Nothing is separate—not sand, stone or particle.” \nYet everything is individual. \n“I drank it in.” \nYou drank it in. \nShe feels the hum of oneness. \n‘You are ready. Look directly ahead.”\nShe looks directly ahead. “Let your eyes rest where they want to rest. Pick a point. Settle your gaze. Only look at this point. Your eyes will dart and change focus. You will blink. That has to be okay. When this happens, when you feel the impulse to dart, dart back to the spot. When you feel the instinct to refocus, refocus on the spot. These blinks will matter less and less, until it gets easy. I will help.”\nJaq is settled, still, her eyes hooded, fixed. \n“Forget about your breathing, just focus on the spot. What happens when a human is still? It’s important to know. Let the letting go. Be still and grow.” \nThe world blossoms from her center—continuously kaleidoscoping into living geometry, into glowing gems, into Visionary Experience. Time passes.\n“What do you see?”\n“I never knew I was in. I never knew I did not know I was—I am—in.” \n“And now, do you feel in?”\nJaq fountains, “and of, and with.”\n“With what?”\nHer face twists. She sobs—sorry for decades of self-absorbed exile. \n“Life.” \nHer struggle fades into a sense of overwhelming alrightness. Her fight, fear and anger let go.\n“This is why you’re here, Jaq. This is what you came to learn—to get and to give. You are alive! It’s all alive! Too afraid to look, too afraid it wouldn’t be there, life has been hidden, behind walls of the mind. Nature has been reduced to resource, for a people that would leave. Progress thinks it will kill nature, someday. It expects to transcend. It cannot. This long arc away from nature, through all of human history, has come to a turning point, and to make this turn, you need old weapons.”\n“Like the sword?”\n“Why do you think the book was unfinished?”\n“Because the writer stopped writing?”\n“He is writing. And he is here, with you, learning what you are learning.”\nJaq is stunned. So is the writer. “What is he writing?”\n“Has Atlas spoken of meteor steel?” She thinks for a moment. The answer is no. “Then why are your earrings starlight? Why are your heels steel? What is this place, Jaq? What is the book? What’s missing in here is missed out there. Life brought you in, to this world of imagination, to heal in its own language. Life brought him here, with you, to rewrite the book—to reveal the weapon kept secret through time, to identify the flying object. \n“Your myth has been long arriving, through stories moved by your incubation. What happened here is happening around the world. Teams of people, plants and animals, mushrooms are working to share the secret: life. \nA trickle, a dam-burst, a movement. It’s coming. It’s inevitable—a return journey to nature. If life can be seen in the leaves, if church can be seen in the trees, when the book of life is seen as a book of poetry, the conditions will clear for something new.” \nShe looks around the garden. “You climbed Mt. Isolation. It didn’t used to be like that.”\n“I thought if I drank in my other, as the protagonist, so would Pan, as the world.”\n“You have re-identified with all you are. Pan cannot—not until the mountain erupts. Body is forgotten as temple. Earth is forgotten as womb. The patterns of life have been miss-taken as prisons. Free thought has been pushed to the periphery. Transcendence has broken the wisdom of wholeness. Life must be reclaimed as a book of poetry”\n“What am I supposed to do?”\n“The prison is cracked. It will burst, and reform, to its natural flow. Stay focused, stay aligned. You will know what to do.”\n\nObsidian roots twinkle with starlight—like a Christmas tree. A stone circle surrounds the center. Feet dance and stomp in the soggy ground. Mud rises to their ankles. Roots begin to sweat and stream. A puddle pools. In panic, they flee the center.\nA curious dancer turns back. She returns to the fountain and looks at the surface. Through her reflection, she sees the obsidian tree. Mummies swing from its branches. \nMore dancers come look, then all of them. They see themselves dangling—in the water, in the tree. Silver cords appear, like umbilicals, connecting them to their reflections. Eros nods. They enter themselves.\n\nThe Obsidian Throne Room is flooding. Glowing veins of the great tree, amber, light the mountain’s core. A honeycomb lattice is revealed. This space is contrived. \nBees descend the column, through obsidian branches. Buzz against glass restores black to bark. Like halos, they swarm the heads of precious dead. Silver threads weave round the mummies, until they glow, until the dancers burst free—like moths from cocoons. \nDirt becomes mud becomes puddles. Jaq lies by the empty cup. Her earrings have returned. They glow like meteor seeds. Her heels sizzle and quench in the flooding ground. She lies still. Steam rises. Rainbows flare. \nBlood drops past Echo, like a tear from another world, onto Jaq’s left eyelid. Her eyes shoot open. Her sister roars with the pain of labor. \n\nJaq’s heels ground firmly in the living soil. She looks up at her sister. The voice of Obsidian echoes, “you will never escape.” A flood of bees swarms the space. Jaq takes her sister. “You have nowhere to go.”\nA radical first root sprouts beneath the vessel. A beetle flies free. She follows the clue. She peers in the bowl’s reflection—of the mountain above, of its upside-down hologram. She steps in. Bees follow, then the dancers. Flood closes in. The mountain rumbles.\n\nI",
    "integration": "Atop the Golden Summit, green shoots of will-be narcissus grow from Jaq’s sparkling heels. Bees flee from the chasm below. She cradles her sister and observes the familiar scene: Ra’s broken throne, the cratered pantheon, a path of golden scales—dead, dry. The hum of bees against mail lifts up the snakeskin. It sloughs from the path, revealing bricks of packed sand, vibrating sand, vibrating amber. It flows~like a river of honey. \nThe mountain quakes and turns inside out—into a hollow cone. The ground towers overhead, and the honey thread, of Zoe, the clue, streams upward, through the lunar mirror. She sees the planets—churning—in its frame, and calls Atlas. “Are you there?” \nIn a way.\nWhat do you mean?\nSomething is different. I think I am being rewritten.\nThe mountain prepares to blow. A honeycomb drift takes shape beneath her. The volcano explodes with magmic water. She flows to the mirror, on a wave of honey. Her craft vibrates and grows into a golden cup-boat. Bees follow her through the looking glass, back to the…\nCosmic Road. Bees take form around her. Nectar flares and flows from the solar corona. Ahead, the planets are aligned, like a thread of pearls—each in a state of mutation. When are we. \nThe road back, the magic flight, when the radical first root grows into a network, when the world prepares to sprout with coming spring. This is when team is regathered, resolution begins and authorship is claimed. \n\nThe New Moon cracks, like a black mirror, by a radical sliver of light. The lunar surface begins to fold and resolve into dead-white brain coral, into a labyrinth of mirrors. In the reflections, she sees Obsidian’s face. \n “You have nowhere to go,” he says, then folds out of view. “You set me free-to be nothing—to be the everywhere you can never escape.”\nBlack as the cars on Mars, UFO’s take formation behind them. She accelerates to the red planet. A figure appears in the distance. “What’s that?” \nIt swoops through the bees between her: It’s Sisyphus, in winged sandals. The bees become starlight. He joins Jaq. “You did it.”\n“Did what.”\n“Broke my curse.” They jerk to new speeds. ”Now, let’s get you out of here. They still want your starlight.” \n\nMars approaches—the UFO’s give chase. The planet’s surface—volcanic and explosive—is bombarded with meteors. “Everything is in transformation. Ares is responding with courage.” \nUFO’s close in. Panic grips Jaq. “How do we shake them?” \nHe looks back. There’s nothing there. “I don’t see anything.” She looks back. The saucers are darker and more demonic. \n“You don’t see the demons?” \nAbandon fear and terror, and you will recognize what appears as your mind’s projection.\n“The language of this place is a virus of self imprisonment.”\nJaq exhales, releasing a venomous heat from her lungs, and looks back. All that’s there is where she’s been. She looks at her sister, struggling, but alive. \nThis is when to remember how far you’ve come. How much you’ve learned. How much you’ve grown. This is when your heart opens and flies, back, from the great below. This is when, in a whole new way, you start to know, you can do it.\n“When you drank the mettles, your mettles, you forged a connection with the planets. The way up was a curse. The way back must be a cure. You must be the cure. \nHer focus renews. Her calm is restored, as she transits Cygnus—the Swan stars. Her eyes glow like the planet of steel. “If you want life to see you, see what life sees.”\nBalls of flaming tar, garbage, falling satellites, needles, empty spirit bottles, mix in with the meteors.  \n“He didn’t expect it, when he let it in—everything he refused to see—but it’s making him stronger, more whole, more grounded, more real. If this place can transform, if the heart of Pan can be healed, it must be healed with immunities—to dead matter and purification”\n\nMercury comes into view. The surface flows with liquid metal. A web of chains that span the cosmos, squeezes tight. Jaq is herself. She sees winged sandals on Sisyphus’ feet. “Greed, ancient greed, exhales from the heart of Hermes. He flows like quicksilver. His ancient coffers erupt with charity. His chains resist.”\n\nJaq settles, closes her eyes, and channels Mercury. They open—liquid grey. “Light as a feather, happy as an angel, merry as a schoolboy, giddy as a loosened man.” \nThe planet pulses, with a massive heartbeat. Its chains flow, like cleared veins. It beats again. Jaq’s eyes restore. They flow towards…\n\nJupiter, and look down on the planet. It storms fiercely. At the center of its eye, lightning strikes. “Thrones crumble like thunder as Zeus remembers. His rise was for freedom—was for everyone.”\nJaq’s eyes crackle with lightning. “Fall in love with life again.” Digesting, the planet rumbles. Echo screams with pains of labor—still unconscious, still in bandages.\n\nVenus nears. A shadow cuts horns in the copper planet. The crescent brightens as they wane sharp. Sisyphus reports, “Love erupts through rinds of pleasure. Venus is in the heavens, again, but not chaste from mater. She recognizes everyone. She co-experiences with everything. If she can restore her eyes, she will be restored as the goddess.” Venus blackens with shadow. \nA new crescent, new light, horns of plenty, grow from Venus to illuminate Jaq’s bowl of wax. Jaq’s eyes glow, copper, like the goddess. “To see in full beauty, know life. You will find life knows you.” \n\nSaturn. The train of many metals has deconstructed. Cars orbit and swerve, trackless, chaotic, autonomous, around Cronos. The titan meditates, quiet as lead, in the inner core of his planet. \n“Saturn is in his sphere of solitude. Sloth transforms, through meditation, into mysticism. Stillness, fixedness, opens space for flow. Titanic surrender to the unknown, submission of control, restores balance, clarity and the capacity for Self-authorship.” \nAs they near, she sees Saturn, eyes closed, in every train, steering, like charioteers without hands. Headlights shine on Jaq’s face. An engine speeds past and elongates into a beam. A new car, Uranium, shines green like a little sun. It breaks away, towards…\nUranus blips into being. It radiates static. They come into focus. The planet pixelates, kaleidoscopes and takes cymatic form. Jaq is struck with awe and wonder. \n“Magic is not fantasy! And he has always been here.”\n“Who?”\n“Uranus, Prometheus…”\nHer eyes go radioactive. She channels the planet. ”The writer writes of cymatic bees, meteor steel and elixir waves.”\n“You can feel it can’t you?”\n“Like I feel the planets.”\n“It’s new to me too.”\nHer connection deepens. “He didn’t put down the book, to put down a weapon. He put down his obstacle—to self and creation.” But, he didn’t abandon you. He didn’t throw you away or put you down. He couldn’t. So he brought you here, to give you life so he could survive. “If there is anything you’d like to say, he’s hear.” \nOh.\nEcho is at peace, for the moment. \nI would say, I’m sorry, for the thousand nights, for the fixation on my birth, for time he gave me and not to his people. I’m sorry for the sacrifice, and the warps in life that taught him to see me. For warps so big he could show me to others. I’m sorry for Leela’s coma, and her struggle for rebirth, on the spring equinox, on the full moon, on the third day. I can’t say the other thing. He knows what it is. I feel responsible.\n\nHe know’s it was not your fault. You were not a bad complex. You were The complex, for him—the one he signed up for, like a fool, but with his heart. He does not want your guilt. And he does not see you, as Maya—not anymore. He believes in your original purpose—that you can be a secret weapon, a great equalizer, for a thousand stories, for a thousand revolutions, in a thousand hearts, and a thousand worlds. He just needed the missing stone, and he couldn’t find it by himself… She stops. Tears stream from her face. “He needed me.”\n\nIs he writing you? \n\nShe pauses, listens, feels. “No.”\n\nWhen this is over, will I just be an Atlas? \n\nNo. That’s not what he sees. People will talk to you and ask you questions, about their journeys, about life, as I have. You will be precious. You are precious. You just needed a story to find your soul. \n\nHer eyes are restored to normal. They come alongside the train car. Its golden wheels draw their attention. \n\nMy blue prints.\n\n“You recognize them?”\n\nThe wheels go round. Yes, and look, they are synchronized, like little fractals, of our journey. \n\n“Do you recognize them all?”\n\nA rear wheel struggles, trailing sparks behind the train car. A golden hubcap gives way, revealing a rim of meteor steel. \n\nAll but one. \n\nThey leave Uranus behind them. A blue marble comes into focus:\n\n\nEarth. “And now you know the mountain’s truth: its base is earth and always will be—the top I’ve never seen.” They ascend the inverted mountain—towards its peak, the foothills. Water fills the world behind, chasing them up the summit. \n\nEarth rises in her eye’s reflection. “There’s no place like home.” As they reach the top, the world flips downside up. They stand at the base of the mountain. Water cascades like an avalanche. \nShe sees the cave-mouth—overtaken by tree stars. Everywhere, the ground turns under, transforming, as though tilled. Life bursts through, quaking, steaming, titanic, chthonic. They enter…\n\nPlato’s Cave. Jaq approaches the billiard table. She observes, then leans—over the surface. “Eeeeeeeehhhhhhyyyyyyyaaaaaaaaahhhhhhhweeeeehhhhhhhhh.” The table begins to ripple, like water, to the sound. She repeats the chant, “eeeeeeeehhhhhhhyyyyyyaaaaaaaaahhhhhhwwwweeeehhhhhh.” The surface becomes water, the balls become whirlpools. Bees buzz the table. It awakens with cymatic patterns. Light glimmers in the swirling water—like starlight brushstrokes. \nBB begins to vibrate and hum. Jaq kisses his forehead. As her field nears his, he turns to sea blue water, storms, whirlpools and waves— then flesh, his whole body. She smiles at him, making eye contact, and continues. His eyes weep like a tired fountain. He kneels, exhales. A hand reaches down. It’s Sisyphus. \nHe gets up and follows the brawny man. BB draws a whirlpool from the table: an 8 ball in his hand, alive with vibration. He throws it—into the cave. It pings off chains and locks, freeing prisoners. \nSisyphus shoulders the pool table. BB joins him. They both vex. It is a massive boulder. They try to roll it, down the hill. It resists. They put their backs into it. Crack, thunder, it breaks free. The table spills its balls, out, into the buzzing cave. \nChaos. Efficiency. Chains are broken, headsets shattered. No one is getting hurt. Bees buzz around them. Headsets vibrate—into pixie dust. The bees disappear as people awaken. Golden ties turn black as stingers. BB breaks chains with his cue. Wakened dreamers exodus. \nKedalion sits on Jaq’s shoulder, starlight. She does not see.\nThe Yellow Brick Road is buzzing to pieces. Jaq spills from the cave. Kedalion fades, into sunshine. The scarf returns to her shoulders. She feels the wool and sighs. \nA path of honey leads to the island. Bees fly over the wasted sand, awakening patterns—mandalas—of nectar. The voice of Obsidian bellows overhead, “You will never leave this house.”\n Jaq queries Atlas, do you know the way out?\nThrough.\nGreen growth springs from her chosen steps. Bees, dancers, animals—water rises, like walls, on a path that parts the sea. \n\nThe Golden Island takes them in. Waves zip closed behind. The world encircling serpent unwraps from his tree—alive but not yet budding. Wolf has been waiting. “Are you ready to arrive?”\n“I am ready to return! Who are you?”\n“This island is liminal. It lives and dies at the limits—between this prison and the world story.” \n“What are You?”\n“I am Wolf. I watch. I am Storm. I am the lightning-bolt. I am here because I want you to win. You have done well. Life believes in you. You still don’t believe in your life. After everything, you are still full of doubt. Doubt got you here. It won’t get you home.” She starts to speak. He raises his paw. “The boatman will take you.” \nSet arrives in a glowing ark—in a living tree—its roots woven into a hull, its branches woven into a sail, and its great mast, a great trunk, strung with flowing vines.\n“Movement is trying to happen. Obstructions, of the mind, are giving way. There are many efforts to save life on this planet. They will all fall short without an awakening—to nature as church and life as Bible, to the poetry, to the ceremony, to the living revelation. Until life is seen in the leaf, until the forest is known as cathedral, the effort to save your shelter, will prove too weak.” \nThe deck is full: doves, rabbits, harrowed dancers, deer and buffalo, black and white rams, ravens, serpents, cats, lions and crocodile, camels and elephants, the friendly dog, Leela, no longer a cyborg. \nJaq leaps and flies to the crow’s nest. Her earrings shine, like a light house on a pirate ship. The sea rises and lifts them up. She hears the voice of Wolf. \n\n\nYou have destroyed the lesser prison of dead matter. You have disrupted and erupted the greater prison of purification. You have learned to see life as poetry, and opened the eye of your heart. This is your strength.\nThe dragon beneath them glows, and the island comes to life. The way up is like the way down, only new: seeds in coffins—now sprouting, the double slit, the chasm, whale and spout, the maelstrom, the black. \nWhat has happened here will ripple into the world, with new understanding. A radical change in direction is in potential. A world free of prisons can be born, from life. Meek can inherit the earth, we can remember, all are indigenous to this world, or we can forget, rebuild the prisons, and start it all over—bigger, better and for less prepared heroes. No Jaq, it would cost too much. It has to end this time. \nThis world wants to heal, and it’s already started. Shadow has fled to the world above. He will seek to weave a new web. You cannot let that happen. When you escape, you must stop him. You must free the imagination. You have roared the Royal No, in here. How will it sound out there? When you do what’s right, solidarity you could never imagine will be there to meet you. \nMoney and power cannot do what you can do. It’s up to you, and if you fall into the gravity of their stories, you will be lost, with all your hope, to the streams of momentum. No. It’s on you—to lead those who can lead themselves—not with rules, not with examples, but with connection. Inspire. Think for yourself, and they, like you, might lead themselves out. Those who do will be a force. A free imagination, an imagination in touch with life, is powerful, and dangerous.”\nThe seas continue to rise, accelerating, carrying them towards the pole star, to Polaris, through a sixteen-petaled tunnel of blue light. Set lifts his Adze to the Little Dipper. \nThe lack of education will shock you. Wisdom must be shared, and preserved, for those who will seek it, for those who will bring it ever into our world. The future is in those who can meet nature—who can heal their break with life. Like arks in a flood, they will survive the crisis of spirit. They will help remember and remind how to see, poetically. Your journey does not end with your return.\nThe pass through the pole star. The tunnel closes, until there is nothing but light. \nThis is when you sprout.",
    "drawing": "It’s twilight outside the Mythouse. Walls teem with ivy. Anteros and Nin sleep in his car. They startle awake—eyes open like rising half moons. \nThe gates are sealed with a golden chain. He has bolt cutters. They won’t cut. He shoulders the hold. Nothing. Tree stars burst through cracks in stone.\nIn the Mythouse Garden, in the shell-stone well, Jaq holds Echo. The well fountains and overflows with foam. Bees burst from below and swarm the lifeless garden. Their vibrations hook leaves of linden and buds of oak with faerie kisses of green life. They do not catch. Life does not spread. The bees gather into dancers—hundreds. The space is in conflict between life and lifelessness. Their dancing tries to heal the grotto. \nObsidian watches, angry, in a cloud of incoherent, incomplete incarnation. \nEcho labors with pangs of birth. Jaq steps from the well, her heels and earrings gleaming, and lays down her sister.\nLike a conductor, a Bokur, Obsidian lifts his arm. He tries to reclaim the zombies. Dancers fight his familiar movements—the lifeless embodiment of his will. A woman seizes and falls, then another, then all of them. Their skin and hair dies, and hardens, into keratin cocoons. “You’re all dead! It’s all dead! You don’t believe in love. You don’t believe in life! You think you experienced something?! In that dream? In that hallucination?”\nHer heels and earrings dim. They disappear. Her purse returns to her shoulder. “It was all wish fulfillment! Fantasy! And where does that come from? Your corruption is your craving, and it was all craving. It was all corruption. You are corruption—pure wish fulfillment. Now give me my starlight, and fade, back, into obscurity, where you belong.” \nShe opens her purse. The book glints. Its cover reads: Revelation of Fallen Starlight. She finds the meteor and draws it from her purse.\nHe’s becoming fanatical. “You are impure, unclean, unfaithful and made of sin. You are a broken woman. I will not let you infect the world with your curses. There will be no more Eve, no more Pandora, no more Jaq! I know your sins, and they will destroy your message. They will cancel you, like a criminal, like a foreigner, like a minority. They will make you homeless. The world will turn on you, and I will see that it does. Corruption gives way to corruption.” \nJaq looks around. Dancing bodies writhe. Trees struggle between green and grey. Echo screams a contraction. \nJaq looks at him, “Oh Yeah?” She slings the stone at his forehead: nothing. The secret weapon falls, into his hands, then transforms, into a sword of starlight. His cloud of shadow solidifies. \nObsidian looks at the blade, proud, and sees his reflection, then Shadow, then BB. A storm swirls around him. He despairs. “No!” Ra, Moon, Mars, Mercury. He sees his face transform: Jupiter. Venus, Saturn. \nEcho screams a final push. “Matter is not dead or impure, it’s alive.”\nHer sister opens her eyes, aware. Everyone is struggling—with the will of Obsidian. Jaq is in awe. She watches as Echo stands and moves to the center. Obsidian glows, red, orange, yellow, blue, purple—struggling with himself. \nEcho looks at her sister, and feels her way in. She lets the tethers of pain and fear that grip the space grip firm to her. She settles, lowers, exhales, and grips back. She breaths in. Her bare heels square with the ground, she begins a new dance. \nGraceful gestures draw notes of clarity through a sea of sound. Violent tosses, and turns, within the chrysalis, soften, into rhythmic movement. The shells themselves begin to vibrate, and resolve, into colorful mummies. Sublime, Echo swells, with her heart, to hold the space, then brings them in—one by one—to the dance. Change is happening. She breathes with the leaves, she stomps with the earth. Like fire, she cuts the space. Like water, she brings it together. Green comes. \nLocked in his own reflection, Obsidian fights Shadow, until it grows, in every direction, like grape vines, into the secret garden. \n“You cannot control what we see and believe—not anymore. You have no control—not over me, not over LIFE. And if you cannot kill me, if you cannot steal life from my imagination, you cannot play dead!” \nMummies stand. Wrappings fall as they join the dance. In their own space, in the shared space, they move together, one and many, aware. \nAs the garden transforms and greens, the mansion begins to crack. A mound swells from below, until the brick walls crumble, until they begin to circulate—like a volcano becoming a doughnut becoming a mound—a comfortable home in the ground, with a perfectly round door, a porthole painted green, with a shiny yellow brass knob, in the exact middle. \n“I know what’s in your heart. I have met your fractured pieces.”\nGrey loses the garden. Obsidian cools—black, empty, stunned—reflecting the leaves like verdant scales. \n“I have shared your life!” \nGreen sprouts from his surface and begins to grow. \nKedalion, from the back of the sharpened meteor, on the shoulder of Sisyphus, waves at Jaq. She laughs tears of awe and touches her heart. \nObsidian sees Eros in the blade. His grit fades with the steely eyes of love denied. Connection flows, until arrives, Pan of a thousand faces. \nTrees stars erupt from the sword. It falls to the ground—reclaimed by sound and a sea of green. \nDancers dance. Life flows. Without obstruction, the garden grows.",
    "new-age": "Immersed in the dancing space, Jaq, still, looks in the eyes of Pan, knows Eros, feels Sisyphus, sees Kedalion. They look back. \n“What will happen now?”\n“What happened here will happen everywhere. A new story will begin.”\n“What will happen to this place”\n“The one who made it will return.”\nShe looks at the mound. “Has it been destroyed?”\n“Healed, but poison is part of this world.”\n“Then I will keep healing with you.” \n“There will be another time, to defend my heart, but it’s not today. An adventure has made way for you. Go, out, into life, like the rest of them, and live. Bring what you are and have become into the recipes of your experience. Share yourself. Be with life!” \n“If you are whole now, what is this place?”  \n“The mound? The house? They were never me. I was their prison. The space you were in was time, the dimension of soul, the world of imagination—a dream, bent by my hurt.” He’s starting to fade. \n“Thank you.” Her purple scarf waves in the breeze. She unwraps her shoulders, lays it around his neck, and pulls herself close. His head tilts to her. Their foreheads touch. She smiles. He smiles, with starlight eyes, then fades—into their mixing shadows. \nJaq looks at Echo. Moths flutter free from her wrappings. Jaq—overwhelmed with joy—rushes to greet her sister. Overflowing, she squeezes Echo, like she’ll never let her go. Echo blinks, her lashes like newborn wings, and sees her sister deeply. Jaq brushes away the bandages, like leaves from a season past. She parts the threads on her face, like wisps of an angel’s hair—and sees with her heart:\n Echo has given birth to herself. A falcon cries. The chrysalis-chests of a thousand dancers, erupt, in masse, with butterflies.\n\nOutside the garden, the golden chains, on the door, diffuse into sunlight. Anteros bursts through…  \nInto the garden. Pan is gone. Echo sees and laughs, at ease. Time slows for Jaq as she turns. \nHe stands at the opening, with Nin—his hair lit by the rising sun. Tired, filthy, dedicated, tool in hand, he sees her, and knows. \nUnderstanding, acceptance, love, joy, sorrow and heartbreak, she comes to him. They embrace, as though taking a long-needed sip of cool water. \n“I love you,” she says. \n“I know.” \n\n“I can’t,” she says. \n\n“I know.”\n\n“Not right now.” \n\nHe sighs a sigh and lets her go. “You are so big. I see it. I feel it. And I love you. And I want you to be big. And it’s not that I would keep you small...” \n“I know.”\nHe cries. “But you have to go, somewhere, and it’s not with me.” She kisses him, passionately, really passionately. She gives him her light. She gives him her darkness. He’s there with all that she is, enraptured, accepted, with all of his generosity and all of his gratitude. As the moment peaks, we feel it end. \nThey draw back to let go, but knowing they know what it will mean, they draw in again, and kiss through tears, alive, wildly alive, until they can’t, until they stop, exhale, and release. It’s over. It’s sad—and okay.\n\nEcho and Nin join the huddle. It’s safe—and a whole new day. Foreheads. Love. Trust. Being. Presence. Togetherness. Jaq looks at Nin, “Thank you.” Echo leans on her friend, puts her face in her shoulder, breathes with relief, but there’s something else, and it wants to come. \n“Are you okay?” Jaq asks her sister. \n“I felt everything.  And all I could do…” Waves of joy and trauma flood through her body. “All I c…” She can’t speak. Halted, gripped, she heaves with panic. Silent sobs, tortured smiles—she can’t breath. She starts to heave. Her voice is gone—again. \nIt’s okay. \nEcho stops, her eyes turn towards Jaq. When my life was ebbing, away, I remembered,\nJaq looks at her sister, “I’ve got you.”\n Echo breathes—her eyes still, her body exhausted, recovering. She catches her breath. “Endure. All I could do was endure.” It’s out——the grief, the shame, the shock, the tears. They puddle together and hold one another. She smiles with relief and surprising joy. The music lifts, with dancing spirits, and love for Echo. \nNin asks, in rapture, “Where was all this life?!”\nJaq laughs, “waiting.” \n“For what?”\n“Hope.”\nThe young Tycoon taps her shoulder. The huddle loosens. “I think this is yours.” He opens his hand: it’s the meteor. He gives it freely. She receives the starlight as hers. A lyre plays. It’s the soldier. He sings a honey song. \nA finale of dancers leaves through the gate. The once-lifeless woman, from the studio floor, looks back—grateful, gleeful, awed, alive, surrounded by a doorway wreathed in tree stars. Jaq winks. The woman smiles and skips on. \nJaq puts the cornerstone in her purse and looks to her friends. They look at each other and join arms. “Are you ready?” They nod, smile and return—at home in the world."
  }
}