[
  {
    "id": "jesus",
    "name": "Jesus of Steel",
    "stages": {
      "golden-age": "Jesus is often depicted as a champion of the oppressed, the enslaved, and the impoverished. His teachings challenge the societal pursuit of wealth and purity, advocating instead for love, compassion, and equality among all individuals, regardless of their social standing. This echoes the mythological representation of steel warriors as those who rise against tyranny and challenge the power structures of the status quo.\n\nJesus Christ embodies the archetype of the revolutionary, akin to the Hittite infant of steel who foreshadowed the transformative Iron Revolution. His teachings challenged the established religious and political orders, mirroring the profound societal impact of both Christianity and the advent of the Iron Age.\n\nMoreover, Jesus frequently defied conventions and broke societal rules, such as healing on the Sabbath. His actions, driven by compassion and free-thinking, emphasized the virtue of challenging the status quo for the greater good. This rebellious quality aligns with the mythological portrayal of steel heroes as agents of change who disrupt oppressive systems.",
      "falling-star": "One can discern parallels between the nativity of Christ and the steel birth narratives of figures such as Sosruquo and Ayyanar, who are said to emerge wherever an arrow lands. Similarly, the Star of Bethlehem, a celestial phenomenon that guided the Magi to the birthplace of Jesus, signifies a 'new light in the sky.' These elements evoke a connection between the divine birth narratives and the miraculous circumstances surrounding Jesus' arrival.\n\nJesus, was born where a light in the sky pointed.\n\nThe falling star that pointed towards the place he arrived in this world repeats the meteor-motif so common with children who change the world—like Christ.",
      "impact-crater": "In both sets of narratives, the fathers are shepherds, and the conceptions are considered immaculate. This echoes the story of Satanaya, whose child was said to be conceived when its father ejaculated onto a rock. These parallels highlight the extraordinary nature of Jesus' birth and position him within a broader mythological framework.\n\nIs there a rock or head stone associated with Christ? One might look to the stone that is rolled away for his resurrection, Yet, central to Christ's narrative is another metaphorical rock. Upon this rock, Christ declares to Peter, he would establish his church, thereby symbolizing the foundation of His legacy. This declaration followed Peter's acknowledgment of Jesus as the Son of God, aligning the image of Christ, the progeny of the shepherd deity, with the rock. The narrative mirrors that of the Nart Sagas, where the Shepherd's child is associated with the rock.\n\nThe pivotal setting for this narrative is Mt. Hebron. Biblically, this is the location where angels descended, mating with human women to birth the Nephilim and consequently leading to the downfall of civilization. These angels also introduced metallurgy, particularly steel. Thus, one can view Mt. Hebron as a remnant, among other things, of the Iron Age revolution, serving as a monument to this epoch. The rock at Christianity's core could be seen as commemorating this Iron Age revolution, symbolizing an uprising against the oppressive order it replaced.\n\nThe contemporary context of this location shifted to the sacrificial offerings of goats to Pan. Situated at the source of the river Jordan, flowing from beneath the mountain, it was perceived by the Mediterranean Pagans as a portal to Hades. It had also become the site of the highest number of goat sacrifices to Pan globally. Consequently, the stone upon which Christ intended to build His church has been interpreted as a revolt against Pan, the goat-legged deity that shaped the image of the devil, his bloody sacrifices, and the pagan world.\n\nMoreover, the name Peter itself signifies 'stone.' Given that Peter was the inaugural pope, Jesus could indeed have foreseen the church's construction upon Peter. However, considering the mythological perspective, these events hold a concrete reality. The cornerstone of Christianity is intricately woven through associations between the stone and the Son of God's image, the shepherd, the convergence of heaven and earth, rebellion against oppression, and Peter – the man symbolized as the stone.\n\nEveryone sees the christ-child motif in this figure: son of a father from the heavens who came to earth and became a savior.",
      "forge": "In Christian mythology, the narrative of Jesus Christ abounds with profound symbolism, including the recurring motif of steel—a material renowned for its transformative properties and enduring strength. Exploring the interplay between steel and key episodes in Christ's life enriches our understanding of the complex tapestry of Christian mythology.\n\nIt is not just Jesus and heroic saviors who walk and talk like meteor steel, we also see it in the fallen angels.",
      "quenching": "The act of baptism in Christian tradition finds resonance with the process of quenching in metallurgy. Quenching involves submerging heated steel into water to harden it, making it durable and resilient. Likewise, baptism symbolizes the spiritual rebirth and purification of an individual, endowing them with spiritual strength and everlasting resilience. The theme of rebirth, immortality, and the emergence of a new self resonates with the mythological archetype of steel warriors and war bands.",
      "integration": "Despite the patriarchal adaptations that Christianity underwent over time, the relationship between Jesus and feminine figures such as his mother, Mary, and Mary Magdalene, showcases a positive affirmation of the feminine—an attribute shared by many steel heroes. The support Jesus received from widows further reinforces this inclusive approach and highlights the significance of feminine influence.\n\nFinally, the transition from the singular divine entity in Judaism to the pluralistic Holy Trinity in Christianity reflects an embrace of plurality and inclusivity. The nature of the Holy Spirit, with its emphasis on eminence and wholeness, further expands this paradigm of multiplicity within the Christian mythos.",
      "drawing": "The arrival moment in the Christian story is the resurrection, marked by the rolling away of the stone from the tomb. The sealed rock that enclosed death is opened, and Christ emerges into a new state of being. This moment mirrors the drawing of the weapon from stone: what was enclosed and hidden is revealed, and a new reality begins. The resurrection becomes the decisive emergence that transforms the world, the point at which the story moves from sacrifice and trial into the proclamation of a new age.",
      "new-age": "The narrative of Jesus Christ is imbued with myriad motifs and parallels that echo the transformative qualities and enduring strength of steel. This exploration elucidates the deep, mythological connections between key episodes of Christ's life and steel-related narratives, contributing to a richer understanding of Christian mythology. From the celestial guiding star at his birth, to the immaculate conception and his baptism akin to steel quenching, these elements resonate within a broader framework of myths. Jesus, the revolutionary figure who defies conventions, emerges as a steel hero challenging oppressive orders for the greater good. His affirmative relationships with feminine figures and his championship of the oppressed underscore his inclusive stance, resonating with the mythological steel heroes. The plurality inherent in the Christian Holy Trinity further expands this motif of inclusivity. The associations of the rock—symbolizing foundation, revolution, and Peter—with Jesus provide a metaphorical cornerstone for Christianity to match the many head stones from steel inspired myths.\n\nMeteor steel came down from the heavens to arm the overthrow of a tyrannical world, and the messianic age to which it led was called 'the age of iron.'"
    }
  },
  {
    "id": "buddha",
    "name": "Buddha Steel",
    "stages": {
      "golden-age": "As with any hero of steel who challenges status quo hierarchy, the Buddha challenged the notion that only the Brahmin could achieve Moksha in the same way Christ would challenge the exclusive access to God claimed by the priesthood when he ripped the veil between humanity and the holy of holies. According the the Buddha, anyone in any life at any level of the caste system can break free to achieve nirvana, moksha and enlightenment. Call it the Siddarthan Dream. In this way, he was a champion of the lower classes as opposed to a representative of wealth or royalty. That he left his wealth and titles behind was a sign to pursue the noble path reaffirms his commitment to virtue over wealth.",
      "falling-star": "The Buddha was born of the warrior class, and as with Sosruquo, Vulcan and other figures of steel, he is immaculately conceived. As the story goes, his mother dreams of a grey elephant with extra tusks entering into her side. Without reducing the scene to that of a meteor strike, we find its pattern mimed in the narrative. The name of his mother, Maya, refers to the (illusory material) world in which humans exist. Firstly, the elephant is presented with multiple tusks, separating our understanding of the elephant from something simple and literal. We then recognize its grey hard skin as shared with the meteor and see the possibility that the description of a multi-tusked elephant, known for its ability to charge, may have been a relatable description of a large meteor. For example, the Ahnighito meteorite used by the Inuit to make harpoon tips and other tools for generations still weighs thirty-four tons. When accounting for the importance of including associations related to the elephant and tusk, like its relationship with the moon, the nearness of the physical description to a large meteor comes nearer. Let it be a slogan: myths should never be reduced.",
      "impact-crater": "The Buddha saw the plowing to lose his innocence, this was the inciting incident, but it is the same as the inciting incident of a meteor. The eagle swooping down into the crater dividing the earth for the penetration of a seed completes the image of the falling meteor.",
      "forge": "Until the Buddha awakened, the Hindu tradition around him was committed to asceticism. Fire worship was prominent. He pursued the path of asceticism to the point of emaciation. He attempted to transcend the influence of his body. This period of extreme ascetic practice represents the heated phase of his transformation before the turning toward the middle way.",
      "quenching": "He attempted to transcend the influence of his body. He then drank milk from a golden cup, shocking his peers and leading them to believe he had forsaken the ascetic's path. This was central to the Buddha's new understanding however. He represents a re-integration with the material and the feminine.",
      "integration": "Not only did he drink from the bowl, given to him by a girl, but he also, when challenged by Mara on his right to sit in the center of the world, he reached down and touched the earth. When he differed to the earth, it trembled to express his right to be there. It would not have done so if he was still an ascetic, if he was still focused on purity, if he was still refusing to integrate with the feminine.\n\nThe Buddha reaches down to touch the earth when he is challenged for his right to sit in the center of the world, which is confirmed by a tremble from the great mother. This repeats the moment he accepts a bowl of rice and milk from a young woman. These enlightening moments represent the importance of reintegration with the feminine and a recognition that matter is not to be reduced to that which corrupts spirit (or compromises pattern).\n\nThe concept of nirvana, associated with blowing out the inner fire, parallels the transformative nature of steel quenching, leading to the Buddha's timeless liberation.",
      "drawing": "The Buddha's awakening marks the emergence of a new kind of consciousness into the world. After attaining enlightenment, he returns to his homeland and is confronted with an imminent war between the Sakyas and the Koliyas over water rights. Rather than allow the conflict to erupt, he intervenes and persuades both sides to abandon the violence. The first public expression of his awakening is therefore not conquest but the prevention of war. The consciousness he brings into the world manifests immediately as peacemaking, demonstrating that the transformation he attained is meant to reshape human society, beginning with peace in his own home.",
      "new-age": "Exploring the mythology surrounding Buddha reveals intriguing connections to steel motifs and symbolic associations. The story of Buddha's conception, marked by the dream of a multi-tusked elephant entering his mother's side, parallels the symbolism of meteoric arrival seen in other steel-related narratives. The moment of the Buddha's loss of innocence, observing the plow parting the earth like a meteor, signifies a disruption of his youth and an awareness of mortality. The Buddha's pursuit of the middle way rejects asceticism and represents an integration with the material and feminine aspects of existence. The act of quenching, symbolized by placing a bowl into the water and it floating upstream, holds profound significance, reflecting the paradoxical liberation and enlightenment attained through the integration with matter. The concept of nirvana, associated with blowing out the inner fire, parallels the transformative nature of steel quenching, leading to the Buddha's timeless liberation. His inclusion of women in the spiritual community challenges gender norms, while his antihierarchical stance affirms that anyone, regardless of caste or social standing, can achieve enlightenment. Thus, the Buddha emerges as a figure embodying virtues, rebellion against the status quo, and a commitment to compassion and virtue over worldly attachments."
    }
  },
  {
    "id": "monkeyking",
    "name": "The Monkey King",
    "stages": {
      "golden-age": "In the sprawling tapestry of Chinese mythology, few figures shine as brightly as Sun Wukong, the Monkey King. His narrative, as recorded in the classic novel Journey to the West, provides a compelling Chinese example of how the meteor-steel motif appears within the global heroic tradition. Sun Wukong is inseparable from his weapon, the Ruyi Jingu Bang—an iron staff whose uncanny ability to change size and weight symbolizes not only the Monkey King's strength but also his adaptability and fluid nature. It acts as an extension of his character, much as meteor steel can be seen as a divine extension of the hero in various global myths. Like many steel heroes, Sun Wukong emerges in opposition to heavenly hierarchy. His role as an antiheroic challenger of hierarchical purity resonates with the rebellious character of iron against gold. His defiance of the celestial court and his initial selfish motives align him with an unconventional heroic model: neither purely noble nor wholly ignoble, but complex and disruptive. In the mythology of Heaven, this rebellion unfolds under the rule of the Jade Emperor.",
      "falling-star": "His origin carries the signature of heavenly descent. The celestial connection of Sun Wukong's birth mirrors the otherworldly origins associated with meteor steel. His ability to leap vast distances and fly on clouds further connects him to this celestial imagery, embodying motion between heaven and earth.",
      "impact-crater": "That heavenly connection becomes literal in his birth. Sun Wukong is born from a stone that absorbed the essence of Heaven and Earth, fusing the celestial and the terrestrial. This origin echoes the symbolic pattern of heavenly material embedded in the earth. In motif form, the Monkey King appears alongside themes of the golden tyrant, the iron weapon, and birth from stone.",
      "forge": "Like many heroes in this tradition, Sun Wukong undergoes a trial by fire. In Journey to the West, after his rebellion in Heaven, the gods attempt to execute him but fail. Laozi then proposes placing him inside the Eight Trigrams Furnace so that his body can be broken down and refined by sacred fire. Sun Wukong remains inside the furnace for forty-nine days while the flames are stoked to reduce him to ash. Instead of destroying him, the fire strengthens him. When the furnace is opened, he emerges alive, his body unharmed and his eyes transformed into what later traditions call \"fiery golden eyes.\" After leaving the furnace, he is stronger than before and resumes his defiance of Heaven.",
      "quenching": "The Monkey King's weapon also carries a strong association with water. His iron staff is said to have originated from the depths of the Eastern Sea Dragon Palace, linking the weapon directly to the ocean.",
      "integration": "His powers continue to expand in unusual ways, including the ability to pluck out a hair and become invisible.",
      "drawing": "The iron staff itself remains central: the Monkey King is repeatedly identified with the iron bar weapon he wields.",
      "new-age": "Taken together, Sun Wukong provides a vivid illustration of the meteor-steel hero within the Chinese cultural context. His story reflects themes of transformation, rebellion, strength, and the connection between heaven and earth. As part of the global heroic tradition, the Monkey King stands alongside other figures who carry the recurring motifs of meteor steel."
    }
  },
  {
    "id": "ayyanar",
    "name": "Ayyanar",
    "stages": {
      "golden-age": "Interestingly, Ayyanar is also a deity that supports an abandonment of the caste system. His figure did not support the system of purification. We find this iron-related deity on the side of those who would overthrow tyranny, like Prometheus and the Iron Age Indo-Europeans. From Sosruquo to the Hindu Ayyanar to Jesus, we find special children on earth where a heavenly light has pointed, or where an arrow has landed.",
      "falling-star": "The Dravidian child of steel, Ayyanar, whose name means \"precious stone,\" was also found at the landing place of an arrow from the heavens, born of stone and associated with a single weakness. He is a Dravidian deity who arrives on earth as an arrow from heaven and is born from a stone found where that arrow landed. Ayyanar is also known as Sasta, a name also used for Buddha. Like Sosruquo, he is blue or blackish. In the Lakota-Sioux figure of Fallen Star, we find another association of a divine child with a fallen star. In this case, his immortality is lost when the star is removed, repeating the association of starlight with the immortal aspect of self and its differentiation from the mortal body. As seen in the ascetic figure of Ayyanar, the ascetic is dedicated to purifying a relationship with an immortal seed by reducing the dimming effects of mortal materiality.",
      "impact-crater": "Ayyanar is born from stone. His stone is associated with a meteor, and he is consistently described as born from stone. The crater motif also appears in the association of the love arrow and first plowing. From stone, Ayyanar emerges from the meteor stone while the Buddha emerges from mother and elephant.",
      "forge": "The association of the meteor with asceticism begins to clarify in the figure of Ayyanar, whose name means \"precious stone.\" The path from meteor stone to asceticism is direct when we see the association of Ayyanar with the Yogapatta. He is clearly a man of steel from a meteorite, he is weak at the knees like Sosruquo, and his single weakness is directly connected with an ascetic weakness. When we continue to look deeper into the metaphors associated with iron that relate to ascetic philosophies, we begin to ask ourselves what we associate with the corrupting. From Greek to Hebrew mythology we find an association of matter with mother and pattern with father. The ascetic spiritualities that pursue purification of spirit from the corruption of body are pursuing purification of spirit from matter. In the meteor we find the stone to be the vessel of the elixir, and we find iron to be strongest and least corruptible when mixed with mater.",
      "quenching": "One of the key features of a pilgrimage to worship Ayyanar is the plunging of the pilgrim in a river. This is associated with a ritual in which an ascetic is given their Yogapatta following this quenching. Ayyanar statues are dunked in water, and this is also done with the Buddha. The golden bowl appears in this quenching tradition.",
      "integration": "The Yogapatta is a strap that wraps around the knees and waist to take pressure off the knees and to make the meditating body firm to support ascetic efforts. This device is designed to protect the meditator from the major physical weakness that emerges when one attempts to meditate: the knees. This single weakness to which we attend after ceremonial quenching is the key physical weakness of the ascetic.",
      "drawing": "Enlightenment is associated with imperviousness.",
      "new-age": "Buddhism is associated with the Iron Age."
    }
  },
  {
    "id": "sigurd",
    "name": "Sigurd / Siegfried",
    "stages": {
      "golden-age": "Sigurd and Siegfried stand within a world defined by gold, cursed wealth, and tyrannical family control. The gold ring represents gold, curse, power, and wealth, and it remains a memory of the struggle with the golden ethic. The golden tapestry itself becomes the setting of downfall, and the warrior Attila defeats the wealthy Burgundians and Rome, suggesting that Rome also fell because of its love of the dragon gold and ring. By then, Roman elites did not fight their own wars, just as the Burgundians had Siegfried fight for them. This is a world of toxic and tyrannical family control under the rule of the golden tyrant.",
      "falling-star": "Sigurd is associated with invisibility and unusual parentage. In the tale of Siegfried, he embodies the divine essence but is perceived in the earthly guise of Gunnar.",
      "impact-crater": "The crater motif appears repeatedly in the story. The sword splits the anvil in half, showing the cleaving and cratering power now turned against the anvil itself. The crater structure appears again when Sigurd kills the dragon from a ditch, and the critical moment in which he stabs the dragon takes place while he stands within this ditch, evoking the crater.",
      "forge": "Siegfried is steeped in steel motifs. Siegfried is raised in seclusion by Mime, a dwarf associated with metallurgy and the forge. Sigurd is raised by Reginn, an iron worker and the brother of the dragon from which the dragon blood comes. The sword Gram is a broken sword like Aragorn's and the one the royal family keeps, but it is also an expression of forge welding. This forge welding represents a greater skill than making the original sword. Like Sosruquo and many others, it is his father's sword.",
      "quenching": "Sigurd is quenched in dragon's blood. Blood quenching appears across the stories, and Sigurd's dragon blood is directly associated with this motif. Sigurd stands among the figures who are quenched, bathed, or baptized, including Jesus, Sosruquo, Sigurd, Cu Chulainn, and Wolverine.",
      "integration": "After exposure to the dragon's blood, Sigurd gains the ability to hear animals, recalling the shamanic motif and the white snake story that inverts the idea that animals stopped speaking with humans after the snake. He also possesses a special horse, like the Narts, showing the closeness between the hero and the horse.",
      "drawing": "Sigurd and Thor are described as impervious, and the hammer is impervious. The leaf weak spot appears in the older story of Sigurd, where a leaf covers the place untouched by dragon blood. The same can be said about the single weakness of Siegfried and the dragon blood of invincibility. The hero's weak spot becomes the weak spot of steel, seen in later poeticized stories of Achilles and Sigurd. Sigurd joins Sosruquo, Achilles, and Jason among the heroes marked by a single weakness.",
      "new-age": "The story culminates in Ragnarok, where the golden age is brought down and a new world emerges. The prominence of Siegfried helped bring Norse mythological figures to the forefront of German cultural consciousness, and Tolkien later echoed elements of the Volsunga Saga and the Nibelungenlied, with Aragorn paralleling the Germanic hero Siegfried and the Norse hero Sigurd."
    }
  },
  {
    "id": "lugh",
    "name": "Lugh",
    "stages": {
      "golden-age": "In the Second Battle of Mag Tuired, Ireland is ruled by the Fomorians, oppressive beings who demand tribute, tax the harvest, and kill Lugh's father Cian. Lugh arrives at the court of Tara and demands entry, repeatedly refused unless he possesses a unique skill. He lists many skills—smith, warrior, harpist, poet—and is finally admitted as Samildánach, the master of all arts. He ultimately leads the Tuatha Dé Danann in overthrowing the tyrant Balor and the oppressive regime.",
      "falling-star": "Lugh is strongly associated with light, brightness, and the sun, and his festival Lughnasadh celebrates the late summer sun and harvest. While there is no myth of falling star or heavenly descent, he stands as a divine light figure whose presence represents a new light entering the world.",
      "impact-crater": "Lugh kills the tyrant Balor using a projectile stone. In the myth, he slings a stone through Balor's destructive eye, defeating the oppressive king. The stone projectile becomes the defining image of the moment the tyrant falls.",
      "forge": "Lugh's identity as Samildánach, master of all arts, includes the skills of the smith and warrior. He represents the union of craft, skill, and martial power. Lug turns red hot with anger as a natural physiological response. This is when he announces at a feast the murderers of his father Cian.",
      "quenching": "",
      "integration": "Lugh's mastery of many arts represents the refinement of skill and the perfection of craft.",
      "drawing": "Lugh's defining weapon is the projectile stone, used to kill Balor. The sling stone becomes the decisive weapon that brings down the tyrant.",
      "new-age": "The defeat of Balor and the Fomorians marks the overthrow of an oppressive order and the beginning of a new world under the Tuatha Dé Danann."
    }
  },
  {
    "id": "cuchulainn",
    "name": "Cú Chulainn",
    "stages": {
      "golden-age": "Cú Chulainn is a hero who repeatedly operates outside social order and hierarchy. As a child warrior, he protects Ulster single-handedly while the adult warriors are incapacitated, placing him outside the normal structures of power and authority.",
      "falling-star": "Cú Chulainn is the son of Lugh, a god associated with light and brightness, placing him within a divine heroic lineage.",
      "impact-crater": "",
      "forge": "There's some evidence for Celtic. Cú Chulainn is called the frenzied one in one of his tales and is in a heated frenzy in another.",
      "quenching": "When he returns from his exploits, Cú Chulainn has to be dunked to cool off. Celtic Cú Chulainn, when he comes back from his rage, is dunked in three vats of water, and is rendered, first stunned by the vision of 50 naked women. And then they grab him and dunk him in the water. Steel has to be tempered. It has to be rendered hard through various degrees of heating and immersion to strengthen it. This makes it dark. There are scales of darkness that will tell you how things have been quenched. There was always going to be a spot that is not quenched, because you have got to hold it somehow. This darkness is seen in the figures of Cu Chulain and Sosruquo, who goes through a process of heating and cooling in the smithy.",
      "integration": "The process of heating and cooling appears again in the description of steel being tempered and darkened.",
      "drawing": "Cú Chulainn wields the Gáe Bolga, a barbed spear that becomes unstoppable once released.",
      "new-age": "Cú Chulainn stands as the great warrior of the Ulster Cycle."
    }
  },
  {
    "id": "ironhans",
    "name": "Iron Hans",
    "stages": {
      "golden-age": "Iron Hans begins in a golden royal setting in which the prince's golden sword symbolizes obedience.",
      "falling-star": "The story includes a meteor motif associated with Iron Hans.",
      "impact-crater": "Iron Hans is associated with a crater motif through the pond where he is found, and he is also associated with being from stone.",
      "forge": "Iron Hans is the wild, iron-linked man who dwells in the woods and represents the untamed nature of masculinity. His narrative follows the evolution of a boy into a man under Iron Hans's guidance, emphasizing rites of passage, mentorship, and the realization of inherent strength. The motif of iron underscores the raw, unyielding force of the wild man archetype and embodies the trials and challenges that young men must confront and integrate to achieve mature masculinity. His story stands within the broader exploration of steel and iron motifs in narratives of maturing masculinity.",
      "quenching": "Iron Hans is connected to quenching through being found in the pond and through the golden ring or key found in the well.",
      "integration": "The narrative represents the journey from youth to maturity and highlights how metal symbolism reflects masculine growth, challenge, and sacrifice across cultures.",
      "drawing": "The story includes a weak spot motif, and Iron Hans is associated with imperviousness through steel skin and the impervious trainee. The story also includes an invisibility cloak.",
      "new-age": "At the end of the story, the boy completes the journey from youth to maturity under Iron Hans's guidance. The narrative culminates in the realization of inherent strength and the integration of the trials and challenges that must be confronted to achieve mature masculinity. The journey that began with the wild, iron-linked man in the woods resolves in a transformed identity and a new reality shaped by the completed passage into adulthood."
    }
  },
  {
    "id": "enkidu",
    "name": "Enkidu & Gilgamesh",
    "stages": {
      "golden-age": "The challenge of Gilgamesh by the strength of Enkidu, described as heavenly stone, may represent a mythically imagined challenge by this metal long before it could even be used. Enkidu emerges as a counterbalance to the tyranny of Gilgamesh at the height of early civilization — a force from the wild periphery responding to imperial power. With Enkidu, it is the time before meteor steel was useful, yet a time when it was already recognized as strong and powerful.",
      "falling-star": "Enkidu is described over and over as \"mighty as a rock from the sky\" after he is made of clay that is pinched off and \"thrown down\" to the steppes. \"My father, there was a man came by the water-hole. Mightiest in the land, strength he possesses, his strength is as mighty as a rock from the sky.\" The association of clay thrown down from above with celestial origins reflects a deep human connection to the cosmos.",
      "impact-crater": "\"The goddess Aruru… took a pinch of clay, threw it down in the wild. In the wild she created Enkidu, the hero, offspring of silence, knit strong by Ninurta.\" Creation from clay directly ties Enkidu to the earth while simultaneously linking him to the heavens. In Sumerian mythology, humans are sometimes said to be created from clay and divine essence, and the association with lapis lazuli introduces the dual nature of being earthly and touched by the divine. Lapis lazuli, with its deep blue color and golden flecks, evokes the night sky and reinforces the celestial symbolism of stones. Enkidu, created during an \"age of clay,\" represents an era where the connection between the terrestrial and celestial was symbolized by stones like lapis lazuli.",
      "forge": "\"In the wild she created Enkidu, the hero, offspring of silence.\" \"All his body is matted with hair… he bears long tresses like those of a woman.\" \"Coated in hair like the god of the animals, with the gazelles he grazes on grasses, joining the throng with the game at the water-hole.\" The wandering of Enkidu becomes \"the wandering of the planets — why do you wander Enkidu, why are you erratic with the current paradigm.\" \"Remove their hair — like Enkidu.\" The wild man archetype appears as a figure before civilization.",
      "quenching": "\"For six days and seven nights Enkidu was erect, as he coupled with Shamhat.\" This encounter becomes a symbolic moment of transformation, the sex with a woman appearing as the symbolic quenching of a sword and the reduction of battle frenzy in later stories. Later in the epic, Gilgamesh descends beneath the water to retrieve the flower of immortality, and the act of retrieving immortality itself becomes a descent under the water.",
      "integration": "After the great journey, Gilgamesh enters a phase of reflection and return, dreaming, remembering, and ultimately recording the story in stone. The return becomes the reflective phase of the journey, culminating in the writing of the story itself in stone.",
      "drawing": "The delivery of the stone as a story becomes the act that represents immortality, as Gilgamesh's story written in stone becomes his lasting immortality.",
      "new-age": "\"You are handsome, Enkidu, you are just like a god! Why with the beasts do you wander the wild?\" Enkidu's narrative arc—from a wild man living with animals to a civilized human after his encounter with Shamhat and his friendship with Gilgamesh—reflects a journey of self-discovery and transformation. This represents the emergence of a new age shaped by story, memory, and civilization."
    }
  },
  {
    "id": "ullikummi",
    "name": "Ullikummi (Hittite)",
    "stages": {
      "golden-age": "Hittite metallurgy was advanced, and, despite limited use, evidence points towards their ability to work iron. If the archaeologists have hit a vein, we should see iron in their myths. And if there is a relationship between the concurrent rise of iron and Indo-European civilizations, we might expect unique resonance between Hittite and Indo-European iron motifs. Upon investigation, we came across the birth of Ullikummi. Kumarbi, father of the gods… against the Storm-God a rebel he raises… The chieftain deity was a storm god, and when it is prophesied that this child will overthrow the storm god, this becomes a prophecy about the fall of what was at the time active leadership — a fall that would go on to occur with the rise of iron.",
      "falling-star": "Meteors have historically been described as stones, and stories about heroes or warriors created from stone encode details that point toward meteor steel, like Ullikummi, the son of Kumarbi.",
      "impact-crater": "Kumarbi's Son – Born from Stone. Into (thy) hand a staff take… now go… into the waters… when the middle night watch came… the stone… and they brought him to birth… the Rock away… Kumarbi's son… They brought him to birth, and the fate-goddesses and mother goddesses lifted the child… on Kumarbi's knees they placed him. The father of Ullikummi flows his manhood into the mother and rock that would bear his child. We mostly know him as a character made from stone, and the image of both a warrior and a blade drawn from stone emerges from this birth. Out of the body like a blade he sprang.",
      "forge": "Ullikummi is not forged by smiths, but he is struck, attacked, and worked like an indestructible material. Created as a living weapon raised to overthrow the Storm God, he grows toward heaven and becomes the target of repeated attacks by the gods. The Storm God gathers the divine host and goes to war against him, striking him with storms and weapons, yet these blows fail. Ullikummi remains invulnerable while attached to the stone foundation from which he grows. Only when the gods retrieve the ancient cutting tool used to separate heaven and earth — a primordial blade belonging to the oldest gods — can he be cut loose from that foundation. Once severed from the stone base, he becomes vulnerable and can be defeated.",
      "quenching": "The child is repeatedly described as being brought to birth \"in the waters,\" and the final image presents the sword in water. Ullikummi is repeatedly described as a blade brought to birth in the waters, and parallels to the birth of Sosruquo are striking.",
      "integration": "",
      "drawing": "He is repeatedly described as both a warrior and a blade drawn from stone. What is the child that truly overthrew the world order? Steel. This is the story about the iron apocalypse before the iron apocalypse came. The Hymn to Ullikummi is dated to the century prior to the Hittite and Bronze Age collapse. This is a story born out of the early discovery of iron and the accurate prediction that it would bring about an apocalypse.",
      "new-age": "When we look at the mythology of the Hittites, who seem to have had steel technology before their peers, we find a story of a \"blade\" made of \"stone\" who is destined to challenge the divine hierarchy and bring about an apocalypse. In the story, which was written some centuries before the Bronze Age collapse, this world ending threat is thwarted, but eventually, the Hittites fell, Iron technology proliferated, and, in concert with a number of other factors, the Bronze Age collapsed. The parallel to modern times is haunting. We all know that if Russia collapses, nuclear proliferation will be a nightmare, and it could bring about the end of the world. We write stories about this almost happening. It seems that the Hittites did as well, only the world ending weapon of the time was iron. This was before they and the Bronze Age collapsed."
    }
  },
  {
    "id": "mher",
    "name": "Mher",
    "stages": {
      "golden-age": "In the Armenian epic, Mher cannot live in the normal human world because it has become corrupt and unjust. He stands as a heroic figure who no longer fits the moral condition of the world around him, and this alienation from the existing order marks the starting point of his story.",
      "falling-star": "Mher is described with radiant, fiery imagery and rides a blazing horse, giving him strong solar and celestial associations even though he is not a literal falling-star hero.",
      "impact-crater": "At the end of the epic, Mher rides to a rock mountain that opens to receive him. He rides inside, and the stone closes behind him. He becomes a hero sealed inside the mountain, waiting within the rock itself.",
      "forge": "Mher is known for uncontrollable rage and destructive strength. His overwhelming battle fury mirrors the heated hero motif that requires cooling and restraint.",
      "quenching": "The Armenian hero Mher has to be dunked in seven vats of water to cool him.",
      "integration": "His withdrawal from the world represents a pause and suspension, a waiting period between ages.",
      "drawing": "Mher is a mounted warrior hero equipped with sword, mace, and full war gear.",
      "new-age": "Mher remains sealed in the mountain until the world becomes just again, waiting to return at the end of the age to restore order."
    }
  },
  {
    "id": "arthur",
    "name": "King Arthur",
    "stages": {
      "golden-age": "",
      "falling-star": "When we see a light from the heavens come down as a stone from which an unstoppable sword is extracted… the sword from the stone is a meteor sword. The Holy Grail and the sword from the stone share a common origin in this imagery of heavenly stone descending to earth. The Grail is remembered as a sacred stone from the heavens, and the sword drawn from the stone reflects the same celestial source. If the Grail and Excalibur are both understood as meteoric stone, they share a common heavenly origin. The stone from which Excalibur comes is a meteor. Its wielder is a man of steel… The one with the meteor sword is the one with the heavenly light and the divine right to rule.",
      "impact-crater": "So when we look at the sword of Arthur and its meteor roots, we recognize a memory of the real struggle to extract a big meteor from the earth to make swords with. We also recognize the rare ability to transform that stone into a sword. Only the smith was able to do this — to extract swords from stone. Arthur draws the sword from the stone.",
      "forge": "Arthur's forging and road of trials appears in his development under the tutelage of Merlin.",
      "quenching": "But what of the Lady of the Lake? There are two origin stories of Excalibur — the stone and lake. This is because the first iron swords were first drawn from stone and then drawn from water, as quenching was essential to their hardening process… the iron sword coming in and out of water is a mythic transmutation of a literal process in which the sword was quenched. And this tells us why Arthur is undefeatable with this sword… Arthur's invincibility is an echo of Batraz as a personification of steel, which was invulnerable to lesser metals… it is the hardened exterior of iron after it has been quenched in water. When Arthur lay dying at the battle of Badon, after he and his son Mordred cut each other down, his attendant Bedevere came to his side. Arthur told Bedevere to throw his miraculous sword into a body of water… He denied Arthur three times… Only then did he finally return the sword to those waters from which it came.",
      "integration": "Arthur assembles the Knights of the Round Table.",
      "drawing": "Arthur draws the sword from the stone and becomes king.",
      "new-age": "The Age of Camelot begins."
    }
  }
]
