{
  "id": "georgian",
  "name": "The Ghmertebi",
  "description": "The pre-Christian Georgian pantheon crystallized around Mount Kazbek -- the 5,047-meter dormant volcano where the Amirani epic cycle chains its Prometheus to the rock. Georgia sits at the spine of the Caucasus, the mountain wall between the Black Sea and the Caspian, and its mythology reflects that geography: vertical, exposed, caught between empires. The Kartvelian peoples -- Kartlians, Svans, Mingrelians, Laz -- shared a supreme sky god, Ghmerti, but the regional traditions diverged sharply. The Svan highlands preserved pre-Christian hunting cults and mountain spirits well into the twentieth century, long after the lowland kingdom of Kartli adopted Christianity in 337 CE under King Mirian III and Saint Nino. What survived in the mountains was not nostalgia. It was a theology built for vertical terrain: golden goddesses who own the ibex herds on the cliffs, forest spirits who kill with an embrace, a fire-bringer chained under the peak. The medieval chronicle Kartlis Tskhovreba records the state cult -- the bronze idol Armazi flanked by golden Gatsi and silver Gaimi at Mtskheta -- but the older, wilder gods lived in oral tradition, in Svan hunting songs and Mingrelian forest tales, in the places Christianity could not easily reach because the roads did not go there.",
  "deities": [
    {
      "id": "ghmerti",
      "name": "Ghmerti",
      "title": "Supreme God, the Creator",
      "group": "supreme",
      "description": "Ghmerti is the supreme deity of the Kartvelian peoples -- called Morige Ghmerti, 'God the Director,' or Dambadebeli, 'the Creator.' He dwells in the ninth sky, the highest tier of a vertically layered cosmos: zeskneli above, the earthly middle realm, and qveskneli below where the devis and dragons live. In the oldest Svan traditions, Ghmerti is not a personality but a force -- the organizing intelligence behind weather, harvest, justice, and the movement of the sun. He does not intervene like Zeus or Yahweh. He sets the terms. When Amirani steals fire and teaches metalworking to humans, Ghmerti does not rage. He chains Amirani to the mountain. The punishment is structural, not emotional -- you broke the order, now you hold the weight of it. In Pshavi and Khevsureti, highland communities maintained shrines to Ghmerti into the modern era, blending Christian liturgy with animal sacrifice and communal beer-brewing rituals that predate any church. The Georgian word ghmerti became the standard Christian term for God after the fourth-century conversion, which means the old sky deity was not replaced -- he was relabeled. The theological infrastructure stayed. What changed was the story told about it. Psychologically, Ghmerti represents a pattern common to mountain cultures: the supreme deity is not intimate. He is altitude itself. You do not pray to the summit. You orient your life by it."
    },
    {
      "id": "armazi",
      "name": "Armazi",
      "title": "The Chief Idol of Kartli",
      "group": "supreme",
      "description": "Armazi was the supreme deity of the state cult of ancient Kartli -- eastern Georgia, the kingdom the Greeks called Iberia. According to the Kartlis Tskhovreba, King Pharnavaz I raised a colossal bronze idol of Armazi on the mountain above Mtskheta around the third century BCE, flanked by the golden idol Gatsi and the silver idol Gaimi. The Life of Nino describes the statue: a man of bronze in a golden suit of chain armor, a helmet on his head, emeralds and beryls for eyes, and a sword glittering like lightning that turned in his hands. The name almost certainly derives from the same root as Ahura Mazda -- Middle Persian Ohrmazd, Armenian Aramazd -- reflecting the deep Zoroastrian influence on Kartli during the Achaemenid and Parthian periods. But the Georgian scholar Giorgi Melikishvili proposed an alternative: a connection to Arma, the Hittite-Luwian moon god, which would make Armazi far older than the Persian overlay. Both origins may be true simultaneously. Pharnavaz needed a centralizing cult to unify the fractious Kartvelian tribes under royal authority, and he built it from whatever theological materials were available -- Persian, Anatolian, local. When Saint Nino arrived in the fourth century, she prayed and a storm shattered the idol with lightning. The story is a conversion narrative, but the subtext is political: Armazi was the throne's god. Destroy the idol, and you destroy the theological legitimacy of the old dynasty. The pattern repeats across every Christianization story in the Caucasus. The new faith does not merely replace the old gods. It replaces the old power structure that the gods were built to sanctify."
    },
    {
      "id": "dali",
      "name": "Dali",
      "title": "Goddess of the Hunt",
      "group": "nature",
      "description": "Dali -- called Dael in the Svan dialect -- is the most psychologically striking figure in the Georgian pantheon: a golden-haired goddess of extraordinary beauty who lives in a shining cave high in the mountains, watches over the wild ibex and deer on the cliffs, and enters into sexual relationships with human hunters under strict conditions of secrecy. She is naked, radiant, with skin described as glowing white. She owns the animals. A hunter who obeys her taboos -- kill only what you can carry, do not aim at marked animals, abstain from contact with other women before the hunt, never speak of the liaison -- will find game plentiful. A hunter who breaks the rules dies. In one Svan cycle, a hunter's jealous wife discovers his affair with Dali and cuts the goddess's golden hair, killing her. The hunter rescues the child from Dali's womb -- that child is Amirani, the fire-bringer. This is not a love story dressed in myth. It is a precise ecological contract disguised as erotics. The mountain communities of Svaneti depended on ibex hunting for survival in terrain where farming was marginal. Dali personifies the mountain itself: beautiful, generous if you follow the rules, lethal if you take more than your share. The sexual dimension encodes exclusivity -- the hunter's relationship with wild nature must be total and undivided, or the game vanishes. Every hunting culture has a version of this contract, but Dali is unusually explicit about the terms. She does not forgive. The mountain does not forgive. You carry what you kill, or the golden-haired woman on the cliff kills you instead."
    },
    {
      "id": "amirani",
      "name": "Amirani",
      "title": "The Fire-Bringer",
      "group": "nature",
      "description": "Amirani is the Georgian Prometheus -- a demigod born from the hunting goddess Dali and a mortal hunter, chained to a peak in the Caucasus Mountains for defying the supreme god. The parallels with the Greek Prometheus are close enough that ancient Greek writers themselves noted the connection, and many scholars now argue for a shared proto-Caucasian origin rather than borrowing in either direction. The Amirani epic cycle, preserved in oral tradition across Georgian, Svan, Mingrelian, and Abkhaz communities, is older than any written version of the Prometheus myth -- dating in its earliest layers to the late third or second millennium BCE. But the Georgian version is wilder and longer. Amirani does not merely steal fire. He is a dragon-slayer, a devi-killer, a culture hero who teaches humans metalworking and warfare. He defeats monsters that threaten early humanity. His companion is the cursed dog Qursha, who licks the chain that binds him -- and every year the chain thins almost to breaking, but blacksmiths hammer their anvils on a certain day to reforge it, because Amirani's release would shatter the world's order. Georgian tradition places his imprisonment under Mount Kazbek, where Gergeti Trinity Church now stands on the ridge above. The mountain itself is a dormant stratovolcano. The Promethean myth, in both its Greek and Caucasian forms, asks the same question: what happens to the being who gives humans the power to reshape nature? The answer, in every version, is that the giver is punished by the structure he violated. The fire is loose in the world. The fire-bringer is not."
    },
    {
      "id": "ochokochi",
      "name": "Ochokochi",
      "title": "The Forest Spirit",
      "group": "nature",
      "description": "Ochokochi -- literally 'goat-man' in Mingrelian -- is a forest being from the mythology of western Georgia, the Colchian lowlands and mountain forests where Mingrelian-speaking communities lived. He combines human and animal features: thick fur, large claws, horns, and instead of chest hair, a bony protuberance shaped like a pointed bone or stone axe. He kills by embracing -- the bone-spur drives through the victim's body. He wanders the deep forest, terrifying hunters and shepherds, but his defining trait is not violence. It is obsession. Ochokochi is helplessly infatuated with Tkashi-Mapa, the beautiful Queen of the Forest, whom he chases endlessly through the trees. He never catches her. Mortal hunters sometimes intervene to protect Tkashi-Mapa, which creates a strange triangular mythology: the human hunter enters the forest, encounters a dangerous male spirit consumed by lust, and defends a female spirit who embodies the forest's beauty and order. The psychological structure is precise. Ochokochi represents the part of wild nature that is not beautiful, not orderly, not available for human admiration -- the brute, inarticulate, lust-driven force that lives in the same woods where the elegant queen moves. Every forest contains both. The hunter who enters that space must navigate between them. Mingrelian folklore does not moralize this. Ochokochi is not evil. He is simply what the deep forest is also made of: appetite without language, strength without grace, desire that cannot reach its object."
    },
    {
      "id": "gatsi-gaimi",
      "name": "Gatsi and Gaimi",
      "title": "The Gold and Silver Idols",
      "group": "celestial",
      "description": "Gatsi and Gaimi are the paired deities who flanked the great idol of Armazi at Mtskheta, the ancient capital of Kartli. The Kartlis Tskhovreba describes them plainly: Gatsi was a golden idol, Gaimi was a silver idol, both commissioned by King Pharnavaz I in the third century BCE and placed to the right and left of the bronze Armazi on the mountaintop above the confluence of the Mtkvari and Aragvi rivers. Beyond this, almost nothing survives. The medieval Georgian chronicles, composed five or more centuries after Christianization, are the only textual source, and they describe the idols as objects of worship without preserving their specific domains or mythology. Some scholars have proposed that the gold-silver pairing represents the sun and moon -- a reasonable inference given the near-universal association of gold with solar and silver with lunar forces across the ancient Near East and Caucasus. Others connect Gaimi to a possible etymological relationship with the concept of 'cold' or 'night.' What is certain is that they formed a triad with Armazi: a central authority figure flanked by two complementary forces, a spatial theology expressed in metal and placement. The triad structure itself carries meaning regardless of the lost specifics. A supreme god alone is monotheism. A supreme god flanked by two subordinate but essential presences is a different theological statement: power requires balance, authority requires witnesses, the center only holds if the sides hold it. When Saint Nino's prayers destroyed the idols, all three fell together. The structure was the point."
    },
    {
      "id": "barbale",
      "name": "Barbale",
      "title": "Goddess of Fire, Fertility, and the Sun",
      "group": "celestial",
      "description": "Barbale is the Georgian goddess of the sun, fire, cattle fertility, women's fertility, and healing -- an unusually wide portfolio that marks her as one of the oldest and most deeply embedded figures in Kartvelian religion. Her name is connected to borbali, the Georgian word for 'wheel,' and her symbol was the solar disc -- the circle, the flame, the turning year. Her great festival fell on the winter solstice, December 21, the day the light begins its return. Georgians baked round khachapuri -- cheese bread shaped like the sun -- and prepared milk porridge as offerings. Couples who wanted children sought her blessing. Herds were driven past bonfires for purification. The festival survived Christianization by merging with Saint Barbara's Day, Barbaroba, now celebrated on December 17. The Great Martyr Barbara of the third century became Barbale's Christian mask, but the bonfires, the round bread, and the fertility prayers continued underneath. This is the standard pattern of folk-Christian synthesis across the Caucasus, but Barbale's case is unusually transparent -- the name barely changed, the date barely shifted, and the ritual content survived almost intact. Psychologically, Barbale represents the solstice itself as a theological event: the moment when the darkness has gone as far as it will go and the light turns. Every culture marks this moment because the body registers it -- the days have been shortening, and now they stop. Barbale is the name Georgian culture gave to the turn. The wheel. The oldest technology and the oldest metaphor. It comes around."
    },
    {
      "id": "tamar",
      "name": "Tamar",
      "title": "Queen of the Mountain Spirits",
      "group": "celestial",
      "description": "Tamar is a Georgian sky goddess who controlled weather -- an eternal virgin who rode through the air on a serpent saddled and bridled with gold. She enslaved Dilis Varskvlavi, the Morning Star, who was master of winter. Whenever he escaped, snow fell across the mountains; each year she recaptured him and brought summer back. In the highland district of Pshavi, her image fused with a pagan goddess of healing and female fertility. She is also identified with Pirimze, a weather deity, and with Lamara, 'Eye of the Earth.' After the twelfth century, the mythological Tamar absorbed the historical memory of Queen Tamar (r. 1184-1213), Georgia's most celebrated monarch, who presided over the kingdom's golden age. The two Tamars -- the serpent-riding sky goddess and the medieval queen -- collapsed into a single figure in mountain folklore, creating a composite where divine weather-control and royal military triumph became indistinguishable. This is not confusion. It is how oral cultures store political theology. The queen who defeated the Seljuks and patronized Shota Rustaveli's epic The Knight in the Panther's Skin became, in the mountains, the goddess who rides the storm and binds the Morning Star. The Christianization of Tamar was never complete because the historical queen gave the mythological goddess a new anchor in documented time. You cannot demythologize a deity who has a verifiable reign, tax records, and military victories. The two layers reinforce each other. The goddess makes the queen cosmic; the queen makes the goddess real."
    },
    {
      "id": "kopala",
      "name": "Kopala",
      "title": "The Dragon-Slayer",
      "group": "cultural",
      "description": "Kopala is the great hero-deity of the Georgian highlands -- a dragon-slayer, demon-killer, and lightning god whose cult remained active in the mountain communities of Pshavi and Khevsureti into the modern era. He is armed with a mace to which he is bound in mystical solidarity and an iron bow forged specifically for him by Pirkusha, the blacksmith god. Together with Iakhsari, he led the campaign to drive the devis -- the monstrous spirits of the underworld -- out of the middle realm and back into qveskneli, the world below. He alone has the power to defeat the most powerful and stubborn demons, the ones who seize human souls. When lightning struck the mountains or thunder rolled across the valleys, highland Georgians said Kopala was fighting the devils. The phrase survived in village speech long after formal Christianization. His cult eventually merged with that of Saint George -- Giorgi -- who became Georgia's patron saint and absorbed Kopala's dragon-slaying function almost entirely. But the merger reveals something about both figures. Saint George, in Georgian tradition, is not the mild knight of Western iconography. He is Kopala wearing a cross: violent, thunderous, wielding iron forged by a god. The mountain communities did not soften their hero when they Christianized him. They Christianized him on his own terms. Psychologically, Kopala represents the necessity of active confrontation with what the underworld sends up. The devis do not stay below. They rise. Someone has to meet them with the iron bow. The lightning is not metaphor. It is method."
    },
    {
      "id": "tkashi-mapa",
      "name": "Tkashi-Mapa",
      "title": "Queen of the Forest",
      "group": "nature",
      "description": "Tkashi-Mapa is the beautiful Queen of the Forest in Mingrelian mythology -- the figure Ochokochi endlessly chases and never catches. Where Dali governs the high mountain cliffs and the hoofed animals that live on exposed rock, Tkashi-Mapa rules the lowland forests of western Georgia, the dense Colchian woodlands where subtropical growth meets temperate canopy. She is grace to Ochokochi's brutality, order to his chaos, the principle that the forest is not merely wild but structured. Hunters who enter her domain encounter both figures -- the beautiful queen and the goat-man who pursues her -- and must choose which force to align with. The hunters who protect Tkashi-Mapa from Ochokochi are rewarded; those who do not are left to the forest's indifference. The mythology encodes a practical ethic for forest-dependent communities: the woods provide, but only if you defend the principle of order within them. Exploitation -- taking without respect for the forest's own logic -- allies you with Ochokochi, with appetite and destruction. Restraint allies you with the queen. Tkashi-Mapa has no temple, no formal cult, no festival. She exists entirely in story. But the Mingrelian communities who told those stories lived inside the forest she governs, and the stories functioned as behavioral regulation more effectively than any temple could. You do not need a priest to tell you the rules when the queen of the forest and the thing that chases her are both present every time you walk under the canopy."
    }
  ]
}
