{
  "id": "guarani",
  "name": "The Tupã",
  "description": "The Guaraní spiritual world unfolds from the Atlantic forests of Paraguay, Brazil, and Argentina, where 275 cataracts split the Iguazú River into a roaring arc of whitewater two kilometers wide. In the Guaraní creation account, the universe itself was spoken into being — not built, not shaped, but uttered — and the sacred text that records this, the Ayvu Rapyta, means 'the foundation of the word.' The Mbyá-Guaraní preserved a theology of poetic creation: Ñamandu, the First Father, generated the fundaments of human language before matter existed, making speech the precondition of reality rather than its description. The cataracts at Iguazú, where M'Boi the serpent god split the earth in rage, mark the boundary between the ordered world above and the chasm below — a threshold where the river's voice becomes something older than language, and language becomes something older than the world.",
  "deities": [
    {
      "id": "namandu",
      "name": "Ñamandu Ru Ete",
      "title": "The True First Father",
      "group": "creator",
      "description": "Ñamandu Ru Ete — 'Our True Father the First' — existed before anything. In the Ayvu Rapyta as recorded by León Cadogan among the Mbyá-Guaraní of the Guairá in the 1940s, he unfolded himself from primordial darkness, generating his own body from the wisdom of his own creative knowing, kuaarara. Before creating the earth, the forests, or the waters, he conceived the foundations of human language. This is the theological claim that sets Guaraní cosmology apart: the first act of creation was not material but linguistic. Ñamandu spoke the ayvu rapyta, the sacred first words, and from those words everything else followed. During this solitary act of self-creation, he was sustained by the hummingbird, Maino'i, who refreshed his mouth and fed him sacred nourishment — an image that locates the origin of the universe in something as fragile as a bird feeding nectar to a mouth learning to speak. The Mbyá pantheon arranges four gods at the cardinal points: Ñamandu at the east, Karai to the south (fire), Jakaira to the north (the life-giving spring mist), and Tupã to the west (thunder and water). But Ñamandu precedes all of them. Psychologically, the claim is striking: consciousness begins not with perception but with the capacity for naming. The Guaraní located the origin of the self where many modern linguists would — at the threshold where experience becomes expressible, where the mute hum of existence crosses into the structured world of words."
    },
    {
      "id": "tupa",
      "name": "Tupã",
      "title": "God of Thunder and Creation",
      "group": "creator",
      "description": "Tupã governs the western quadrant of the Mbyá cosmos, where the sun descends into Tupã Amba, his celestial dwelling at the horizon. His domain is thunder, lightning, and water — forces that arrive without warning and reshape the landscape in seconds. In the broader Guaraní tradition, Tupã became the supreme creator who descended with the moon goddess Arasy to a hill near Areguá and from that place created everything on earth: oceans, forests, animals, and the spirits of good and evil. He formed the first humans, Rupave and Sypave, from clay mixed with the juice of yerba mate, blood of the Short-tailed Nighthawk, and leaves of several plants, using waters from a spring that would become Lake Ypacaraí. This creation recipe — botanical, animal, mineral, and aquatic elements combined — reflects a theology that understands humanity as a composite of the entire natural world rather than a special category apart from it. Scholars including Alfred Métraux and Cadogan himself have noted that Tupã's elevation to supreme creator likely reflects Jesuit missionary influence during the 17th-century reductions, when the padres needed a Guaraní equivalent to the Christian God and promoted this thunder spirit. The Mbyá texts place him fourth among the gods, not first. This layering — indigenous cosmology beneath missionary overlay beneath modern ethnographic recovery — is significant. The Tupã most people encounter in popular accounts is a colonial composite, and reaching the older figure requires reading Cadogan carefully and attending to what the Mbyá themselves emphasized."
    },
    {
      "id": "arasy",
      "name": "Arasy",
      "title": "Moon Goddess and Mother of Creation",
      "group": "creator",
      "description": "Arasy — the Moon Mother — descended alongside Tupã to the hilltop at Areguá to bring forth the created world. She is the feminine complement of the creative act, the one whose presence makes the shaping of humanity possible. In the myth of Tau and Kerana, it is Arasy who curses the union, ensuring that all seven children born from it will emerge as monsters — a judgment rendered not out of cruelty but as a consequence of moral violation. This makes her the agent of cosmic law: when the boundary between desire and consent is broken, the offspring carry the deformity forward. In broader Tupi-Guaraní tradition, the moon carries deep ambivalence. She governs fertility, menstruation, planting cycles, and the tides of rivers — including the waters that feed the Iguazú — but she is also the site of eclipses, those moments when something swallows the light. The Guaraní concept of the moon as mother rather than merely satellite places reproductive power and moral authority in the same figure. Arasy does not create alone; she requires Tupã. But Tupã does not create without her either. The pairing is functional rather than hierarchical — neither is ornamental. Psychologically, her curse on Tau's children reads as a recognition that violations produce consequences across generations, that the damage does not stay contained in the original act but propagates outward in increasingly distorted forms. The seven monsters are not punishments external to the crime; they are the crime's own offspring, wearing its shape."
    },
    {
      "id": "kuarahy",
      "name": "Kuarahy",
      "title": "The Sun",
      "group": "nature",
      "description": "Kuarahy is the Sun, born from the union of Ñamandu and Ñande Sy, 'Our Mother,' who died giving birth to him. The light that makes life visible cost the mother her life to produce. Under Kuarahy's radiance — the energetic influx of the sun falling upon his mother's bones — his brother Jasy, the Moon, was born from the remains. The Sun therefore precedes the Moon, creates the Moon, and is haunted by the Moon, the two locked in a sibling chase across the sky that the Guaraní read as the fundamental rhythm of time. The twins undergo a hero-journey cycle: raised by jaguars after their mother's death, they discover the truth of their origins, take revenge, and ascend to the sky. This is a monomyth in miniature — orphaning, surrogate upbringing, revelation, quest, apotheosis — compressed into a celestial origin story. At Iguazú, the falls face roughly east-to-west, and the sunrise strikes the mist to produce the rainbows that the Guaraní associated with the bridge between separated lovers. Kuarahy's light is literally what makes the connection visible. Developmentally, the Guaraní solar myth tracks something real: the child who emerges into consciousness (light) at the cost of the undifferentiated unity (the mother's body) that preceded it. The Sun does not mourn its mother — it illuminates her bones and creates a companion from them."
    },
    {
      "id": "jasy",
      "name": "Jasy",
      "title": "The Moon",
      "group": "nature",
      "description": "Jasy, the Moon, was born from the bones of Ñande Sy under the energizing light of his elder brother Kuarahy — a being made not from original creation but from remains animated by someone else's radiance. He is secondhand light in both the mythological and the astronomical sense. The twins' journey through the forest, raised by the jaguars who killed their mother, is one of the great Tupi-Guaraní narrative cycles, documented from Paraguay to the Brazilian coast. Jasy is consistently the weaker, more impulsive twin — the one who fumbles the tests that Kuarahy passes. When they hunt, Jasy misses. When they must cross a bridge, Jasy falls. When Kuarahy invents the trap, Jasy springs it on himself. This is not comic relief; it is a cosmological argument about reflected versus original light. The moon cannot generate its own illumination and cannot quite match the source it depends on. At Iguazú, Jasy governs the falls at night — the moonlight walks when the cataracts gleam silver and the lunar rainbow appears in the mist, a phenomenon the Guaraní considered deeply sacred. The nocturnal falls were a threshold space: dangerous, beautiful, governed by the twin whose light comes from elsewhere. Psychologically, Jasy represents the part of the self that knows it is derivative — the internal voice that borrows its confidence, that shines but knows its shine is reflected. Every culture has a moon myth, but the Guaraní version is unusually honest about what it costs to be the secondary source."
    },
    {
      "id": "angatupyry",
      "name": "Angatupyry",
      "title": "Spirit of Good",
      "group": "nature",
      "description": "Angatupyry is the spirit of good, created by Tupã as the moral counterweight to Tau, the spirit of evil. The two were made simultaneously and deliberately — not as an afterthought or an accident but as the founding architecture of moral experience. Tupã placed both spirits into the world alongside the first humans, Rupave and Sypave, establishing that the capacity for goodness and the capacity for destruction would be present from the first moment of human consciousness. Angatupyry is not passive. When Tau pursued the maiden Kerana, it was Angatupyry who fought him for seven days and seven nights — a sustained confrontation between good and evil that ended with Tau's defeat and exile. But the defeat did not hold. Tau returned, kidnapped Kerana, and fathered the seven monsters. The myth is structurally important: good wins the battle and loses the war. Angatupyry defeats Tau in direct combat and still cannot prevent the consequences of Tau's desire from unfolding across generations. This is not a theology of triumph. It is a theology of persistent, insufficient resistance — good as a force that fights and delays but does not eradicate. The Guaraní did not construct a narrative where righteousness guarantees protection. They constructed one where righteousness fights for seven days, wins, and then watches the violation happen anyway. For anyone working with moral development or ethical reasoning, this is a more honest cosmological frame than most: the good spirit exists, acts, prevails in combat, and still cannot stop the damage."
    },
    {
      "id": "tau",
      "name": "Tau",
      "title": "The Evil Spirit",
      "group": "nature",
      "description": "Tau is the primordial spirit of evil, created by Tupã as the necessary opposite of Angatupyry. He is not a fallen angel or a corrupted good — he was made evil from the start, placed into the world as a structural feature of moral reality rather than as a mistake or a rebellion. When he saw Kerana, the beautiful daughter of Marangatú, he pursued her with an obsession the myths describe as total. Angatupyry fought him for seven days and defeated him. He was exiled. He returned anyway. He abducted Kerana and fathered seven children, each one cursed by Arasy to emerge as a monster. The Guaraní did not explain evil as a fall from grace; they explained it as a created force with its own persistence and fertility. Tau's evil is generative — it produces offspring, populates the world with distorted forms, does not exhaust itself in a single act but propagates. The seven monsters are his legacy, ranging from Teju Jagua the fire-eyed lizard to Luisón the cemetery-dwelling werewolf. Each one governs a different domain of the natural world, which means Tau's violation did not merely produce suffering — it produced the guardians of swamps, caves, open fields, and burial grounds. The damage became the ecology. Psychologically, Tau represents the recognition that destructive impulses are not parasitic on healthy structures but have their own creative force, their own offspring, their own territorial claims."
    },
    {
      "id": "kerana",
      "name": "Kerana",
      "title": "Mother of the Seven Monsters",
      "group": "cultural",
      "description": "Kerana was the beautiful daughter of Marangatú, a descendant of Rupave and Sypave. She is described as prone to daydreaming, wandering alone into the forest, lost in her own interior world — and it was during one of these solitary wanderings that Tau first saw her. The myth does not blame her. It does not say she should have stayed home. It says that evil saw beauty and wanted it, and that the good spirit fought to protect her and failed. After Tau abducted her, Arasy cursed the union: every child would be a monster. Seven were born. Teju Jagua, the seven-headed fire-eyed lizard. Mbói Tu'i, the serpent with a parrot's head, lord of waterways. Moñái, the serpent of the open fields. Jasy Jatere, the small blond spirit who lures children during siesta. Kurupi, the guardian of fertility. Ao Ao, the fanged sheep-beast who eats only humans. And Luisón, the seventh, the werewolf of the cemeteries. Kerana bore all of them. She is not vilified for it; she is recognized as the vessel through which violation became form. Her story raises a question that resonates far beyond Guaraní territory: what happens to the person through whom someone else's transgression enters the world? The monsters are Tau's crime and Arasy's curse, but they are Kerana's children. She carries a weight that belongs to others, and the tradition does not pretend this is fair. It simply records that it happened."
    },
    {
      "id": "mboi-tui",
      "name": "Mbói Tu'i",
      "title": "The Serpent-Parrot, Lord of Waterways",
      "group": "cultural",
      "description": "Mbói Tu'i — literally 'snake-parrot' — is the second of the seven monstrous sons of Tau and Kerana. He has the body of an enormous serpent and the head of a parrot, with a blood-red forked tongue and feathered scales. His shriek instills terror across vast distances. He is the lord and protector of waterways, swamps, and amphibian life. At Iguazú, his presence is foundational. The legend that explains the falls' creation names M'Boi — the serpent god of the Iguazú River — as the force that split the earth when the maiden Naipi and the warrior Tarobá tried to escape his claim. In some versions M'Boi is identified directly with Mbói Tu'i; in others he is a related serpentine water deity. Either way, the theological architecture is the same: the 275 cataracts exist because a serpent god's rage cracked the riverbed, because a young woman's body was claimed as sacrifice and a young man tried to save her. Naipi was turned to stone at the base of the falls. Tarobá was turned to a palm tree at the top. The rainbow connecting them on sunny days is their only bridge. The falls themselves are the serpent's scar on the landscape — beauty made from violence, one of the most visited natural wonders on earth created, in Guaraní theology, by possessive fury. The parallel to Tau's abduction of Kerana is structural: a powerful being claims a woman, is resisted, and the resistance produces a permanent transformation of the world."
    },
    {
      "id": "luison",
      "name": "Luisón",
      "title": "The Seventh Monster — The Werewolf",
      "group": "cultural",
      "description": "Luisón is the seventh and last son of Tau and Kerana, the final form their cursed union produced. He is a werewolf — half man, half wolf — pale, cadaverous, with long lank hair and the stench of death. He haunts cemeteries and burial grounds, feeding exclusively on dead and rotting flesh. In Paraguayan folk belief, which persists into the present, the seventh consecutive son in a family was believed to be at risk of becoming a Luisón, transforming on Friday nights and prowling graveyards until dawn. This belief was so widespread that in Paraguay and Argentina the president would formally adopt every seventh son as a godchild — a practice continuing into the 20th century — to break the curse through institutional blessing. Luisón represents the terminus of a sequence. He is not the most powerful of the seven monsters — Teju Jagua with his fire-eyes and Ao Ao with his hunger for human flesh are arguably more dangerous. But he is the last, the form evil takes when it has run out of other shapes. His domain is not the living world but the aftermath: the cemetery, the corpse, the body after the spirit has departed. Psychologically, Luisón is the final stage of a degenerative process — the point where transgression, having produced six previous distortions, arrives at the thing that feeds on what is already dead. He is the scavenger of a moral catastrophe, the creature that appears only after everything else has been lost."
    },
    {
      "id": "rupave-sypave",
      "name": "Rupave and Sypave",
      "title": "The First Man and Woman",
      "group": "hero",
      "description": "Rupave, 'Father of the People,' and Sypave, 'Mother of the People,' are the first human beings, shaped by Tupã from clay and the elements of the Paraguayan landscape. The creation recipe is specific: clay, the juice of yerba mate, blood of the Short-tailed Nighthawk, leaves of medicinal plants, and water from the spring at Ypacaraí. Tupã breathed life into them and then departed, leaving them with Angatupyry and Tau — the spirits of good and evil — to navigate moral existence on their own. This departure is theologically significant. Unlike creation accounts where the gods remain to supervise, Tupã walks away. The first humans are given the capacity for goodness and the presence of evil, then left to manage the tension without divine intervention. Rupave and Sypave had three sons and many daughters. Their granddaughter Kerana would become the mother of the seven monsters. Their descendant Marangatú would become a leader of such virtue that upon death he was transformed into a star. The lineage runs from creation through catastrophe through redemption — a complete moral arc embedded in a family tree. The material specificity of their creation — yerba mate, nighthawk blood, spring water from a real lake — grounds them in a particular landscape. They are not made from universal dust or cosmic clay; they are made from Paraguay. The Guaraní understanding of what a human being is cannot be separated from the soil, the water, and the living creatures of the Paraná basin."
    },
    {
      "id": "mainoi",
      "name": "Maino'i",
      "title": "The Sacred Hummingbird",
      "group": "nature",
      "description": "Maino'i, the hummingbird, is not a deity in the conventional sense but occupies a role in Guaraní cosmology that no god can fill. When Ñamandu Ru Ete was unfolding himself from darkness and generating the foundations of human language, it was Maino'i who sustained him. The hummingbird refreshed his mouth, fed him sacred nourishment, and made it possible for the creative speech to continue. Without this tiny bird, the words that built the universe would have dried up in the speaker's throat. The image is deliberately scaled: the most consequential act in all of existence — the speaking of reality into being — depended on a creature that weighs less than a coin. In the Mbyá-Guaraní tradition, hummingbirds carry spiritual significance far beyond this origin scene. They are associated with word-souls, the ñe'ẽ porã, names given by the gods and revealed to the opygua, the spiritual leader, for each newborn child. Cadogan recorded that the Mbyá considered certain hummingbird species sacred and would not harm them under any circumstances. At Iguazú, hummingbirds are abundant in the subtropical forest surrounding the falls — a living presence of the creature who made creation possible. The theological proposition embedded in Maino'i: that the greatest powers require the smallest sustenance, that language itself needed to be fed before it could feed the world, and that creation is not a solitary act of omnipotence but a collaborative event in which even the most fragile participant is indispensable."
    }
  ]
}
