{
  "id": "haida",
  "name": "The Supernatural Beings",
  "description": "The Pacific Northwest Coast spiritual tradition spans the Haida, Tlingit, and Kwakwaka'wakw nations along the rain-forested coastline from southeast Alaska to British Columbia. Mount Edgecumbe — L'ux Shaa, 'the blinking mountain' in Tlingit — is a dormant stratovolcano on Kruzof Island near Sitka, sacred to the Tlingit people who first encountered it spouting fire and smoke over ten thousand years ago. These are living traditions with contemporary practitioners, artists, and language keepers; the beings described here are not relics but active presences in cultures organized around moiety systems (Raven and Eagle/Wolf), matrilineal clans, potlatch governance, and a spiritual ecology where every animal, river, and mountain is a person with whom you maintain relationships.",
  "deities": [
    {
      "id": "raven",
      "name": "Yéil / Raven",
      "title": "The Trickster-Creator Who Stole the Sun",
      "group": "transformer",
      "description": "Raven is the central figure of Northwest Coast mythology, and the story of how he stole the sun is one of the great heist narratives in world literature. As documented by John Swanton in 'Tlingit Myths and Texts' (1909) and elaborated across hundreds of regional variants, the world was in total darkness because a rich old man on the Nass River kept the sun, moon, and stars locked in nested boxes inside his house. Raven — hungry, scheming, relentless — transformed himself into a hemlock needle floating in a cup of water, was swallowed by the old man's daughter, and was reborn as her child. The old man doted on the baby. The baby screamed until he was given the boxes to play with. One by one, Raven-as-infant opened the boxes, releasing the stars, then the moon. When he finally got the box containing the sun, he uttered the raven cry — 'Ga!' — resumed his bird form, and flew out through the smoke hole, carrying the sun into the world. This is not a creation story in the Genesis sense. Nobody willed the world into existence from a position of authority. A hungry trickster conned his way into a house, manipulated an old man's love for his grandson, and stole what should have been shared all along. The moral architecture is completely different from traditions where a supreme being grants light as a gift. Here, the light was hoarded, and it took a liar to redistribute it. In Tlingit society, which is divided into two moieties — Raven and Eagle/Wolf — Raven's name governs half of all social organization. Bill Reid, the Haida artist whose name was Yaahl Sgwansung ('The Only Raven'), spent his career giving Raven visible form, most famously in 'The Raven and the First Men' (1980), where Raven coaxes the first humans out of a clamshell. Raven is black, iridescent, loud, and never satisfied. He is also the reason anyone can see.",
      "animals": ["Raven"],
      "colors": ["Black", "Iridescent blue-black"]
    },
    {
      "id": "thunderbird",
      "name": "Thunderbird",
      "title": "The Great Sky Spirit",
      "group": "transformer",
      "description": "Thunderbird is the supreme aerial power across Pacific Northwest Coast cultures — a being so large its wingspan stretches the width of two war canoes, whose wing-beats create thunder and whose eyes flash lightning. The Haida call it Ooolala. Among the Kwakwaka'wakw, Thunderbird sits at the apex of the totem pole, the highest-status crest, representing a family's claim to supernatural authority. The Thunderbird-and-Whale stories, documented across Tlingit, Nuu-chah-nulth, and Makah traditions, describe an ongoing struggle between the sky power and the ocean power — Thunderbird diving from the clouds to seize killer whales in its talons, carrying them back to its mountain nest to feed. Some ethnologists, particularly those working with Pacific Northwest seismic history, have proposed that these narratives encode actual geological events: the shaking of the earth (Thunderbird's landing) and the flooding from the sea (the whale's thrashing) map onto the subduction zone earthquakes and tsunamis that periodically devastate this coastline. The great Cascadia earthquake of 1700 may live inside these stories. What is psychologically compelling about Thunderbird is its relationship to scale. This is a being that operates at the level of weather systems and tectonic events — forces that dwarf human agency entirely. Yet it appears on family crests, on house posts, on the regalia worn by specific chiefs at specific ceremonies. It is simultaneously cosmic and personal, claimed as an ancestor by particular lineages. The Northwest Coast achievement was to build a social system where a family could say, credibly and publicly, 'The storm is my relative.' Thunderbird is associated with the colors black and red, and with the mountain peaks where it nests above the cloud line.",
      "animals": ["Eagle (closest natural analog)", "Killer whale (primary adversary)"],
      "colors": ["Black", "Red", "White"]
    },
    {
      "id": "kumugwe",
      "name": "Kumugwe / Komokwa",
      "title": "Chief of the Undersea World",
      "group": "ocean",
      "description": "Kumugwe — whose name means 'wealthy one' and whose epithet is 'Copper Maker' — is the lord of everything beneath the ocean's surface in Kwakwaka'wakw and Nuxalk tradition. His undersea palace is built of copper planks. Its house posts are living sea lions. Its doors are like giant snapping mouths. He sits inside surrounded by riches that make the wealthiest surface chief look destitute. Franz Boas documented multiple quest narratives in which heroes journey to Kumugwe's realm: those who reach it and survive are rewarded with spirit powers, ceremonial privileges, and coppers — the shield-shaped objects that served as the supreme units of wealth on the Northwest Coast, some worth thousands of blankets. Kumugwe controls the tides. He is responsible for the rising and falling of the sea, and for everything the tides deposit on beaches — driftwood, shells, and the bodies of the drowned. He can see the future, heal the sick, and bestow supernatural gifts on those he favors. The psychological dimension here is the Northwest Coast relationship to wealth itself. These were among the most materially prosperous pre-contact cultures in North America — the salmon runs, the cedar forests, the marine resources created abundance without agriculture. And the culture they built around that abundance inverted what most civilizations do with surplus. The potlatch system, documented extensively by Boas among the Kwakwaka'wakw, measured a chief's status not by what he accumulated but by what he gave away. Kumugwe is the source of all this wealth, and his undersea realm is the model: limitless generosity flowing upward from below. A culture that locates its treasury at the bottom of the ocean, accessible only to those brave or favored enough to dive, is saying something specific about the relationship between risk, generosity, and status.",
      "animals": ["Sea lions", "Octopus", "All sea creatures"],
      "colors": ["Copper", "Blue-green", "Deep ocean black"]
    },
    {
      "id": "gunakadeit",
      "name": "Gunakadeit / Gonakadet",
      "title": "The Sea Monster and Wealth Bringer",
      "group": "ocean",
      "description": "Gunakadeit is one of the most important crest figures in Tlingit tradition — a sea monster whose sighting brings wealth and good fortune to the witness. The foundational story, recorded by Swanton and retold across Tlingit communities near Sitka and the surrounding islands, follows a young man despised by his in-laws as lazy and worthless. Walking the shore in shame, he encounters a monstrous being emerging from the sea. Rather than flee, he engages with it — in some versions wearing the creature's skin, in others forming an alliance — and returns to his village with salmon, halibut, and resources that transform his family's status. His former tormentors are silenced by abundance. The Gunakadeit story is essentially a narrative about the reversal of social contempt through supernatural encounter. The person the community rejects is the one who brings them what they need. This pattern — the despised youngest son, the overlooked daughter, the ridiculed outcast who returns bearing gifts — runs through mythology worldwide, but the Tlingit version grounds it in specific economic reality. Status on the Northwest Coast was not abstract; it was measured in feasts given, blankets distributed, coppers broken. Gunakadeit's wealth is real, material, and publicly witnessed. His dual nature matters too: in some stories he brings prosperity, in others he drags boats to the ocean floor. The sea provides and the sea destroys, and Gunakadeit embodies both without contradiction. He appears in Tlingit art as a creature with features of both sea and land animals — part whale, part wolf, part something that does not exist on the surface. The creature's form refuses easy classification, which is the point. Wealth, like the ocean, does not follow your categories.",
      "animals": ["Sea creatures", "Wolf (hybrid form)"],
      "colors": ["Sea-green", "Black", "Copper"]
    },
    {
      "id": "wasgo",
      "name": "Wasgo / Sea Wolf",
      "title": "The Sea-Wolf",
      "group": "ocean",
      "description": "The Wasgo — called Wasco by the Haida and closely related to the Tlingit Gonakadet — is depicted in Northwest Coast art as a creature with the head and tail of a wolf and the fins and blowhole of a killer whale. It is a being that belongs fully to neither land nor sea, and its hybrid nature is its defining feature. Haida artists, particularly those working in the formline tradition on Haida Gwaii, carved the Wasgo into house posts, bentwood boxes, and feast dishes, giving visible form to an animal that exists only in the space between categories. The Wasgo was said to bring great luck and wealth to anyone who saw it or heard its howl rising from the ocean — a wolf's cry coming from a place where wolves cannot survive. There is something psychologically precise about this image. The wolf is the apex land predator of the Northwest Coast forests. The killer whale is the apex ocean predator of these waters. The Wasgo fuses them into a single being that dominates both domains simultaneously. For cultures whose survival depended on mastering both the forest (cedar, game, berries) and the sea (salmon, halibut, shellfish, whale), the Wasgo represents total ecological competence — the ability to thrive in every environment available. It also refuses the boundary between terrestrial and marine. Northwest Coast cultures were littoral — they lived at the edge, where land meets water, where the forest runs down to the tide line. The Wasgo is the spirit of that edge. Some modern researchers have noted the parallels between Wasgo depictions and reported sightings of Cadborosaurus, a supposed sea creature in the Strait of Georgia, though whether the art records observation or the observations echo the art is an open question. The Wasgo is black, with the markings of both wolf and orca.",
      "animals": ["Wolf", "Killer whale (orca)"],
      "colors": ["Black", "White", "Red"]
    },
    {
      "id": "bear-mother",
      "name": "Bear Mother",
      "title": "The Woman Who Married a Bear",
      "group": "forest",
      "description": "The story of Bear Mother is one of the most widely told narratives on the Northwest Coast, documented among the Haida, Tlingit, and Tsimshian, and given its most famous artistic form by Bill Reid in his 1972 carved gold box 'Haida Myth of Bear Mother.' A young woman is out picking berries and steps in bear dung. She insults the bears — mocks them, complains about them, speaks of them with contempt. A handsome stranger appears and leads her away. He is a bear in human form, and she is taken to the bear village, where she marries the bear chief's son and gives birth to twin cubs who are half human, half bear. She lives among the bears and learns their ways — their songs, their ceremonies, their protocols for death and hunting. When her brothers eventually track her down, her bear husband knows he must die. Before they kill him, he teaches his wife and children the songs that hunters must sing over a bear's body to ensure continued good fortune. The brothers kill him. The bear wife and her children return to the human village. The bear sons remove their bear coats and become great hunters. Nora Marks Dauenhauer, the Tlingit scholar and poet who spent decades documenting Tlingit oral literature, noted that this story encodes the fundamental rule of Northwest Coast human-animal relations: you do not disrespect the beings you depend on for survival. The woman's careless insult — her failure to recognize that bears are persons with dignity — is the inciting event. Everything that follows is corrective. She must live among them, love one of them, bear hybrid children, and watch her husband die with proper ceremony before the relationship between humans and bears can be restored. The psychological insight is that sustainable predation requires empathy. You must know the one you kill. The bear songs are not optional decoration — they are the terms of the contract.",
      "animals": ["Bear (grizzly and black)", "Human-bear hybrids"],
      "colors": ["Brown", "Black", "Honey-gold"]
    },
    {
      "id": "dzunukwa",
      "name": "Dzunukwa / Tsonokwa",
      "title": "The Wild Woman of the Woods",
      "group": "forest",
      "description": "Dzunukwa is one of the most visually striking figures in Kwakwaka'wakw ceremonial life — a black-skinned giantess with sunken eyes, pursed red lips, long pendulous breasts, and wild unkempt hair. She stalks the deep forest, calling 'Hu! Hu!' in a low, drowsy voice, and she carries a basket on her back for collecting children. She eats them. This is not a sanitized fairy-tale threat — in the stories documented by Boas and preserved in Kwakwaka'wakw oral tradition, Dzunukwa actively hunts children, smears pitch over their eyes, stuffs them in her basket, and takes them to her home to devour. But she is also dim-witted, sleepy, and clumsy, and the children in the stories consistently outsmart her, escape, and sometimes kill her. And here is the crucial turn: Dzunukwa can resurrect herself. She is an ancestral figure for the Namgis clan, whose origin stories trace back to her son Tsilwalagame. She is a bringer of wealth. At the end of the potlatch ceremony, the host chief emerges wearing the Dzunukwa mask — the geekumhl — to distribute the final gifts. The being who devours children is also the being who makes you rich. This is not a contradiction the Kwakwaka'wakw failed to notice; it is the point. Wealth and danger share a source. The forest that feeds you will also kill you if you are careless, small, or alone. Dzunukwa holds both truths simultaneously, and the culture's refusal to split her into 'good' and 'evil' versions is psychologically more honest than most Western fairy tales manage. She is the shadow of maternal nurture — the devouring mother that Jungians identify across cultures — but she is also the economic engine of the potlatch system. Terror and generosity, walking together through the cedars.",
      "animals": ["None specific — she is humanoid but monstrous"],
      "colors": ["Black (skin)", "Red (lips)", "White (around eyes)"]
    },
    {
      "id": "bukwus",
      "name": "Bukwus / Bakwas",
      "title": "The Wild Man of the Woods",
      "group": "forest",
      "description": "Bukwus is the Chief of the Ghosts — a skeletal, hollow-eyed figure who lives in an invisible house deep in the forest, surrounded by the spirits of the drowned. His house cannot be seen during the day. He subsists on ghost food served in cockle shells, and his method is deception: when a living person becomes lost in the woods, Bukwus approaches and offers food. If you eat it, you become like him — a ghost, trapped in his realm, eternally hungry, eternally wandering. The Kwakwaka'wakw masking tradition gives Bukwus a gaunt face, deep eye sockets, and an expression that hovers between sorrow and cunning. He appears in the T'seka and Tla'sala winter ceremonials, performed during the potlatch season, when the boundary between the human and supernatural worlds is understood to be at its thinnest. Bukwus is psychologically interesting because he inverts the standard monster template. He does not attack. He does not chase. He offers hospitality. His weapon is generosity — food given freely to someone in need — and the trap is accepting it. For a culture built on the potlatch, where accepting a gift creates an obligation and refusing one is an insult, Bukwus represents the dark side of the exchange system itself. Not all gifts are safe. Not all generosity is what it appears. The drowned souls who cluster around his invisible house were once living people who made a single wrong choice — they ate what was offered by someone they should not have trusted. In a social world organized around reciprocal giving, Bukwus is the reminder that the system has teeth. The border between feast and trap is thinner than you think.",
      "animals": ["Associated with cockles, shellfish, and the spirits of drowned people"],
      "colors": ["Grey-green", "Bone white", "Forest dark"]
    },
    {
      "id": "sisiutl",
      "name": "Sisiutl",
      "title": "The Double-Headed Serpent",
      "group": "forest",
      "description": "Sisiutl is a double-headed serpent with a human face at its center, and it is one of the three most important lineage crests in Kwakwaka'wakw culture, alongside Thunderbird and Dzunukwa. Its two serpent heads — horned, with protruding tongues and spiral noses — face outward in opposite directions while the central human face stares straight ahead. The body is marked with crescents and scales. To look at Sisiutl is to be turned to stone. To step in its slime trail is to be doomed. But to kill Sisiutl is to absorb its power — shamans sought it because both the serpent and the shaman are mediators between the natural and supernatural worlds, and warriors wore its image on their regalia because its blood was believed to make them invincible. Boas documented the Sisiutl's role in Kwakwaka'wakw ceremonial life extensively, noting its appearance in the hamatsa (cannibal dance) complex and its association with the warrior tradition. The double-headed form is significant beyond decoration. A creature that faces both directions simultaneously cannot be ambushed, cannot be approached from behind, sees everything. The central human face — looking directly at the viewer — adds a third perspective: you are being seen while you look. This three-way gaze makes Sisiutl a figure of total awareness, which is why it is associated with both shamanic vision and military invincibility. Psychologically, the double-headed serpent addresses the human anxiety about blind spots — what is behind you, what you cannot see, what approaches while your attention is elsewhere. Sisiutl eliminates the blind spot entirely, but the cost of encountering it is petrification. Complete awareness, it turns out, is not something mortal minds survive intact.",
      "animals": ["Serpent (supernatural, double-headed)"],
      "colors": ["Green", "Red", "Black", "White (central face)"]
    },
    {
      "id": "kushtaka",
      "name": "Kushtaka / Kooshdaa Kaa",
      "title": "The Land-Otter People",
      "group": "spirit",
      "description": "The Kushtaka — Kooshdaa kaa, literally 'land-otter man' — are shapeshifting beings in Tlingit tradition that occupy a unique position in the mythology: they are neither straightforwardly evil nor straightforwardly good, and their behavior changes depending on who is telling the story. In some accounts, Kushtaka lure Tlingit sailors to their deaths by imitating the cries of babies or the screams of women in distress. Fishermen follow the sounds toward the riverbank and are either killed or transformed into Kushtaka themselves. In other accounts, Kushtaka save people from freezing to death in the Alaskan wilderness — pulling them from the cold, warming them, keeping them alive through the night. The price of rescue is transformation: you survive, but you are no longer fully human. You become something between. This ambiguity is the Kushtaka's defining feature. They can take the form of any otter species, or they can appear fully human — a neighbor, a relative, someone you trust. They emit a distinctive three-part whistle: low-high-low. They can be warded off by copper, fire, dogs, and urine. Tlingit mothers used Kushtaka stories to keep children away from the water's edge, which makes practical sense in a landscape where the ocean and rivers are both the primary food source and the primary source of drowning deaths. But the Kushtaka are more than a cautionary device. They represent the permeability of identity itself — the idea that the boundary between human and animal, between self and other, is not fixed. In a culture organized around clan identities tied to specific animals (Raven, Eagle, Wolf, Bear), the Kushtaka embody the terror of losing your identity entirely, of becoming something unrecognizable to your own family. They haunt the liminal spaces: riverbanks, shorelines, the edge of the forest where the village ends and the wild begins.",
      "animals": ["Otter (all species, especially river and sea otter)"],
      "colors": ["Brown", "Grey", "The color of wet fur"]
    },
    {
      "id": "gagit",
      "name": "Gagit / Sgana Qeda's",
      "title": "The Supernatural Beings",
      "group": "spirit",
      "description": "Gagit — the drowned-spirit ghosts in Haida tradition — belongs to a much larger category: the Sgana qeda's, the 'supernatural ones,' an entire ecology of non-human persons that pervades every layer of the Northwest Coast world. This is not a pantheon in the Greek or Hindu sense, with a fixed roster of named gods on a mountain. It is closer to what the anthropologist Irving Hallowell described among the Ojibwe as 'other-than-human persons' — beings with consciousness, agency, and social relationships who happen not to be human. Salmon People live beneath the rivers in villages that mirror human ones; when salmon swim upstream to spawn and die, they are visiting the human world, and if their bones are returned to the water, they are reborn in their underwater homes. Bear People, Forest People, Ocean People, Mouse People — each species is a nation with its own customs, leaders, and expectations of how humans should behave toward them. The totem pole tradition — which outsiders often misunderstand as idol worship or decoration — is essentially a family library carved in cedar. Each figure on the pole records a specific ancestor's encounter with a specific supernatural being: this is the crest we earned, this is the story of how we earned it, and here it stands in public so everyone can see our lineage and verify our claims. John Swanton's Haida fieldwork at Skidegate and Masset in the early 1900s documented hundreds of these beings, and contemporary Haida scholars and artists — including those working through the Haida Heritage Foundation — continue to maintain and expand these relationships. The category 'supernatural' is itself misleading. In Northwest Coast ontology, these beings are not above or outside nature. They are nature, seen clearly. The human failure is not disbelief but inattention — not noticing that the world is already full of persons who are watching whether you behave properly toward them.",
      "animals": ["All animals are potential supernatural persons"],
      "colors": ["Red", "Black", "Blue-green (the formline palette)"]
    }
  ]
}
