{
  "id": "hindu",
  "name": "The Hindu Devas",
  "description": "The principal deities of the Hindu tradition, anchored to Mount Kailash. Several connect to the Navagraha — the nine planetary influences of Vedic astrology — and carry correspondences into the Chronosphaera system. The others govern domains so vast that no single planet could hold them.",
  "deities": [
    {
      "id": "brahma",
      "name": "Brahma",
      "title": "The Creator",
      "group": "trimurti",
      "description": "First of the Trimurti, the cosmic creator who spoke the universe into being. He has four heads, each facing a cardinal direction, each reciting one of the four Vedas — Rig, Yajur, Sama, Atharva — so that sacred knowledge radiates in all directions simultaneously. He once had five heads; Shiva cut the fifth off when Brahma grew arrogant, and the act bound Shiva to carry the skull as penance. Brahma sits on a lotus that grows from Vishnu's navel — creation emerging from preservation, one god literally rooted in another. His consort is Saraswati, goddess of the knowledge required to create anything worth creating. Despite being the creator of the universe, he is the least worshipped of the three supreme gods — there is only one major temple to him in all of India, at Pushkar in Rajasthan. The logic is mythic: creation is finished, so the creator's work is done. He holds the Vedas, a rosary of time, a water pot of primordial waters, and a lotus. His vehicle is the hamsa, the celestial swan said to be able to separate milk from water — truth from illusion.",
      "animals": ["Swan (Hamsa)"],
      "colors": ["Red", "Gold"],
      "vegetation": ["Lotus"],
      "weapons": ["Vedas (scripture)", "Kamandalu (water pot)", "Mala (rosary)", "Lotus"],
      "consorts": ["Saraswati"],
      "birthCreation": "Self-born (Svayambhu) from the cosmic golden egg (Hiranyagarbha), or emerged on a lotus growing from Vishnu's navel as Vishnu dreamed the universe into being. The accounts do not contradict — they layer.",
      "holidays": "Brahmotsavam; Kartik Purnima at Pushkar"
    },
    {
      "id": "vishnu",
      "name": "Vishnu",
      "title": "The Preserver",
      "group": "trimurti",
      "description": "Second of the Trimurti, the sustainer of the cosmos, the god who descends into the world whenever dharma is threatened. He sleeps on the coils of Shesha, the thousand-headed cosmic serpent, drifting on the Ocean of Milk between cycles of creation, and from his navel a lotus grows bearing Brahma. His skin is the blue of infinite sky and infinite ocean — the color of that which has no boundary. He carries four objects in four hands: the Sudarshana Chakra, a spinning discus that destroys ignorance; the Panchajanya, a conch whose sound is the primordial Om; the Kaumodaki, a mace representing mental and physical strength; and a lotus representing purity and transcendence. He has descended to earth ten times as avatars — Matsya the fish who saved the Vedas from a flood, Kurma the tortoise who supported the churning of the ocean, Varaha the boar who lifted the earth from cosmic waters, Narasimha the man-lion who destroyed a tyrant immune to conventional death, Vamana the dwarf who crossed the universe in three steps, Parashurama the warrior-sage, Rama the ideal king, Krishna the divine strategist and lover, Buddha the compassionate teacher, and Kalki who will come at the end of the age on a white horse. Each avatar answers a specific crisis. His consort is Lakshmi, who accompanies him in every incarnation — Sita to his Rama, Rukmini to his Krishna. Vaishnavism, the largest denomination of Hinduism, holds him as the supreme being.",
      "animals": ["Garuda (eagle-mount)", "Shesha (cosmic serpent)"],
      "colors": ["Blue", "Gold"],
      "metals": ["Gold"],
      "vegetation": ["Lotus", "Tulsi (holy basil)"],
      "weapons": ["Sudarshana Chakra (discus)", "Panchajanya (conch)", "Kaumodaki (mace)", "Lotus"],
      "consorts": ["Lakshmi"],
      "birthCreation": "Eternal and self-existent — he has no origin in the Vaishnavite tradition, being the source from which all else emerges. In the Trimurti framework, he is one of three aspects of Brahman, the ultimate reality.",
      "holidays": "Diwali (return of Rama); Janmashtami (birth of Krishna); Holi; Vaikuntha Ekadashi"
    },
    {
      "id": "shiva",
      "name": "Shiva",
      "title": "The Destroyer and Transformer",
      "group": "trimurti",
      "description": "Third of the Trimurti, the destroyer whose destruction is transformation — the fire that clears the forest so new growth can begin. He lives on Mount Kailash in the Himalayas with his consort Parvati, meditating in stillness so profound that when he opens his third eye, it annihilates whatever stands before it — he once reduced Kama, the god of desire, to ash for interrupting his meditation. He is Nataraja, the Lord of Dance, whose cosmic Tandava dances the universe into and out of existence — one foot planted on the demon of ignorance, one hand holding the drum of creation, one hand holding the flame of destruction, ringed by a circle of fire. His throat is blue because he swallowed Halahala, the poison that emerged from the churning of the ocean, to save all life — Parvati gripped his throat to stop it from spreading, and it stained him forever. He carries the trident (trishula) representing creation, preservation, and destruction; the damaru drum whose rhythm is the heartbeat of the cosmos; and the serpent Vasuki coiled around his neck. The Ganges flows from his matted hair — he caught the river as it fell from heaven so its force would not shatter the earth. He is the ascetic smeared in cremation ash, the householder who loves his wife and sons, the wild dancer, the still meditator. Shaivism, one of Hinduism's largest traditions, holds him as the supreme being. His symbol is the lingam — the pillar of cosmic energy, abstract and absolute.",
      "animals": ["Bull (Nandi)", "Serpent (Vasuki)", "Tiger"],
      "colors": ["Blue (throat)", "White (ash-smeared)", "Saffron"],
      "vegetation": ["Bilva (bael tree)", "Datura", "Rudraksha"],
      "weapons": ["Trishula (trident)", "Damaru (drum)", "Pinaka (bow)", "Pashupatastra (divine weapon)"],
      "consorts": ["Parvati (also manifests as Durga, Kali)"],
      "birthCreation": "Eternal and uncreated in Shaivite theology — the source itself. In Puranic accounts, he manifested as an infinite pillar of fire (the Jyotirlinga) that neither Brahma nor Vishnu could find the beginning or end of, establishing his supremacy.",
      "holidays": "Maha Shivaratri (the great night of Shiva); Shravan month observances; Pradosh Vrat"
    },
    {
      "id": "saraswati",
      "name": "Saraswati",
      "title": "Goddess of Knowledge, Music, and the Arts",
      "group": "devi",
      "description": "She is knowledge itself — not knowledge as information, but knowledge as the capacity to create, discern, and express truth. She wears white, the color of pure light before it splits into the spectrum, representing sattva — clarity, purity, the luminous quality of mind. She sits on a white lotus or on the bank of a flowing river, playing the veena, the stringed instrument whose music represents the harmony of all learning. In her four hands she holds the veena (creative arts), the Vedas (sacred knowledge), a mala rosary (spiritual practice), and a water pot (purifying power). Her vehicle is the hamsa, the swan that separates milk from water, truth from falsehood — the same discernment her devotees seek. She is Brahma's consort: without knowledge, creation has no form; without creation, knowledge has no expression. The river Saraswati, praised in the Rig Veda as the greatest of rivers, dried up and vanished underground thousands of years ago — but her name persists in every school, library, and music hall in India. Students place books at her feet during Vasant Panchami and do not study that day out of respect, because on that day knowledge is worshipped, not used.",
      "animals": ["Swan (Hamsa)", "Peacock"],
      "colors": ["White", "Yellow"],
      "vegetation": ["White lotus"],
      "weapons": ["Veena (instrument)", "Vedas (scripture)", "Mala (rosary)", "Kamandalu (water pot)"],
      "consorts": ["Brahma"],
      "birthCreation": "Emerged from Brahma — in some accounts from his mouth as sacred speech, in others as a river flowing from his creative will. She is Vak, the goddess of speech, made manifest.",
      "holidays": "Vasant Panchami (Saraswati Puja) — pens, books, and instruments are placed at her feet; Navaratri (final three days)"
    },
    {
      "id": "lakshmi",
      "name": "Lakshmi",
      "title": "Goddess of Fortune, Beauty, and Prosperity",
      "group": "devi",
      "description": "She emerged from the Kshirasagara, the Ocean of Milk, during the Samudra Manthan — the great churning when devas and asuras wrapped the serpent Vasuki around Mount Mandara and churned the cosmic ocean to obtain the nectar of immortality. Among the fourteen treasures that rose from the foam, Lakshmi appeared seated on a lotus in full radiance, and chose Vishnu as her consort. She accompanies him in every avatar — as Sita beside Rama, as Rukmini beside Krishna, as Padma beside Vamana — loyal not to a single form but to the principle of preservation itself. She has four arms representing the four goals of human life: dharma (righteousness), artha (wealth), kama (desire), and moksha (liberation). Gold coins pour from one hand — not as greed but as abundance freely given. She stands or sits on a lotus, wears red and gold, and is flanked by elephants who pour water over her, a symbol of royal consecration. Diwali, the festival of lights, is her night above all others: millions of lamps are lit to invite her into homes, because Lakshmi enters where there is light, cleanliness, and generosity. She is as fickle as fortune — she leaves when taken for granted, and arrives where she is honored without grasping.",
      "animals": ["Elephant", "Owl"],
      "colors": ["Red", "Gold", "Pink"],
      "metals": ["Gold"],
      "vegetation": ["Lotus", "Tulsi (holy basil)"],
      "weapons": ["Lotus (two hands)", "Gold coins (showering from palm)", "Blessing gesture (abhaya mudra)"],
      "consorts": ["Vishnu"],
      "birthCreation": "Rose from the churning of the Ocean of Milk (Samudra Manthan) seated on a lotus, fully adorned, radiant. She chose Vishnu as her eternal consort from among all the gods.",
      "holidays": "Diwali (primary — the Festival of Lights); Sharad Purnima; Varalakshmi Vratam; every Friday is traditionally her day"
    },
    {
      "id": "parvati",
      "name": "Parvati",
      "title": "Goddess of Love, Devotion, and Fertility",
      "group": "devi",
      "description": "Daughter of Himavan, the personification of the Himalaya mountains, and Mena, a celestial nymph. She is the gentle aspect of Devi, the Great Goddess — the same cosmic feminine energy that manifests as fierce Durga and wrathful Kali, but here in the form of the devoted wife, the tender mother, the patient lover. After Shiva's first wife Sati immolated herself in her father Daksha's sacrificial fire, Shiva withdrew into grief so deep it became permanent meditation, and the universe began to wither without his active engagement. Parvati was born specifically to draw him back. She performed tapas — extreme austerities — in the mountains for years, outdoing even Shiva in discipline, until he could no longer ignore her. Their courtship is one of the great love stories of Indian literature: the ascetic god who wants nothing, won by the woman who wants him with a devotion that matches his detachment. Together they are the parents of Ganesha and Kartikeya. She is often depicted with Shiva in the Ardhanarishvara form — half-man, half-woman, a single body divided vertically — representing the inseparability of masculine and feminine principles. She is green like the living earth, gentle as the mountain she was born from is massive.",
      "animals": ["Lion", "Tiger", "Bull (shared with Shiva)"],
      "colors": ["Green", "Red", "Gold"],
      "vegetation": ["Lotus", "Pomegranate"],
      "weapons": ["Lotus", "Trident (occasionally)", "Mirror"],
      "consorts": ["Shiva"],
      "birthCreation": "Daughter of Himavan (the Himalayas personified) and Mena. Reincarnation of Sati, Shiva's first wife who self-immolated. Born to draw Shiva out of his cosmic grief and back into engagement with the world.",
      "holidays": "Teej (celebrated by married women for marital devotion); Gauri Tritiya; Navaratri (first three days in her gentle aspect)"
    },
    {
      "id": "kali",
      "name": "Kali",
      "title": "Goddess of Time, Death, and Liberation",
      "group": "devi",
      "description": "The dark goddess. Her name comes from kala — time — and she is time's most terrifying face: the force that devours everything, the black that existed before creation and will remain after destruction. She sprang from the brow of Durga during the battle against the demon Raktabija, whose every drop of spilled blood spawned a new demon. Kali solved the problem by drinking the blood before it touched the ground, devouring each clone as it formed, and then she kept going — slaughtering demons across the battlefield until her fury consumed her own awareness. She danced the Tandava of destruction, her necklace of fifty skulls (one for each letter of the Sanskrit alphabet — language itself strung around her neck) swinging wildly, her skirt of severed arms flailing, her dark tongue lolling out to drink the world. The gods could not stop her. Only Shiva could: he lay down in her path, and when she stepped on his chest, she recognized her husband and stopped — tongue out in shock or shame, depending on the telling. That image — Kali standing on Shiva — is one of the most recognizable in all of Hindu iconography. She is worshipped not despite her terror but because of it: she strips away ego, illusion, and the fear of death. Her devotees in Bengal and Assam adore her as Ma Kali — the mother who destroys only what needs destroying.",
      "animals": ["Jackal", "Crow", "Black dogs"],
      "colors": ["Black", "Dark blue", "Red"],
      "weapons": ["Scimitar (khadga)", "Severed head (of ego)", "Bowl catching blood", "Blessing gesture (abhaya mudra)"],
      "consorts": ["Shiva (whom she stands upon)"],
      "birthCreation": "Emerged from the furious brow of Durga during the battle against the demon Raktabija. In some Shakta traditions, she is the primordial darkness that existed before creation — not born but eternal.",
      "holidays": "Kali Puja (same night as Diwali in Bengal); Navaratri (seventh night); Shyama Puja"
    },
    {
      "id": "durga",
      "name": "Durga",
      "title": "The Invincible Warrior Goddess",
      "group": "devi",
      "description": "The warrior goddess who exists because the gods failed. The buffalo demon Mahishasura had obtained a boon that no man and no god could kill him — so he conquered heaven, drove out the devas, and ruled unopposed. Brahma, Vishnu, Shiva, and all the gods pooled their rage, and from that collective divine fury a woman took form: Durga, whose name means 'the invincible' or 'the one beyond reach.' Each god gave her a weapon — Shiva's trident, Vishnu's discus, Vayu's bow, Agni's spear, Indra's thunderbolt, Yama's staff, Varuna's noose, Surya's arrows — filling her ten arms. Himavan gave her a lion (or tiger) to ride. She fought Mahishasura across nine nights as he shapeshifted through forms — buffalo, lion, elephant, man — and on the tenth night she pinned him as he emerged from his buffalo form and drove her trident through him. That tenth day is Vijayadashami, the Day of Victory, still celebrated across India. Durga Puja in Bengal and eastern India is one of the largest festivals on earth — her painted clay images, ten-armed and radiant on her lion, are carried through the streets and immersed in rivers. She represents shakti — divine feminine power — not as complement to the masculine but as the force that succeeds where the masculine cannot.",
      "animals": ["Lion", "Tiger"],
      "colors": ["Red", "Orange", "Gold"],
      "weapons": ["Trishula (trident, from Shiva)", "Sudarshana Chakra (discus, from Vishnu)", "Thunderbolt (from Indra)", "Bow (from Vayu)", "Spear (from Agni)", "Sword", "Shield", "Lotus", "Conch", "Noose (from Varuna)"],
      "consorts": ["Shiva (in her aspect as Parvati)"],
      "birthCreation": "Formed from the combined rage and energy of all the gods when no single deity — male or female — could defeat the buffalo demon Mahishasura. She is shakti made manifest for a purpose.",
      "holidays": "Durga Puja / Navaratri (nine nights of worship); Vijayadashami / Dussehra (tenth day — the victory)"
    },
    {
      "id": "ganesha",
      "name": "Ganesha",
      "title": "Remover of Obstacles, Lord of Beginnings",
      "group": "deva",
      "description": "The elephant-headed god, worshipped before every undertaking — before prayers, journeys, business ventures, exams, weddings, and the writing of books. His origin is strange and violent: Parvati shaped a boy from turmeric paste (or sandalwood) and breathed life into him to stand guard while she bathed. When Shiva returned and the boy refused him entry, Shiva — not knowing the child was his — cut off his head in rage. Parvati's grief shook the cosmos. To restore the boy, Shiva sent his ganas to bring back the head of the first living creature they found sleeping with its head pointing north. They returned with an elephant's head, and Shiva placed it on the child's body and brought him back to life, declaring him Ganapati — lord of the ganas, leader of the celestial hosts. He rides a mouse — the tiny creature that gnaws through any barrier, symbolizing the ability to penetrate the tightest spaces and overcome the most unlikely obstacles. His large belly contains the entire universe. His broken tusk was snapped off and used as a pen to write the Mahabharata as the sage Vyasa dictated it — the scribe of the longest epic ever composed. He loves modaka, sweet rice dumplings, and every offering begins with him. No prayer reaches any god without passing through Ganesha first.",
      "animals": ["Mouse (Mushika)", "Elephant"],
      "colors": ["Red", "Orange", "Yellow"],
      "vegetation": ["Durva grass", "Modaka (sweet dumpling — his sacred offering)"],
      "weapons": ["Broken tusk (used as pen)", "Axe (parashu)", "Noose (pasha)", "Modaka (sweet)"],
      "consorts": ["Siddhi (spiritual power)", "Buddhi (wisdom)", "Riddhi (prosperity) — varies by tradition"],
      "birthCreation": "Created by Parvati from turmeric paste and animated by her breath. Beheaded by Shiva, who did not know the boy was his son, then restored with the head of an elephant. Declared lord of all beginnings.",
      "holidays": "Ganesh Chaturthi (ten-day festival, immersion of clay idols in water); invoked at the start of every Hindu ceremony"
    },
    {
      "id": "kartikeya",
      "name": "Kartikeya",
      "title": "God of War and Victory",
      "group": "deva",
      "description": "The divine general, commander of the armies of the gods, born to destroy the demon Tarakasura who could only be killed by a son of Shiva. But Shiva was lost in meditation and had no son — so the gods conspired to create the conditions for his birth. The fire god Agni carried Shiva's seed, which passed through the river Ganga and was nurtured by the six Krittikas (the Pleiades), and the child was born with six heads — one for each mother — and twelve arms. His six faces see in all directions; nothing escapes his awareness in battle. He is also called Murugan, Skanda, Subrahmanya, and Shanmukha. He rides the peacock Paravani, who was once a demon he defeated and transformed into his mount — evil conquered and made to serve. His weapon is the Vel, the divine lance given to him by Parvati, which represents the power of shakti channeled into a single piercing point of focus. In South India — particularly Tamil Nadu — his worship predates and in some ways surpasses the northern Shaivite tradition. The Thaipusam festival, where devotees pierce their bodies with hooks and skewers in devotion to Murugan, is one of the most intense acts of embodied faith in any living religion. He is the eternal youth, the bachelor warrior, though some traditions give him two wives: Devasena (the celestial army) and Valli (a tribal hunter's daughter he courted in disguise).",
      "animals": ["Peacock (Paravani)"],
      "colors": ["Red", "Saffron"],
      "vegetation": ["Lotus"],
      "weapons": ["Vel (divine lance)", "Bow and arrow", "Discus", "Mace"],
      "consorts": ["Devasena (also called Devayani)", "Valli"],
      "birthCreation": "Born from Shiva's seed, carried by Agni, nurtured by Ganga, raised by the six Krittikas (Pleiades). Has six heads, one for each celestial mother. Created specifically to destroy the demon Tarakasura.",
      "holidays": "Thaipusam (body-piercing devotion, especially in Tamil Nadu and Malaysia); Skanda Shashti; Panguni Uthiram"
    },
    {
      "id": "hanuman",
      "name": "Hanuman",
      "title": "The Immortal Devotee",
      "group": "deva",
      "description": "The monkey god, the perfect servant, the embodiment of bhakti — devotion so total it becomes supernatural power. Son of Vayu, the wind god, and the apsara Anjana, he was born with the strength to leap to the sun. As a child he mistook the sun for a ripe fruit and jumped toward it; Indra struck him with a thunderbolt, breaking his jaw (Hanuman means 'one with a broken jaw'), and the enraged Vayu withdrew all air from the world until the gods apologized and blessed the child with invulnerability, immortality, and shapeshifting. He is Rama's greatest ally in the Ramayana: when Sita was abducted by the demon king Ravana and taken to Lanka, Hanuman leapt across the ocean in a single bound, found her imprisoned in Ravana's garden, burned Lanka to the ground with his tail set ablaze, and returned to report her location. When Lakshmana lay dying on the battlefield, Hanuman flew to the Himalayas for the healing herb Sanjeevani — and unable to identify which plant it was, he lifted the entire mountain and carried it back. When asked to show the depth of his devotion, he tore open his own chest to reveal Rama and Sita seated in his heart. He is immortal — one of the chiranjivis, the deathless ones — and is said to be present wherever the Ramayana is recited. Wrestlers, soldiers, and athletes pray to him. His image guards doorways across India. He represents the paradox of divine strength in perfect submission: the most powerful being in the room, who wants only to serve.",
      "animals": ["Monkey"],
      "colors": ["Orange", "Saffron", "Red"],
      "vegetation": ["Sanjeevani herb (he carried the whole mountain)"],
      "weapons": ["Gada (mace)", "Mountain (carried it whole)", "His own tail (set it on fire to burn Lanka)"],
      "consorts": [],
      "birthCreation": "Son of Vayu (the wind god) and Anjana (an apsara cursed to be born as a monkey). Struck by Indra's thunderbolt as a child, blessed by all the gods with invulnerability and immortality as compensation.",
      "holidays": "Hanuman Jayanti (his birthday); every Tuesday and Saturday are his days; Ramayana recitations"
    },
    {
      "id": "indra",
      "name": "Indra",
      "title": "King of the Devas, Lord of Thunder",
      "group": "deva",
      "description": "Chief of the Vedic gods, ruler of Svarga (heaven), lord of storms, rain, and war. In the earliest layers of Hindu scripture — the Rig Veda — he was the supreme deity, invoked more than any other god, the dragon-slayer who killed the serpent Vritra to release the waters of life. He wields the vajra, the thunderbolt forged from the bones of the sage Dadhichi, and rides the four-tusked white elephant Airavata, who emerged from the churning of the ocean. He has a thousand eyes — in some tellings, a punishment for seducing the sage Gautama's wife Ahalya, whose husband cursed him with a thousand marks of shame that the gods later transformed into eyes. He rules from his celestial court surrounded by apsaras (divine dancers) and gandharvas (celestial musicians), dispensing rain to the faithful and withholding it from the wicked. Yet as the tradition evolved from Vedic to Puranic, Indra diminished. The Trimurti — Brahma, Vishnu, Shiva — eclipsed him. In later stories he is often humbled: Krishna lifted Mount Govardhana to shelter the villagers when Indra sent a punishing storm, and the cowherd boy held the mountain on one finger for seven days until the king of heaven relented. His decline is itself mythic — the warrior king of an older age giving way to the cosmic principles of a more philosophical one.",
      "animals": ["Airavata (white elephant)", "Horse"],
      "colors": ["White", "Gold"],
      "metals": ["Gold"],
      "weapons": ["Vajra (thunderbolt)", "Bow (Indra's rainbow)", "Sword", "Net (Indrajala)"],
      "consorts": ["Shachi (Indrani)"],
      "birthCreation": "Son of Aditi (mother of the gods) and the sage Kashyapa. In the Rig Veda, he was born fully grown and immediately seized the soma, the divine drink that fueled his battle against the cosmic serpent Vritra.",
      "holidays": "Indra Jatra (Nepal); historically propitiated for monsoon rains"
    },
    {
      "id": "agni",
      "name": "Agni",
      "title": "God of Fire and Sacrifice",
      "group": "deva",
      "description": "The god who is fire itself — not a deity who controls fire, but fire personified, present in every flame. He has two faces: one benevolent, one destructive. Seven red tongues of flame serve as his mouths, each with a name — Kali (black), Karali (fierce), Manojava (swift as thought), Sulohita (red), Sudhumravarna (smoke-colored), Sphulingini (scattering sparks), and Vishvaruchi (universally pleasing). He is the messenger between gods and humans: every Vedic sacrifice passes through fire to reach the gods. When a priest pours ghee into the sacred fire and chants the mantras, it is Agni who carries the offering upward. He is second only to Indra in the number of Rig Vedic hymns addressed to him — and arguably more important, because without fire there is no sacrifice, and without sacrifice the cosmic order breaks down. He dwells in three forms: as fire on earth, as lightning in the atmosphere, and as the sun in heaven. He witnesses marriages — the couple walks seven times around the sacred fire (saptapadi), and their vows are made to Agni, not to each other. He is ever-young because he is reborn every time a fire is lit. His vehicle is the ram, and his banner bears smoke.",
      "animals": ["Ram", "Goat"],
      "colors": ["Red", "Orange", "Gold"],
      "weapons": ["Flaming spear", "Axe", "Torch", "Fan (to spread flames)"],
      "consorts": ["Svaha (every offering to fire ends with her name — 'Svaha!')"],
      "birthCreation": "Born in three places simultaneously: from heaven as lightning, from the friction of fire-sticks on earth, and from the waters as submarine fire. In some hymns he is the son of Dyaus (Sky) and Prithvi (Earth). He is reborn each time fire is kindled.",
      "dayTime": "Tuesday in some Vedic reckoning — associated with Mars (Mangala) as a fiery deity",
      "holidays": "Agni is present at every Vedic sacrifice (yajna); Havan ceremonies; Holika Dahan (the bonfire night before Holi)"
    },
    {
      "id": "surya",
      "name": "Surya",
      "title": "The Sun God",
      "group": "deva",
      "planet": "Sun",
      "description": "The visible god — the one deity every human being can see with their own eyes every day. He rides a chariot drawn by seven horses, one for each day of the week (or each color of the visible spectrum, or each of the seven meters of Vedic poetry — the metaphor layers). His charioteer is Aruna, the god of dawn, who sits facing backward — driving toward the sun while looking away from it, because even the dawn cannot face the full radiance. Surya's light is not merely physical; it is consciousness itself, the inner light of awareness that the Gayatri Mantra — the most sacred verse in Hinduism — invokes each morning. His wife Sanjna could not bear his brilliance and created a shadow-self (Chhaya) to take her place; when Surya discovered the substitution, her father Vishvakarma shaved away an eighth of his radiance, and from the shavings forged the discus of Vishnu, the trident of Shiva, and the lance of Kartikeya. He is father of Yama (death), Shani (Saturn), the Ashvini twins (divine physicians), Manu (the first man), and Karna (the tragic warrior of the Mahabharata, born wearing golden armor made from his father's light). The Sun Temple at Konark in Odisha, shaped as a colossal chariot with twelve stone wheels, is one of the great architectural achievements of the medieval world. In the Navagraha system of Vedic astrology, Surya governs the soul, authority, vitality, and the father.",
      "animals": ["Seven horses (chariot)", "Lion"],
      "colors": ["Gold", "Red", "Orange"],
      "metals": ["Gold", "Ruby (associated gemstone)"],
      "vegetation": ["Arka plant (calotropis)", "Red lotus", "Wheat"],
      "weapons": ["Radiant crown", "Lotus", "Golden chariot"],
      "consorts": ["Sanjna (Saranyu)", "Chhaya (the shadow wife)"],
      "birthCreation": "Son of Aditi (mother of the gods) and the sage Kashyapa. One of the twelve Adityas — solar deities. In the Rig Veda, he is the eye of the universe, placed in the sky by the cosmic order.",
      "dayTime": "Sunday (Ravivara — Ravi is another name for Surya)",
      "holidays": "Makar Sankranti (sun's northward journey); Chhath Puja (worship of the setting and rising sun); Ratha Saptami (celebration of Surya's chariot)"
    }
  ]
}
