{
  "id": "inca",
  "name": "The Inca Gods",
  "description": "The principal deities of the Inca pantheon, anchored to Lake Titicaca — the sacred body of water at 3,812 meters above sea level on the Altiplano where, according to Inca cosmology, creation itself began. From its waters Viracocha summoned the sun, moon, and stars, and from its islands he fashioned the first human beings. The Inca cosmos divided into three interpenetrating realms — Hanan Pacha (the upper world of celestial gods and ancestors), Kay Pacha (this world of the living), and Ukhu Pacha (the inner world of the dead, seeds, and subterranean forces) — and the deities who governed them formed a living bureaucracy of reciprocity: humans fed the gods through sacrifice and ritual, and the gods sustained the empire with sunlight, rain, and fertile earth.",
  "deities": [
    {
      "id": "viracocha",
      "name": "Viracocha",
      "title": "The Creator God",
      "group": "creator",
      "description": "Supreme creator deity of the Inca world, the one who existed before anything else and from whom all other gods, the earth, and humanity descend. His full ceremonial name — Apu Qun Tiqsi Wiraqucha — means roughly 'lord, foundation of all, sacred power,' and he operated on a scale beyond the other gods: they governed specific domains, but he made the domains themselves. According to the origin cycle recorded by Spanish chroniclers from Inca oral tradition, Viracocha rose from the depths of Lake Titicaca in a time of primordial darkness. He created the sun and commanded it to rise over the Island of the Sun (Isla del Sol) in the lake, then made the moon and the stars, establishing Hanan Pacha. He fashioned the first humans from stone at Tiwanaku, near the lake's southern shore, breathing life into them and assigning each nation its language, songs, clothing, and seeds. When those first people displeased him, he destroyed them with a great flood — the Unu Pachakuti — and began again, calling forth new peoples from caves, springs, and stones across the Andes. Having set creation in motion, he walked northwest across the highlands and out over the Pacific Ocean at Manta, Ecuador, disappearing over the waves — a departing creator who leaves the world in the hands of his children. He belongs to Hanan Pacha but his act of creation links all three realms. The Inca emperor Pachacuti built the great Qorikancha temple in Cusco partly in his honor, and his image — a weeping god with rays emanating from his head — appears carved on the Gateway of the Sun at Tiwanaku, the pre-Inca site near Lake Titicaca whose ruins the Incas folded into their own cosmology.",
      "animals": ["Condor", "Puma"],
      "colors": ["Gold", "White"],
      "consorts": ["Mama Cocha (in some traditions)"],
      "weapons": ["Staff of creation", "Lightning (in some accounts)"]
    },
    {
      "id": "pachamama",
      "name": "Pachamama",
      "title": "Earth Mother",
      "group": "creator",
      "description": "The living earth itself — not a goddess who rules the land, but the land as a conscious, breathing, reciprocal being. Pachamama is the ground beneath the terraced fields, the body of the mountains, the fertility of the soil, and the force that makes seeds split and push upward into the Andean sun. She is the most persistently worshipped deity in the Inca system, surviving the Spanish conquest, the suppression of indigenous religion, and five centuries of colonial and postcolonial change to remain a daily presence in Quechua and Aymara life across Peru, Bolivia, Ecuador, and northern Argentina. In Inca cosmology she is Kay Pacha embodied — this world, the middle realm, the plane where humans, animals, and plants live and die. She demands ayni — reciprocity. Before drinking chicha (corn beer), the first pour goes to the ground for Pachamama. Before planting, offerings of coca leaves, llama fat, and small figurines are buried in the earth. During the festival of Pachamama Raymi in August — when the earth is cold and hungry after harvest — communities across the Andes prepare elaborate despacho offerings, burning bundles of symbolic gifts so the smoke carries their gratitude upward while the ashes feed the soil below. Her relationship to the other deities is maternal and foundational: Inti warms her surface, Illapa waters her with rain, and Mama Cocha feeds her rivers, but without Pachamama's willingness to receive and transform, none of it sustains life. Around Lake Titicaca, where agriculture at nearly 4,000 meters requires extraordinary cooperation between humans and earth, her cult has always been especially strong. She is not gentle by default — earthquakes and landslides are her displeasure. She gives because she is given to. That is the oldest theology in the Andes.",
      "animals": ["Llama", "Alpaca", "Serpent"],
      "colors": ["Green", "Brown", "Gold"],
      "vegetation": ["Coca", "Potato", "Quinoa", "Maize"],
      "consorts": ["Pachacamac (in coastal traditions)", "Inti (in highland traditions)"]
    },
    {
      "id": "pachacamac",
      "name": "Pachacamac",
      "title": "Earth Shaker",
      "group": "creator",
      "description": "God of earthquakes, fire, and creation — a deity whose name means 'animator of the earth' or 'he who gives life to the world,' and whose cult center on the coast south of Lima was one of the most important oracle sites in pre-Columbian South America. Pachacamac predates the Inca empire by more than a millennium; his great adobe temple complex near the mouth of the Lurín River was already ancient when the Incas incorporated his worship into their state religion in the fifteenth century. In the coastal mythology recorded by early Spanish observers, Pachacamac was a rival or complement to Viracocha: where Viracocha created from Lake Titicaca in the highlands, Pachacamac animated the world from the coast. In one cycle, he destroyed the first creations of another god (Con, or Viracocha himself in some tellings), turned the original humans into monkeys, and created a new humanity from scratch. He then produced the first food plants and taught irrigation. His power expressed itself most terrifyingly through earthquakes — when Pachacamac moved, the earth shook, and the coastal peoples lived in acute awareness that the ground was not solid but alive and restless. His oracle at the temple complex of Pachacamac was consulted by pilgrims from across the Andes and the coast; people traveled hundreds of kilometers to ask questions of the priests who interpreted the idol's responses. When the Incas conquered the coast, they did not destroy his temple — they built a Temple of the Sun alongside it, grafting Inti's highland cult onto Pachacamac's coastal power. He connects all three realms: his earthquakes come from Ukhu Pacha, his temple sits in Kay Pacha, and his creative power links him to the Hanan Pacha order. Near Lake Titicaca, he is less prominent than Viracocha, but the theological tension between highland creator and coastal animator shaped the empire's religious politics.",
      "animals": ["Fox", "Condor"],
      "colors": ["Red", "Black", "Ochre"],
      "weapons": ["Earthquakes", "Fire"],
      "consorts": ["Pachamama (in some coastal traditions)", "Urpay Wachaq (goddess of fish and sea birds)"]
    },
    {
      "id": "inti",
      "name": "Inti",
      "title": "The Sun God",
      "group": "celestial",
      "description": "The Sun — supreme deity of the Inca state religion, divine ancestor of the Sapa Inca (emperor), and the most politically powerful god in Tawantinsuyu, the Inca empire. Inti was the son of Viracocha, called forth from the Island of the Sun in Lake Titicaca to illuminate a world that had been in darkness. That island — Isla del Sol in modern Bolivia — became one of the holiest pilgrimage sites in the Andes: the Incas built a temple complex there, and the rock from which Inti was believed to have risen (the Titikala, or Sacred Rock) was draped in fine cloth and attended by priests and chosen women (acllas). The Sapa Inca was Inti's direct descendant, the 'son of the Sun,' and this genealogy was the theological foundation of imperial authority. The Qorikancha in Cusco — the Temple of the Sun — was the spiritual center of the empire, its interior walls lined with sheets of gold to reflect sunlight, its garden planted with life-sized gold and silver replicas of maize, llamas, and flowers. From the Qorikancha, ceque lines radiated outward across the landscape like spokes of a wheel, organizing hundreds of huacas (sacred sites) into a vast ritual geography. Inti Raymi, the Festival of the Sun, was the most important celebration in the Inca calendar — held at the June solstice (winter in the southern hemisphere), when the sun was farthest from the earth and needed to be called back. Thousands gathered in Cusco's main plaza; llamas were sacrificed, chicha flowed, and the Sapa Inca himself led the ceremony facing the rising sun. Inti's golden face — a radiant disk with a human visage — was the central icon of the empire. He governed Hanan Pacha alongside his consort Mama Killa, the moon, and their celestial pairing mirrored the Sapa Inca and the Coya (queen) on earth. At Lake Titicaca, where the sun first rose from water, Inti's origin story and the origin of the Inca dynasty are the same story told twice.",
      "animals": ["Condor", "Llama (white llamas sacred to him)"],
      "colors": ["Gold", "Yellow"],
      "metals": ["Gold"],
      "weapons": ["Solar rays", "Golden staff (tapac-yauri)"],
      "consorts": ["Mama Killa"],
      "holidays": "Inti Raymi — the Festival of the Sun at the June solstice, the most important ceremony in the Inca calendar. Revived in modern Cusco as an annual public celebration every June 24."
    },
    {
      "id": "mama-killa",
      "name": "Mama Killa",
      "title": "Moon Goddess",
      "group": "celestial",
      "description": "Goddess of the moon, wife and sister of Inti, mother of the Inca people, and guardian of the calendar, marriage, and the menstrual cycle. Where Inti was gold, Mama Killa was silver — her temple walls in the Qorikancha were lined with silver sheets, and her image was a great silver disk with a woman's face. She governed time in its most intimate form: the lunar month, the planting cycle, the rhythm of women's bodies, and the festivals that punctuated the agricultural year. Lunar eclipses terrified the Inca because they believed a great serpent or puma was attacking Mama Killa — during eclipses, people shouted, beat drums, threw spears at the sky, and made dogs howl to frighten the predator away. If the moon were devoured, time itself would stop. In the origin cycle at Lake Titicaca, Viracocha created her after Inti, setting her in the sky as the night's ruling light. Her tears were silver, and silver was considered her sacred metal throughout the empire — just as gold belonged to Inti. She was the protectress of married women and the patroness of the Coya (the queen), who was considered her earthly representative, just as the Sapa Inca embodied Inti. The festival of Coya Raymi, held at the September equinox, was her celebration — a time of purification, when illness and evil were ritually driven from Cusco. She dwells in Hanan Pacha with Inti, and the interplay of sun and moon — gold and silver, male and female, day and night — structured the fundamental dualism (yanantin) at the heart of Inca thought. At Titicaca, her silver light on the water's surface was understood as a visible sign of divine presence.",
      "animals": ["Fox (associated with lunar mythology)", "Serpent (eclipse predator)"],
      "colors": ["Silver", "White"],
      "metals": ["Silver"],
      "consorts": ["Inti"],
      "holidays": "Coya Raymi — the festival of the queen and the moon at the September equinox, dedicated to purification and the driving out of illness from Cusco."
    },
    {
      "id": "illapa",
      "name": "Illapa",
      "title": "God of Thunder and Lightning",
      "group": "celestial",
      "description": "God of thunder, lightning, rain, and storms — the third most important deity in the Inca state pantheon after Inti and Viracocha. Illapa (also called Ilyap'a or Chuqui Illa) was envisioned as a man in the sky dressed in shining garments, carrying a war club in one hand and a sling in the other. The crack of his sling was thunder. The flash of his swing was lightning. The stone from his sling shattered a great jug of water held by his sister — and the water that poured from the broken vessel was rain. His sling-stones that struck the earth became thunderstones (chuqui illa), smooth river-worn stones that were collected as huacas and kept in shrines across the empire. He was a warrior god, and his temple in the Qorikancha stood alongside those of Inti, Mama Killa, and Viracocha — only the most important deities received space in that sanctum. The Incas prayed to Illapa for rain, and in times of drought, they tied black llamas in the sun without water so their suffering and thirst would move him to send storms. He connected Hanan Pacha to Kay Pacha in the most dramatic way possible — lightning physically bridging heaven and earth — and his bolts were understood as divine communication, terrifying and fertile at once. People struck by lightning were considered chosen; the places where lightning struck became sacred. Around Lake Titicaca, where afternoon thunderstorms roll across the Altiplano with extraordinary violence, Illapa's presence was felt daily during the wet season. The storms that build over the lake — clouds piling thousands of meters above the water, lightning walking across the surface — made his worship there immediate and visceral. He was also associated with the Milky Way, which the Incas called Mayu (the River), because it was the celestial river from which Illapa drew the water he cast down as rain.",
      "animals": ["Puma", "Serpent (lightning form)"],
      "colors": ["White (lightning)", "Dark gray (storm clouds)"],
      "weapons": ["Sling", "War club", "Thunderstones (chuqui illa)"],
      "holidays": "Invoked during agricultural ceremonies and drought rituals. Black llamas were tied in the sun without water to petition him for rain."
    },
    {
      "id": "chaska",
      "name": "Ch'aska",
      "title": "Goddess of Dawn (Venus)",
      "group": "celestial",
      "description": "Goddess of the dawn, twilight, and the planet Venus — the brilliant light that appears before sunrise and after sunset, bridging day and night. Ch'aska (also Ch'aska Quyllur, meaning 'shaggy star' or 'tangled star,' named for Venus's radiant, shimmering appearance near the horizon) was the handmaiden of Inti, running ahead of the sun each morning to announce his arrival and lingering after him each evening to mark his departure. She was associated with beauty, youth, flowers, and young women — the maidens and princesses of the Inca court were placed under her protection. The acllas, the chosen women who served in the temples, were sometimes called 'daughters of Ch'aska' for their role as attendants to the solar cult. Venus's dual appearance as morning star and evening star gave her a liminal quality: she belonged to both day and night, both Hanan Pacha and the threshold of Ukhu Pacha, both the world of the living and the transition into darkness. Inca astronomers tracked Venus's cycles with precision, and its appearances and disappearances correlated with agricultural planning and ceremonial timing. The Incas recognized Venus as a single body appearing in two guises — a level of astronomical understanding shared by few ancient cultures. Around Lake Titicaca, where the high altitude and thin atmosphere make Venus extraordinarily bright, Ch'aska blazes in the pre-dawn and post-sunset sky with an intensity that lowland observers rarely experience. She appears reflected in the still surface of the lake, doubled — one star in the sky, one in the water — a visible manifestation of the Inca principle of yanantin, the complementary pairing that structures the cosmos.",
      "animals": ["Hummingbird", "Butterfly"],
      "colors": ["Pink", "Gold", "White"],
      "vegetation": ["Flowers (general — she is patroness of blossoms and gardens)"],
      "consorts": ["Attendant to Inti (not paired as a consort)"]
    },
    {
      "id": "mama-cocha",
      "name": "Mama Cocha",
      "title": "Mother of the Sea",
      "group": "earthly",
      "description": "Goddess of the sea, lakes, rivers, and all bodies of water — the great mother of waters who sustains fishermen, calms storms, and feeds the rivers that flow from the Andes to the coast. Mama Cocha (also Mama Qucha) was the feminine counterpart to the terrestrial Pachamama: where Pachamama was the solid earth, Mama Cocha was every form of water that moved across and through it. She was especially revered by coastal peoples and fishing communities, who depended on her goodwill for their survival, but her presence extended throughout the empire because every river, spring, and lake was understood as an expression of her body. Lake Titicaca — the highest navigable lake in the world, sacred origin point of Inca creation — was her most exalted manifestation. The lake was not merely associated with her; in a real theological sense, it was her. The Uru people, who lived on floating reed islands in the lake, existed literally on her surface, and the totora reeds they harvested were gifts from her waters. Mama Cocha was sometimes described as Viracocha's consort, which makes theological sense: if Viracocha rose from Lake Titicaca to create the world, then she was the primordial depth from which creation emerged. She governed the creatures of the water — fish, whales, sea birds — and fishermen made offerings of chicha and coca to her before setting out. In the three-realm cosmology, she flowed through all levels: rain fell from Hanan Pacha through Illapa's storms, rivers ran across Kay Pacha, and underground waters connected to Ukhu Pacha. She was the circulatory system of the Inca cosmos. At Lake Titicaca, where water and sky merge at the horizon and the deep blue surface reflects the clouds so perfectly that up and down lose meaning, Mama Cocha's theological identity as the medium through which all realms communicate becomes physically visible.",
      "animals": ["Whale", "Fish", "Sea birds", "Frog"],
      "colors": ["Blue", "Deep green", "Silver"],
      "vegetation": ["Totora reeds", "Seaweed"],
      "consorts": ["Viracocha (in some traditions)"]
    },
    {
      "id": "supay",
      "name": "Supay",
      "title": "God of the Underworld",
      "group": "earthly",
      "description": "God (or lord) of Ukhu Pacha, the inner world — the realm beneath the earth's surface where the dead reside, seeds germinate, and mineral wealth accumulates in darkness. Supay is the most misunderstood deity in the Inca pantheon, because Spanish missionaries seized on his association with death and the underground to equate him with the Christian Devil — a conflation that distorted his original character beyond recognition. In pre-conquest Inca thought, Ukhu Pacha was not hell. It was the interior — the womb of the earth, the space where transformation happens out of sight. Seeds descend into it and return as plants. The dead descend into it and join the ancestors. Minerals form in its darkness and are brought to the surface as gold and silver. Supay governed this realm, and his nature was ambivalent rather than evil: he demanded respect and offerings but was not malevolent in the Christian sense. The Incas made offerings to him — particularly during mining, when they were entering his domain and extracting his wealth. Miners in the Andes still make offerings to a figure called 'El Tio' (the Uncle) deep in the mines — a practice that descends directly from Supay's cult, filtered through centuries of Catholic syncretism. The figure in the mines is given cigarettes, coca leaves, and alcohol; he is feared and respected, not worshipped as good or condemned as evil, but acknowledged as the power whose territory you have entered. During the colonial period, the Spanish used Supay's name as their translation for Satan, and the Diablada — the spectacular Devil Dance performed during the Carnival of Oruro near Lake Titicaca in Bolivia — represents the ongoing negotiation between indigenous underworld theology and Catholic demonology. The dancers wear enormous horned masks and elaborate costumes, and the dance narrates the Archangel Michael's victory over the devils — but the energy, the masks, and the underground symbolism belong to Supay's world. At Lake Titicaca, where the mines of Potosi and Oruro are geographically and culturally close, Supay's presence connects the shining surface of the sacred lake to the dark interior of the mountains that ring it.",
      "animals": ["Serpent", "Toad", "Bat"],
      "colors": ["Black", "Red", "Dark earth tones"],
      "weapons": ["Darkness", "The weight of the earth"],
      "holidays": "Carnival of Oruro (Diablada) — the Devil Dance near Lake Titicaca, a syncretic festival where Supay's underworld power meets Catholic iconography in one of South America's most spectacular ritual performances. UNESCO Intangible Cultural Heritage."
    },
    {
      "id": "apus",
      "name": "Apus",
      "title": "Mountain Spirits",
      "group": "earthly",
      "description": "The mountain spirits — divine beings who inhabit the peaks of the Andes and serve as protectors, ancestors, and territorial guardians for the communities that live in their shadow. The Apus are not a single god but a class of powerful spirits, each associated with a specific mountain, and their hierarchy mirrors the hierarchy of the peaks themselves: the highest mountains — Ausangate, Salcantay, Illimani, the great cordillera — are the most powerful Apus, while lesser hills and ridges have their own local spirits of proportionate influence. They are Kay Pacha beings whose summits touch Hanan Pacha — intermediaries between the human world and the upper realm, which is why mountaintop offerings (carried to the peaks by paqos, Andean ritual specialists) are among the most potent forms of Inca prayer. The Incas practiced capacocha — the sacrifice of children on high mountain summits — as the ultimate offering to the Apus and through them to Inti and Viracocha. The mummified remains of these children, preserved by the extreme cold, have been found on peaks above 6,000 meters, dressed in fine textiles and surrounded by gold and silver figurines. The most famous, Juanita (the 'Ice Maiden'), was discovered on Ampato in 1995. Around Lake Titicaca, the Apus form the ring of peaks that enclose the Altiplano — the Cordillera Real in Bolivia and the ranges surrounding the lake create a natural amphitheater of sacred mountains, each with its own name, personality, and relationship to the communities below. Illimani, the great peak that towers over La Paz, is one of the most revered Apus in the southern Andes. The Apus are still actively worshipped: Quechua and Aymara communities make offerings to their local Apu before planting, before building, before any major undertaking. They are asked permission, shown respect, and fed with coca, chicha, and llama fat. They watch. They remember. They are the landscape as living intelligence.",
      "animals": ["Condor (messenger of the Apus)", "Puma", "Vicuna"],
      "colors": ["White (snow)", "Gray (stone)", "Blue (sky at altitude)"],
      "vegetation": ["Ichu grass", "Polylepis (high-altitude trees)"]
    },
    {
      "id": "ekkeko",
      "name": "Ekkeko",
      "title": "God of Abundance",
      "group": "earthly",
      "description": "God of abundance, prosperity, good fortune, and the household — a squat, cheerful figure loaded with miniature goods: tiny sacks of grain, small bundles of firewood, little houses, bags of money, baskets of food, bottles of drink, all hanging from his body or piled in his arms. Ekkeko is the most human-scaled deity in the Inca world, the god who cares not about cosmic creation or celestial warfare but about whether the family has enough to eat, whether the harvest will be good, whether the new house will stand. His origins are pre-Inca, rooted in the Tiwanaku culture that flourished near Lake Titicaca from roughly 500 to 1000 CE — small stone figures matching his description have been found at Tiwanaku archaeological sites, placing his cult among the oldest continuous religious traditions in the Andes. He belongs firmly to Kay Pacha, the everyday world, and his power operates through sympathetic magic: you give him miniatures of what you desire, and he brings the real thing. During the Alasita festival — held annually in La Paz, Bolivia, and across the Titicaca region, traditionally on January 24 — markets fill with tiny replicas of everything a person could want: miniature houses, cars, diplomas, passports, stacks of money, bags of rice, tools, suitcases for travel. People buy these miniatures, have them blessed by a yatiri (Aymara ritual specialist), and present them to their Ekkeko figures at home. The logic is direct: show the god of abundance a small version of your wish, and he will deliver the full-sized version. He is usually depicted smoking a cigarette — an offering placed between his lips — and if the cigarette stays lit, the wish will be granted. The Alasita festival was inscribed on the UNESCO Representative List of the Intangible Cultural Heritage of Humanity in 2017. Ekkeko's deep connection to Lake Titicaca is geographical and temporal: Tiwanaku, his likely place of origin, sits on the lake's southern shore, and the Alasita markets are most vibrant in the communities surrounding the lake. He represents the Andean theology of reciprocity at its most accessible — give a small thing with genuine intention, and the world gives back.",
      "animals": ["Llama (miniature figures often included)"],
      "colors": ["Bright multicolor (reflecting his loaded appearance)", "Red", "Yellow"],
      "vegetation": ["Coca leaves (offerings)", "Maize (miniature sacks)", "Potato (miniature sacks)"],
      "holidays": "Alasita — the festival of miniatures held annually in La Paz and across the Lake Titicaca region. Markets overflow with tiny replicas of desired goods, blessed and presented to Ekkeko. UNESCO Intangible Cultural Heritage since 2017."
    }
  ]
}