{
  "id": "inuit",
  "name": "The Inua",
  "description": "Inuit spirituality is not organized around temples or scriptures but around survival — the daily negotiation between human beings and an environment that can kill them in hours. At Ilulissat Icefjord on Greenland's west coast, the Sermeq Kujalleq glacier calves icebergs into Disko Bay at a rate visible to the naked eye, producing a fjord choked with cathedral-sized ice that groans, cracks, and rearranges itself in real time. The Earth here is not a metaphor for something alive. It is visibly, audibly alive, and Inuit theology developed accordingly. Every animal, every weather pattern, every stretch of ice possesses an inua — an indwelling spirit, an owner, an awareness — and the task of human life is to maintain right relationship with these presences through observance, gratitude, and the mediating work of the angakkuq (shaman). What Knud Rasmussen documented across the Arctic in the 1920s, and what Franz Boas recorded among the Central Eskimo decades earlier, is not a pantheon in the Greek or Hindu sense but a web of obligations between the human community and the conscious world it inhabits.",
  "deities": [
    {
      "id": "sila",
      "name": "Sila",
      "title": "The Breath of the World",
      "group": "supreme",
      "description": "Sila is not a god. This is the first and most important thing to understand, and the thing most Western accounts get wrong. Sila — sometimes Silap Inua, 'the owner of the weather' or 'the spirit of the air' — is closer to an intelligence that pervades everything: weather, breath, consciousness, the capacity for thought itself. Rasmussen, during his Fifth Thule Expedition (1921-24), recorded an Iglulik angakkuq named Aua explaining Sila as something felt but never seen, something that speaks through snowstorms and calm weather alike, something that is 'at once among us and infinitely far away.' Aua said: 'We do not believe. We fear.' This is not theology as proposition but as attention — a vigilance toward the intelligence of an environment where reading the weather incorrectly means death. At Ilulissat, where katabatic winds descend from the ice sheet with almost no warning and fog can erase visibility in minutes, Sila is not philosophical abstraction. It is the thing the hunter must read to come home alive. The concept has drawn comparison to the Polynesian mana and the Lakota wakan, but Sila is more specifically atmospheric — it is weather as consciousness, breath as the medium through which the world thinks. What does it mean to build an entire cosmology around the proposition that the air itself is aware? It means you pay attention to it. Every moment. With your life depending on the accuracy of your reading."
    },
    {
      "id": "sedna",
      "name": "Sedna",
      "title": "Goddess of the Sea and Marine Animals",
      "group": "supreme",
      "description": "Sedna's origin story is one of the most harrowing in world mythology, existing in dozens of regional variants — Nuliajuk among the Netsilik, Nerrivik in Greenland, Takánakapsâluk among the Iglulik. The core narrative, as documented by Boas and Rasmussen: a young woman is married to a stranger (sometimes a bird-spirit, sometimes a dog, sometimes a man who is not what he seems). Her father attempts rescue by kayak, but when a storm rises, he throws her overboard to save himself. She clings to the gunwale. He cuts off her fingers, joint by joint. Her first finger joints become seals. Her second joints become walruses. Her third joints become whales. She sinks to the bottom of the sea, ruling over all marine animals from a house of stone and bone. When humans violate taboos — hiding a miscarriage, breaking rules of sharing — the transgressions collect as tangles in Sedna's hair, which she cannot comb because she has no fingers. The tangles enrage her, and she withholds the animals. The angakkuq must journey to the sea floor, comb her hair, confess the community's sins, and soothe her. Only then do the seals return. The psychology is extraordinary: the entire community's food supply depends on a wounded woman's willingness to forgive, and forgiveness requires someone brave enough to descend to the place of original violence and tend to what was broken. At Ilulissat, where ringed seals still sustain the Greenlandic Inuit, Sedna is not a figure from the past."
    },
    {
      "id": "malina",
      "name": "Malina",
      "title": "The Sun (Sister)",
      "group": "celestial",
      "description": "In Inuit celestial mythology, the Sun is female and the Moon is male — a reversal of the pattern dominant in most Indo-European and Semitic traditions. Malina is the Sun, and her story is inseparable from her brother Anningan's. The narrative, documented by Rasmussen and by the Greenlandic folklorist Hinrich Rink in the 1860s, describes a terrible event: during a lamp-extinguishing game (a social gathering held in darkness), Malina was assaulted by a man she could not identify. She smeared her hands with soot and pressed them against her assailant's face. When the lamps were relit, she saw it was her brother. In horror and rage, she seized a torch and ran out of the qaggi (communal house) into the sky, becoming the Sun. Anningan seized his own torch and chased her, but his flame guttered and dimmed — he became the Moon, forever pursuing his sister across the sky, waxing and waning as he forgets to eat during the chase. This is a story about violation, recognition, and permanent separation — an origin myth for the fundamental celestial rhythm that is simultaneously an account of sexual violence and its consequences. At Ilulissat, above the Arctic Circle, Malina disappears entirely for weeks in winter and does not set in summer. Her absence and return structure the entire year. The polar night is Malina's refusal to be present, and the midnight sun is her refusal to leave — both read differently when you know why she ran."
    },
    {
      "id": "anningan",
      "name": "Anningan",
      "title": "The Moon (Brother)",
      "group": "celestial",
      "description": "Anningan — also rendered Alignak or Aningaaq depending on regional dialect — is the Moon, Malina's brother, the one who chased her into the sky and has never stopped chasing. His torch, grabbed in haste, burns unevenly, which is why the Moon waxes and wanes. In some versions recorded by Rasmussen, Anningan becomes so absorbed in the pursuit that he forgets to eat and grows thin (the waning Moon), then remembers and eats (the waxing Moon), in an endless cycle of hunger and satiation. Across the Arctic, the Moon holds associations that differ from European lunar symbolism. Among the Iglulik, Anningan governs tides, controls some animals, and has influence over human fertility — women who sleep in moonlight risk becoming pregnant by him. He is also associated with hunting success in some Canadian Inuit traditions, a protector of hunters and keeper of game souls. The moral complexity is the point: Anningan is not simply a villain. He is a perpetrator who became a cosmic force, and the culture did not resolve that tension by making him wholly evil or wholly redeemed. He simply is — circling, pursuing, waxing and waning, governing the tides and the rhythms of Arctic life regardless of what he did. At Ilulissat during the polar night, the Moon is the primary celestial light for weeks, reflecting off ice and snow to create the luminous blue darkness that defines the Arctic winter. The wrongdoer lights the way. The Inuit did not shy from that paradox."
    },
    {
      "id": "nanuk",
      "name": "Nanuk",
      "title": "The Great Polar Bear",
      "group": "nature",
      "description": "Nanuk — Nanuq in modern Inuktitut orthography — is the master spirit of polar bears, the most formidable animal in the Arctic. A polar bear can weigh over 700 kilograms, swim for days, and detect a seal through a meter of ice. Hunting one with traditional tools — harpoon, lance, dogs — was among the most dangerous things a human being could do. The Inuit understanding, documented by Rasmussen among the Iglulik and by Boas among the Baffin Islanders, was that Nanuk chose to be killed. The bear allowed the hunt if the hunter had observed proper conduct — sharing meat, treating animal remains correctly, speaking to the bear's spirit with respect. After a kill, specific rituals were required: fresh water poured into the dead bear's mouth (polar bears were understood to be perpetually thirsty), the skull placed facing inland so the spirit could return to the ice, tools left untouched for a prescribed period. These were not optional courtesies. They were the terms of a contract. If violated, Nanuk would warn other bears, and the hunter would find no game. At Ilulissat, polar bears still appear on the sea ice, swimming between icebergs in Disko Bay, and the Greenlandic Inuit relationship with them remains one of the most direct human-predator negotiations on Earth. Nanuk embodies a concept modern conservation struggles to articulate: the animal you hunt is not your inferior but your partner in a transaction, and the transaction has rules the animal enforces."
    },
    {
      "id": "amarok",
      "name": "Amarok",
      "title": "The Great Wolf",
      "group": "nature",
      "description": "Amarok is the great lone wolf of Inuit tradition — not a pack animal but a solitary, enormous wolf who hunts alone and preys on hunters foolish enough to travel solo at night. The figure appears across the central and western Arctic in accounts collected by Rasmussen and later by the Danish ethnographer William Thalbitzer. Unlike the European wolf, Amarok is not primarily a figure of evil. In several recorded narratives, Amarok serves a corrective function: he hunts the weak, the sick, and the caribou that would otherwise overbreed and exhaust the grazing — a theological anticipation of ecological balance predating Western conservation biology by centuries. In one widely told story, a boy too weak to hunt is taken by Amarok, who stretches and strengthens his limbs, trains him in endurance, and returns him to the community transformed into a capable hunter. The wolf as trainer, not just predator. This is a different wolf archetype than the one dominating European folklore, where the wolf is almost always the enemy of civilization. In the Arctic, where the line between human and animal survival strategies is thin — both hunt seals, both read ice, both need shelter from the same storms — the wolf is a parallel intelligence, not an opposing one. At Ilulissat, Arctic wolves are rare on the coast but present in the inland ice margins, and the howl of a wolf across the tundra at dusk operates on a frequency the human nervous system has never learned to ignore."
    },
    {
      "id": "tekkeitsertok",
      "name": "Tekkeitsertok",
      "title": "God of Caribou",
      "group": "nature",
      "description": "Tekkeitsertok — the master of caribou, the deer god — governs the animal that sustained inland Inuit life the way Sedna's seals sustained the coast. The caribou provided everything: meat, sinew for thread, antler for tools, hide for clothing and tent covers. The great caribou migrations — herds of hundreds of thousands moving across the tundra in seasonal waves — were the central event of the inland Inuit calendar, and Tekkeitsertok controlled whether the herds came or didn't. Rasmussen's informants described him as jealous and difficult to please: a hunter who showed disrespect to caribou remains, who mixed sea-mammal and land-mammal products in violation of taboo, or who boasted of his kills would find that Tekkeitsertok turned the herds away. The distinction between sea and land in Inuit cosmology is fundamental — Boas documented elaborate rules among the Central Eskimo requiring strict separation of caribou products from seal products, different seasons for processing each, different tools, different storage. Sedna governed the sea; Tekkeitsertok governed the land. To confuse the two was to insult both. In Greenland, caribou (tuttu) still migrate through the interior behind Ilulissat, and the autumn hunt remains a significant cultural and subsistence practice. Psychologically, Tekkeitsertok represents the dependency that inland peoples felt toward a single animal species — a relationship so total that the animal's spirit had to be elevated to divine status, because if it withdrew its cooperation, the people simply died."
    },
    {
      "id": "pinga",
      "name": "Pinga",
      "title": "Goddess of the Hunt, Fertility, and Medicine",
      "group": "spirit",
      "description": "Pinga is a figure primarily documented in the Caribou Inuit traditions of the central Canadian Arctic, recorded by Rasmussen during the Fifth Thule Expedition and later elaborated by Asen Balikci among the Netsilik. She oversees the hunt, governs fertility, and watches over the souls of the living — a combination of domains reflecting the Inuit understanding that taking life and creating life are aspects of the same cycle. Pinga is sometimes described as dwelling in the sky, sometimes as inhabiting the space between earth and sky, and she is invoked in matters of childbirth, healing, and the proper treatment of game animals. Her domain overlaps with Sedna's in ways that vary by region — in some traditions, Pinga manages the souls of land animals while Sedna manages the sea, creating a parallel governance structure that maps onto the coast/interior divide in Inuit economic life. What is striking about Pinga is her mediating function: she is neither the fearsome wounded goddess of the sea floor nor the impersonal intelligence of the weather. She is closer to a guardian — attentive, concerned with specific human welfare, responsive to prayer and right conduct. In traditions where the primary spiritual figures are Sila (too vast to address personally) and Sedna (too wounded to approach without shamanic intervention), Pinga provides something psychologically necessary: a divine figure who is approachable, who cares about the outcome of a particular pregnancy or a particular hunt, who listens without requiring a journey to the bottom of the ocean."
    },
    {
      "id": "torngarsoak",
      "name": "Torngarsoak",
      "title": "The Great Spirit",
      "group": "spirit",
      "description": "Torngarsoak — also Tornarsuk, Tornarssuit — is the master of the helping spirits (tuurngait) in the Greenlandic and Labrador Inuit traditions, documented by the Moravian missionaries who lived among the Labrador Inuit from the 1770s onward and by Hans Egede, the Danish-Norwegian missionary who established the first European settlement in Greenland in 1721. Torngarsoak is described as an enormous bear, or as a figure with one arm, or as an invisible presence who appears only to the angakkuq during trance. He is the chief of the spirit world — not a creator, not a moral judge, but the master of the spirit helpers that the shaman calls upon for healing, weather control, and communication with the dead. The Moravian accounts, filtered through Christian theological categories, sometimes cast Torngarsoak as a devil figure, which says more about the missionaries than about the spirit. In Inuit practice, Torngarsoak is the power source — the angakkuq's connection to him determines the shaman's effectiveness, and the spirits he governs (the tuurngait) are the operational tools of shamanic practice. At the Tornit ruins near Ilulissat — stone structures attributed to the Dorset-culture predecessors of the Inuit — the name itself connects to this spirit complex. The word 'torngaq' (helping spirit) is the root. Torngarsoak is the great torngaq, the one who governs all the others. Psychologically, he represents the infrastructure of spiritual practice: not the goal of the journey but the power that makes the journey possible, the engine behind the angakkuq's flights between worlds."
    },
    {
      "id": "qailertetang",
      "name": "Qailertetang",
      "title": "Weather Spirit and Guardian of Animals",
      "group": "spirit",
      "description": "Qailertetang — sometimes rendered Kailertetang or Qaillertetang — is a weather spirit documented in Greenlandic and eastern Canadian Inuit traditions, associated with storms, protective power, and the welfare of sea mammals. The figure appears in accounts collected by Rink and Rasmussen as a being who guards animals, controls weather patterns, and can be either benevolent or destructive depending on human conduct. In some narratives, Qailertetang is the spirit responsible for the crackling, shifting sounds of sea ice — the voice of the ice itself, speaking in a language that experienced hunters learn to read for information about thickness, stability, and the presence of seals beneath. At Ilulissat Icefjord, where the ice talks constantly — groaning, cracking, calving, splitting in sounds that range from rifle shots to sustained thunder — this is not a quaint folk belief but a precise acoustic reality. The ice communicates. The question is whether you know how to listen. Qailertetang occupies a space in Inuit cosmology between the major figures (Sila, Sedna) and the personal helping spirits (tuurngait) — a regional power, a local intelligence, tied to specific weather patterns and specific stretches of coast. This is characteristic of Inuit spirituality more broadly: the spirit world is not centralized. It is distributed, local, responsive to geography. The spirit of the weather at Ilulissat is not the same as the spirit of the weather at Igloolik, because the weather itself is different. Theology follows ecology, not the other way around."
    },
    {
      "id": "tuurngait",
      "name": "Tuurngait",
      "title": "The Helping Spirits",
      "group": "spirit",
      "description": "The tuurngait (singular tuurngaq) are the helping spirits that attend the angakkuq — not a single figure but a class of beings constituting the operational layer of Inuit spiritual practice. Rasmussen documented their acquisition in detail among the Iglulik: a person seeking to become an angakkuq would go alone to a remote place — often the sea ice in winter — and wait, fasting, enduring cold, sometimes for days, until the spirits came. The tuurngait might take the form of dead relatives, animals (bears, foxes, birds, sea creatures), or formless presences. They attached themselves to the aspiring shaman and became permanent companions, granting abilities: the power to fly to the sea floor to visit Sedna, to see through solid objects, to travel to the Moon, to extract illness from the sick. The relationship was reciprocal and binding — the tuurngait served the angakkuq, but they also made demands, enforced taboos, and could turn dangerous if mistreated. Among the Greenlandic Inuit, the angakkuq tradition was systematically suppressed by Danish colonial authorities and the Lutheran church from the 18th century onward, and the tuurngait were condemned as demonic. What was lost was not superstition but a sophisticated technology of altered consciousness — a framework for training attention, enduring extremity, and accessing non-ordinary perception that the Arctic environment demanded. At Ilulissat, where the glacier's calving creates infrasound felt in the body before it is heard by the ear, the boundary between ordinary and non-ordinary perception is thinner than most places on Earth."
    },
    {
      "id": "ijiraq",
      "name": "Ijiraq",
      "title": "The Shadow People",
      "group": "spirit",
      "description": "The ijiraq (plural ijirait) are shape-shifting spirits documented across the central and eastern Arctic — beings that appear at the edge of vision, take the form of caribou or humans, and lead travelers astray. They are not malevolent the way European demons are; they are disorienting. They cause you to lose your way, to wander, to forget where you are. In an environment where a whiteout can erase all landmarks in minutes and the tundra extends featurelessly for hundreds of kilometers, getting lost is a death sentence. The ijirait are the mythological encoding of this specific Arctic danger: the landscape itself can become unreadable. Rasmussen recorded stories of hunters who followed what they believed was a caribou for hours, only to find themselves in unfamiliar territory with no tracks, no trail, and no memory of how they arrived. In some accounts, children taken by ijirait are returned years later, changed, unable to reintegrate into human community — an abduction narrative paralleling European fairy-theft stories and speaking to the universal anxiety about losing someone to a space you cannot follow them into. At Ilulissat, where fog rolls in from Disko Bay and the ice sheet creates its own weather, the conditions for disorientation are constant. The ijirait are the Inuit name for what happens when the world stops making navigational sense — when ice, light, and horizon conspire to make you uncertain of everything you thought you knew about where you are."
    }
  ]
}
