{
  "id": "korean",
  "name": "The Cheonsin",
  "description": "The gods and spirits of the Korean shamanic tradition, anchored to Hallasan — the shield volcano on Jeju Island where heaven and earth once touched. Korean mythology survives not through a single canonical scripture but through the living memory of mudang (shamans), the ritual songs of the gut ceremony, the founding myths of the Samguk Yusa, and the oral traditions of Jeju's grandmothers. Its oldest layers are strikingly matriarchal — cosmic grandmothers who build islands with their bodies, bear-women who earn humanity through endurance, grain goddesses who descend to the underworld and return. The spirits ride white deer down Hallasan's slopes. They inhabit every peak, every village hearth, every threshold between this world and the next. They are not distant. They never left.",
  "deities": [
    {
      "id": "mago",
      "name": "Mago",
      "title": "The Great Goddess / Cosmic Creator",
      "group": "creation",
      "description": "The primordial creator goddess who precedes all other Korean divinities — the grandmother of the cosmos itself. In the Mago Halmi narratives and the Budoji (a controversial but culturally significant text), Mago is the source from which the world unfolds: she is the great mountain, the original body, the self-generating principle before division into heaven and earth. Her name means simply 'grandmother shaman' (ma = great, go = woman/shaman), and she appears across Korean folk religion as the cosmic old woman who shapes landscapes with her hands. In some Jeju traditions she merges with Seolmundae Halmang; on the mainland she is a separate, more abstract figure — the feminine principle behind all creation, older than any king or kingdom. What makes Mago distinctive in world mythology is her utter self-sufficiency. She does not create from a consort's seed or a god's word. She creates from herself, by herself. There is no male counterpart who initiates the process. This places her among the rarest class of creator deities: the parthenogenic grandmother, the self-originating source. Korean feminist scholars and shamanic practitioners have argued that Mago represents a stratum of Korean religious thought older than the Confucian patriarchal overlay — a memory of a time when the generative principle was understood as female without qualification. Whether or not that historical claim holds, the theological structure is clear: the first thing in Korean mythology is a grandmother, and everything else comes after.",
      "animals": ["deer", "crane"],
      "colors": ["white", "gold"]
    },
    {
      "id": "hwanung",
      "name": "Hwanung",
      "title": "Son of Heaven, Founder of Civilization",
      "group": "creation",
      "description": "The son of Hwanin (the Lord of Heaven) who descended to earth with three thousand followers to establish human civilization. The Samguk Yusa, compiled by the Buddhist monk Iryeon in 1281, preserves the founding myth: Hwanung looked down from heaven and saw that the human world could be helped. His father gave him three heavenly seals and sent him to the summit of Taebaeksan (Mount Baekdu, or in some readings Mount Myohyang), where he established Sinsi, the City of God, beneath a sacred sandalwood tree. He brought with him the Earl of Wind (Pungbaek), the Master of Rain (Usa), and the Master of Clouds (Unsa), and together they governed grain, life, disease, punishment, and good and evil — the full apparatus of organized society. Then a bear and a tiger came to him and begged to become human. He gave them twenty cloves of garlic and a bundle of mugwort and told them to stay in a cave for one hundred days, avoiding sunlight. The tiger gave up and left. The bear endured. She emerged as a woman, Ungnyeo, the bear-woman. The psychological weight of this story is extraordinary. Transformation is not a gift — it is an endurance test. The bear does not fight a monster or solve a riddle. She sits in the dark and eats bitter herbs. She waits. The tiger, who is stronger, cannot do it. Strength is not what the story values. Patience is. Suffering held voluntarily, without complaint, in pursuit of change — that is what makes you human. Hwanung married Ungnyeo, and their son was Dangun. Civilization, in Korean mythology, begins when heaven meets an animal who was willing to sit in the dark long enough to become something new.",
      "animals": ["bear", "tiger"],
      "colors": ["white", "blue"],
      "weapons": ["three heavenly seals (cheonbuin)"],
      "consorts": ["Ungnyeo (the Bear-Woman)"],
      "vegetation": ["sandalwood tree", "mugwort", "garlic"]
    },
    {
      "id": "dangun",
      "name": "Dangun",
      "title": "First King, Grandson of Heaven",
      "group": "creation",
      "description": "Dangun Wanggeom — the founder of Gojoseon, the first Korean kingdom, and the mythic ancestor of the Korean people. Son of Hwanung and the bear-woman Ungnyeo, he is the bridge between heaven and earth, between divine descent and animal transformation, between the spiritual and the political. According to the Samguk Yusa, he established his capital at Asadal (near present-day Pyongyang in some readings, elsewhere in others) and ruled for 1,500 years before retiring to Taebaeksan and becoming a mountain god (sansin) at the age of 1,908. The traditional founding date of his kingdom — 2333 BCE — is still used to calculate the Korean Dangi calendar, and Gaecheonjeol (National Foundation Day, October 3rd) commemorates the opening of heaven that preceded his birth. Dangun's dual nature — half-heaven, half-bear — encodes something specific about Korean identity. He is not purely celestial. His mother was an animal who earned her humanity through suffering. The divine line passes through a body that was transformed, not born perfect. This distinguishes the Korean foundation myth from those built on pure divine descent: the Japanese imperial line traces to Amaterasu, untouched by the animal world. Dangun's line passes through a cave, through garlic and darkness and the willingness to endure. The National Foundation myth says that Korea begins not with conquest but with patience — not with a sword but with a bear sitting in the dark, choosing to stay. Dangun shrines exist throughout both Koreas. His story remains politically charged: North Korea claims to have found his tomb in 1993, and the myth continues to serve as the foundational narrative of Korean ethnic identity across all political divisions.",
      "animals": ["bear", "white horse"],
      "colors": ["white", "red"],
      "vegetation": ["birch tree"]
    },
    {
      "id": "seolmundae",
      "name": "Seolmundae Halmang",
      "title": "Grandmother Creator of Jeju and Hallasan",
      "group": "creation",
      "description": "The giant grandmother goddess of Jeju Island who built Hallasan volcano with her own body and whose five hundred sons became the stone guardians of the island. Seolmundae Halmang — Grandmother Seolmundae — is the central figure of Jeju creation mythology, a tradition preserved by the island's women through centuries of oral transmission. She was so enormous that she used Hallasan as a pillow and her feet dangled in the sea. She scooped earth to build the mountain, and where she dug, the ocean filled in — the landscape of Jeju is literally her handiwork. The 368 oreum (parasitic cones) scattered across Jeju are clumps of dirt that fell from her skirts as she worked. She once tried to build a bridge to the mainland so Jeju islanders would not be isolated. She failed. The bridge remains unfinished. The story does not soften this: the great grandmother could shape a volcano but could not connect her island to the world. Some labors are beyond even the creator. Her death narrative is devastating. Her five hundred sons were hungry. She cooked a vast cauldron of porridge. While stirring, she fell in and was boiled alive. The sons ate the porridge without knowing their mother was in it. When the youngest son discovered the truth — found her bones at the bottom of the pot — the five hundred sons wept until they turned to stone. They are the Yeongsil rock formations on Hallasan's slopes, still standing, still grieving. This is Jeju's founding story: a grandmother who built everything, fed her children with her own body, and whose children consumed her without knowing what they had done. It is a creation myth and a grief myth simultaneously. Jeju's haenyeo (women sea divers) have carried this story for generations — women who build, women who feed, women whose labor is consumed and whose sacrifice goes unrecognized until it is too late.",
      "animals": ["white deer", "crow"],
      "colors": ["grey", "brown", "white"]
    },
    {
      "id": "haenim",
      "name": "Haenim",
      "title": "The Sun",
      "group": "celestial",
      "description": "The sun deity of Korean mythology, most vividly present in the Haewa Dari (Sun and Moon) folktale — one of the most widely told stories in the Korean oral tradition and a cornerstone of the shamanic cosmology. In the tale, a mother returning home with rice cakes is pursued by a tiger who devours her piece by piece at each mountain pass ('Give me a rice cake and I won't eat you'), then disguises itself in her clothing and enters the house to eat her children. The brother and sister pray to heaven for rescue. A golden chain descends for them and they climb to the sky — the boy becomes the sun (Haenim or Haesik), the girl the moon (Dalnim). A rotten rope descends for the tiger; it snaps, and the tiger falls onto a millet field, its blood staining the stalks red. Some versions reverse the genders, and scholars including Choi In-hak and Seo Daeseok have argued about which is older. The structural point is consistent: the sun and moon are children who escaped being consumed, elevated to the sky not by power but by prayer. Haenim governs the daylight world, the agricultural calendar, the rhythm of planting and harvest. In Korean shamanic practice, the sun is invoked during gut ceremonies with specific chants (muga) that recognize solar authority over the visible world. On Hallasan, the sunrise viewed from Seongpanak — the mountain's eastern slope — carries the full weight of this mythology: the sun is not an abstraction but a child who climbed a golden chain to escape a tiger, and who shines every morning because heaven answered a prayer.",
      "animals": ["rooster", "three-legged crow (samjogo)"],
      "colors": ["gold", "red", "white"]
    },
    {
      "id": "dalnim",
      "name": "Dalnim",
      "title": "The Moon",
      "group": "celestial",
      "description": "The moon deity, sibling to the sun, who governs the night sky, the tides, and the emotional interior of Korean spiritual life. In the Haewa Dari tale, Dalnim is the sister (or in some versions, brother) who ascends the golden chain alongside the sun child. In variants where the girl becomes the moon, she is initially given the sun role but is frightened of the dark journey across the night sky, so she and her brother switch — she takes the gentler path of moonlight, he takes the harsher road of full daylight. This exchange encodes something about how Korean tradition understood the difference between solar and lunar consciousness: the sun is endurance under exposure, the moon is illumination through softness. The moon (dal) permeates Korean culture at a depth that rivals or exceeds its presence in Chinese and Japanese tradition. Chuseok, the autumn harvest festival, centers on the full moon. Daeboreum, the first full moon of the lunar new year, is celebrated with bonfires, nut-cracking for health, and the burning of daljibi (moon houses) on hilltops — ritual fires that connect the earth to the moon through flame. The rabbit in the moon (daltokki) pounds rice cakes with a mortar and pestle, a specifically Korean version of the East Asian moon-rabbit motif. In shamanic gut ceremonies, the moon governs the yin register — ancestors, the dead, dreams, intuition, the unseen connections between the living and those who came before. On Hallasan, the moon rises over the volcanic crater lake of Baengnokdam (White Deer Lake), and Jeju's lunar rituals — particularly those performed by the island's shamans at the oreum — invoke Dalnim as the keeper of the threshold between the visible and invisible worlds.",
      "animals": ["rabbit (daltokki)", "toad"],
      "colors": ["silver", "white", "pale yellow"],
      "vegetation": ["osmanthus tree"]
    },
    {
      "id": "chilseong",
      "name": "Chilseong",
      "title": "The Seven Stars",
      "group": "celestial",
      "description": "The Seven Stars — the Big Dipper spirits — one of the most persistently worshipped celestial configurations in Korean religious history, cutting across shamanism, Buddhism, and Daoism in a synthesis that is distinctly Korean. Chilseong worship (chilseong sinang) centers on the seven stars of the Big Dipper (Ursa Major), understood not as a single deity but as a council of seven stellar spirits who govern human lifespan, fate, and fortune. In Korean shamanic practice, a Chilseong gut (ritual) addresses these stars directly, petitioning for longevity, the health of children, and protection from misfortune. In Korean Buddhist temples, Chilseong-gak (Seven Stars Halls) are found alongside the main worship halls — a striking integration of indigenous star worship into imported Buddhism that has no parallel in Chinese or Japanese temple architecture. The Chilseong spirits receive offerings of clean water (jeonghwasu) placed at dawn, a practice that persists in Korean households today: the grandmother rising before the family to set out a bowl of fresh water under the open sky, praying to the Seven Stars for the family's welfare. This is one of the oldest continuously practiced devotional acts in Korean culture, older than Buddhism on the peninsula, older than written records. The Seven Stars also govern the Chilseok festival (the seventh day of the seventh lunar month), Korea's version of the Weaver Girl and Cowherd story — the separated lovers Jiknyeo and Gyeonwu who meet once a year when magpies build a bridge across the Milky Way. On Hallasan's summit, far from lowland light pollution, the Big Dipper hangs close enough to touch. The mountain shamans of Jeju read the Dipper's angle for seasonal timing, and the seven stars are invoked during the Yeongdeung gut, the great wind ceremony of Jeju's second lunar month.",
      "animals": ["magpie"],
      "colors": ["indigo", "silver", "white"]
    },
    {
      "id": "jeseok",
      "name": "Jeseok",
      "title": "God of Human Life and Childbirth",
      "group": "celestial",
      "description": "The god who governs human life, childbirth, and the fate of children — one of the most important deities in the Korean shamanic pantheon and the subject of the Jeseok Bonpuri, one of the great narrative muga (shamanic epic songs) performed during gut ceremonies. The Jeseok Bonpuri tells the story of Danggeumaegi, a young woman who conceives miraculously after a Buddhist monk (or heavenly visitor) leaves three gourds of seeds at her house. She gives birth to three sons, but her family rejects her for the perceived shame. She endures exile, poverty, and the near-death of her children before Jeseok descends from heaven to recognize her sons and restore her. The narrative is a birth-origin myth: it explains why Jeseok governs childbirth and why offerings are made to him during and after pregnancy. But its deeper structure is about the suffering of mothers — a woman punished for bearing children outside sanctioned structures who endures anyway, whose children survive anyway, and who is vindicated only when heaven itself intervenes. In Korean shamanic practice, Jeseok is invoked at every childbirth gut and during rituals for children's health. Rice offerings, clean water, and white cloth are placed on the Jeseok altar. The deity is understood as a triad — Jeseok-cheon (Jeseok of Heaven), Jeseok-ji (Jeseok of Earth), and Jeseok-in (Jeseok of Humanity) — a three-realm structure that places the welfare of children at the intersection of cosmic and terrestrial forces. The name itself derives from the Buddhist Indra (Jeseok-cheon = Sakra Devanam Indra), but the deity's function in Korean shamanism has diverged entirely from the Buddhist warrior-king into a protector of pregnant women and newborns — a domestication of a cosmic figure into the most intimate human threshold.",
      "animals": ["magpie", "crane"],
      "colors": ["white", "light blue"],
      "vegetation": ["rice", "gourd"]
    },
    {
      "id": "sansin",
      "name": "Sansin",
      "title": "Mountain Spirit",
      "group": "earthly",
      "description": "The mountain spirit — present on every Korean mountain, enshrined in every Korean Buddhist temple, and arguably the most ubiquitous and enduring deity in the entire Korean religious landscape. Sansin is not a single god but a category: each mountain has its own sansin, and each is understood as a distinct spiritual presence that governs the mountain's ecology, weather, animals, and the fortunes of nearby communities. In Korean Buddhist temples, the Sansin-gak (Mountain Spirit Hall) sits behind or beside the main Buddha hall, housing a painting of the sansin as a white-bearded elder seated beneath a pine tree, usually accompanied by a tiger and a young attendant boy. The tiger is not the mountain spirit's enemy but its companion — the same tiger that failed the endurance test in the Dangun myth has become, in later tradition, the mountain spirit's mount and guardian. This is a remarkable transformation: the animal that could not become human became instead the attendant of the spirit that governs wild places. The theology of sansin reveals something profound about Korean relationships to landscape. Korea is seventy percent mountains. Every village sits in sight of peaks. To place a spirit on every mountain is to say that no part of the landscape is spiritually empty — that the wild world is not a void to be conquered but a series of presences to be respected. Sansin worship predates Buddhism, predates written Korean history, and continues today in hiking culture (Koreans are among the most avid hikers in the world), in the jangseung (totem poles) at mountain trail entrances, and in the simple act of bowing before entering a mountain path. On Hallasan, the sansin is particularly powerful — the volcanic mountain that created Jeju itself houses a spirit commensurate with that creative force. Hallasan's sansin is invoked in Jeju shamanic rituals as a protector of the island and is sometimes identified with Dangun himself, the first king who became a mountain god.",
      "animals": ["tiger", "deer"],
      "colors": ["green", "white", "brown"],
      "vegetation": ["pine tree", "ginseng", "lingzhi mushroom"]
    },
    {
      "id": "yongwang",
      "name": "Yongwang",
      "title": "Dragon King of the Sea",
      "group": "earthly",
      "description": "The Dragon King who rules the undersea palace and governs the waters that surround the Korean peninsula and Jeju Island — a deity shared across East Asian cultures but given distinctly Korean inflections through shamanic practice and Jeju's maritime traditions. Yongwang (from the Chinese Longwang) presides over an underwater kingdom of coral palaces, turtle ministers, and fish courtiers, a vision preserved in numerous Korean folktales, most famously the story of the Rabbit and the Turtle (Sugungga), one of the five great pansori (narrative singing) masterworks: the Dragon King falls ill and is told only a rabbit's liver will cure him. He sends a turtle to the surface to lure a rabbit underwater. The rabbit, realizing the trap, claims he left his liver on shore. The turtle brings him back. The rabbit escapes. The story is a comedy of deception, but it is also a portrait of power's limitation — the king of the entire ocean cannot obtain one small organ without trickery, and trickery fails against a cleverer mind. In Jeju Island's shamanic tradition, Yongwang is not a distant undersea monarch but an immediate daily presence. The haenyeo (women sea divers) who free-dive for abalone, sea urchin, and octopus perform rituals to Yongwang before entering the water. The Yeongdeung gut, Jeju's great wind ceremony held in the second lunar month and recognized by UNESCO as Intangible Cultural Heritage, is fundamentally a negotiation with Yongwang and the wind goddess Yeongdeung Halmang — asking the sea to be generous, asking the storms to subside, acknowledging that the ocean feeds the island but can also kill. At Hallasan's summit crater lake, Baengnokdam, the Dragon King's presence connects the volcanic mountain to the surrounding sea — rainwater that falls on the peak flows through porous basalt to emerge as the springs and streams that reach the coast, completing a hydrological cycle that the mythology reads as Yongwang's circulation through the island's body.",
      "animals": ["dragon", "sea turtle", "carp"],
      "colors": ["blue", "green", "gold"],
      "weapons": ["yeouiju (wish-fulfilling jewel)"]
    },
    {
      "id": "jacheongbi",
      "name": "Jacheongbi",
      "title": "Goddess of Agriculture and Grain",
      "group": "earthly",
      "description": "The goddess of agriculture, grain, and the seasonal cycle of growth — the central figure of the Jacheongbi Bonpuri, one of Jeju Island's most important shamanic narrative songs and one of the most remarkable goddess myths in East Asian tradition. Jacheongbi is a mortal woman who falls in love with Mun Doryeong, a heavenly being who descends to earth. When he is called back to heaven, she follows him — disguising herself as a man, passing through trials, ascending to the celestial realm through her own determination. But the story's pivot is darker: Mun Doryeong is killed (in some versions by a rival, in some by fate), and Jacheongbi descends to the underworld to retrieve him. She negotiates with the lord of the dead. She brings him back. Then, crucially, she receives the seeds of the five grains from the underworld and brings them to the surface, establishing agriculture on earth. The structural parallel to Demeter-Persephone is unmistakable but the Korean version inverts the gender dynamic: it is not a mother searching for a daughter but a woman searching for her lover, and she does not merely mourn — she goes to the underworld and comes back with the means to feed civilization. Jacheongbi is a descent-and-return heroine whose journey to the land of the dead is productive, not merely restorative. She brings back seeds. Death feeds life. The Jacheongbi Bonpuri is performed during the Segye gut (agricultural ritual) in Jeju, where shamans sing the full narrative to ensure good harvests. The myth explains not just where grain comes from but why agriculture requires death — seeds must be buried in the dark to grow, and the knowledge of planting came from below, not above. On Hallasan's fertile volcanic slopes, where mandarin orchards and fields of barley grow in the rich basalt soil, Jacheongbi's gift is visible in every harvest.",
      "animals": ["cow", "magpie"],
      "colors": ["yellow", "green", "brown"],
      "vegetation": ["rice", "millet", "barley", "beans", "wheat"],
      "consorts": ["Mun Doryeong"]
    },
    {
      "id": "samsin",
      "name": "Samsin Halmoni",
      "title": "Grandmother Spirit of Birth",
      "group": "earthly",
      "description": "The grandmother spirit who governs conception, pregnancy, birth, and the first years of a child's life — the most intimate deity in the Korean shamanic pantheon and one whose worship persists in Korean domestic practice today in forms so embedded they are barely recognized as religious. Samsin Halmoni (Three Spirit Grandmother, or Birth Grandmother) is understood as a triad or as a single goddess with three aspects governing the three stages of bringing life into the world: conception, safe delivery, and the child's early survival. In the Samsin Bonpuri (the shamanic narrative song of Samsin's origin), she is Danggeumaegi's daughter or a woman who proved herself worthy of the role through suffering and devotion — the narrative varies by region, but the structure is consistent: the birth goddess earns her authority through trials, not inheritance. In practice, Samsin Halmoni receives offerings immediately after birth: a bowl of miyeokguk (seaweed soup, the same soup the mother eats for recovery), rice, and clean water placed on a small altar, often just a shelf in the birth room. A straw rope (geumjul) strung with charcoal, red peppers, and pine branches is hung across the doorway to mark the birth space as sacred and to warn visitors away — this practice continued well into the twentieth century and persists in modified forms. The seaweed soup itself is Samsin's food: the mother eats it for weeks postpartum, sharing the meal with the goddess who delivered her child safely. This is theology as nutrition — the sacred act is eating soup, and the goddess is fed by the same bowl. Samsin Halmoni governs the first seven days of life, considered the most dangerous threshold, and offerings continue at 100 days and the first birthday (doljanchi), marking the child's passage through progressively safer stages. On Jeju Island, Samsin is invoked alongside Seolmundae Halmang — the grandmother who built the island and the grandmother who delivers each new life onto it, creation at the cosmic and individual scales governed by the same feminine principle.",
      "animals": ["magpie"],
      "colors": ["white", "red"],
      "vegetation": ["pine branches", "seaweed (miyeok)", "red peppers"]
    }
  ]
}
