{
  "id": "maori",
  "name": "The Atua",
  "description": "The gods of Aotearoa, anchored to Tongariro — the volcanic heart of the North Island, where the earth still breathes fire and the mountains carry the names of ancestors. The Maori pantheon emerges from Te Kore (the void), passes through Te Po (the long darkness), and arrives at Te Ao Marama (the world of light) through one of the most visceral creation acts in world mythology: children trapped between their parents' embrace, arguing in the dark about whether to kill them or push them apart. The separation of Ranginui (Sky Father) and Papatuanuku (Earth Mother) is the founding trauma — every rainstorm is Rangi weeping for Papa, every morning mist is Papa's breath rising toward Rangi. The volcanic plateau around Tongariro sits at the centre of the North Island like a geological navel: Ruaumoko, the unborn child still cradled in Papa's womb, turns and kicks beneath the surface, and the mountains Tongariro, Ngauruhoe, and Ruapehu are the result. These are not metaphors to Maori — the mountains are ancestors, the rivers are bloodlines, and the atua are not distant gods but kin.",
  "deities": [
    {
      "id": "ranginui",
      "name": "Ranginui",
      "title": "Sky Father",
      "group": "primordial",
      "description": "Ranginui is the sky itself — not a god who lives in the sky but the sky as a living, grieving, conscious being. In the beginning there was Te Kore, the void, the nothingness that was not empty but potential. From Te Kore emerged Te Po, the long darkness, an age of gestation where forms began to stir without yet having shape. Within Te Po, Ranginui and Papatuanuku found each other and locked together in an embrace so total that no light existed between them. Their children — the atua — were born into this darkness, growing in the cramped space between their parents' bodies, never seeing light, never knowing there was such a thing. The children debated. Tumatauenga wanted to kill the parents. Tane argued for separation — push them apart, let the light in, let the world begin. Tawhirimatea alone opposed any action, loving the closeness. Tane lay on his back, braced his shoulders against Papa, and pushed his feet against Rangi's chest. Slowly, with enormous effort, he forced them apart. Light flooded in — Te Ao Marama, the world of light, was born. Ranginui wept. He has never stopped weeping. Every rainfall is his tears falling toward Papatuanuku. Every cloud is his grief made visible. The Maori understanding of weather is not meteorological but relational — the sky mourns. Above the volcanic plateau of Tongariro, Rangi's tears feed the rivers Whanganui and Tongariro, flowing down from the mountains his children raised. In Maori tikanga, Ranginui is invoked in karakia (prayer) and whakapapa (genealogy) as the ultimate male ancestor, the origin point of all descent lines that trace through the sky.",
      "colors": ["Blue", "Grey", "White"],
      "consorts": ["Papatuanuku"]
    },
    {
      "id": "papatuanuku",
      "name": "Papatuanuku",
      "title": "Earth Mother",
      "group": "primordial",
      "description": "Papatuanuku is the ground beneath everything — the mother whose body is the land, whose breath is the morning mist, whose heartbeat is the geothermal pulse that drives the hot springs, geysers, and volcanic vents of the North Island. She lay with Ranginui in the primordial darkness of Te Po, and together they conceived the atua — gods born in blindness between two parents who could not let go of each other. When Tane forced the separation, Papatuanuku was turned face-down so that she and Rangi would not have to see each other's grief directly. Her back became the surface of the earth. Her body became the soil, the stone, the clay. The mists that rise from the valleys each morning are her sighs — the Maori call them the breath of Papa reaching upward toward Rangi. Nowhere is her living presence more visible than on the volcanic plateau around Tongariro, where geothermal energy — Papa's internal warmth — breaks through the surface at Wairakei, Rotorua, and the Ketetahi hot springs on Tongariro itself. The boiling mud pools are her blood. The sulphur vents are her exhalations. Ruaumoko, the last-born child who was never separated from her, still turns in her womb, and his restlessness is the source of earthquakes and eruptions across the North Island. In Maori practice, Papatuanuku is the foundation of kaitiakitanga — environmental guardianship. She is not a resource to be extracted but a mother to be cared for. The whenua (land) and the whenua (placenta) share the same word because both are the ground from which life grows. When a child is born, the placenta is buried in the earth — returned to Papa.",
      "colors": ["Green", "Brown", "Ochre"],
      "vegetation": ["All native bush and forest", "Ferns (especially the silver fern, ponga)"],
      "consorts": ["Ranginui"]
    },
    {
      "id": "tane",
      "name": "Tane",
      "title": "God of Forests and Light",
      "group": "children",
      "description": "Tane Mahuta is the one who let the light in. When the children of Rangi and Papa debated in the darkness of Te Po — cramped between their parents' locked bodies, arguing over whether to kill them or separate them — it was Tane who proposed separation and Tane who did the work. He lay on his back, pressed his shoulders into Papatuanuku, placed his feet against Ranginui's chest, and pushed. The effort was immense. The parents clung to each other. Slowly Tane straightened his legs and forced them apart, and Te Ao Marama — the world of light — flooded into the space between. This is why trees grow the way they do in Maori understanding: rooted in the mother, reaching toward the father, holding sky and earth apart. Tane is every tree. After the separation, Tane adorned his father's body with stars, placing the lights across Rangi's chest so the darkness above would not be total. He sought a female principle to create humanity and, finding none among the existing beings, shaped a woman from the red earth at Kurawaka. He breathed life into her. She was Hineahuone, the earth-formed woman, and she became his wife. Their daughter Hinetitama, upon discovering she had married her own father, fled in horror to the underworld and became Hine-nui-te-po, the goddess of death — declaring she would pull their descendants down to her. Death entered the world through Tane's line. On the volcanic plateau, Tane's domain is the great native forests that cloak the lower slopes of Tongariro, Ruapehu, and the Kaimanawa Ranges — the podocarp and beech forests that the Department of Conservation now protects. Tane Mahuta is also the name given to the largest known living kauri tree in Waipoua Forest, a tree over two thousand years old, still holding earth and sky apart.",
      "animals": ["Birds (all forest birds are Tane's children)", "Tui", "Kereru (wood pigeon)", "Kiwi"],
      "colors": ["Green", "Brown", "Dappled gold (sunlight through canopy)"],
      "vegetation": ["Kauri", "Totara", "Rimu", "Rata", "All native trees"],
      "consorts": ["Hineahuone (the first woman, shaped from earth)"]
    },
    {
      "id": "tangaroa",
      "name": "Tangaroa",
      "title": "God of the Sea",
      "group": "children",
      "description": "Tangaroa is the ocean — not its ruler but its substance, its mood, its rage and calm. Son of Rangi and Papa, he is one of the brothers who agreed to the separation, and after Tane pushed the parents apart, Tangaroa claimed the sea as his domain. His children are all creatures of the water: fish, shellfish, whales, dolphins, sharks, and the taniwha — supernatural water beings that guard rivers, lakes, and coastlines. In the great conflict that followed the separation, Tawhirimatea (god of storms) attacked his brothers for what they had done to the parents, and Tangaroa fled to the ocean for refuge. But some of his children — the lizards and reptiles — abandoned him and fled inland to the forests of Tane. Tangaroa has never forgiven Tane for sheltering the deserters. This is why the sea eats the land at every coastline, why floods wash away the forest, why the ocean is perpetually at war with the shore. In Maori practice, Tangaroa governs all things maritime: fishing, navigation, canoe-building, and the great ocean voyages that brought Polynesian navigators to Aotearoa. The waka hourua (voyaging canoes) that crossed thousands of kilometres of open Pacific were launched with karakia to Tangaroa, and every fish taken from the sea required acknowledgment — the first fish of any catch was returned to Tangaroa as an offering. Though Tongariro sits inland on the volcanic plateau, its rivers — the Tongariro, the Whanganui, the Rangitikei — all flow to Tangaroa's realm. The Tongariro River is one of the great trout fisheries of the world, and in Maori cosmology its waters carry the essence of Papa's tears (rain from Rangi) downhill to the sea, completing the cycle of grief between the separated parents. Lake Taupo, the vast caldera lake just north of the volcanic plateau, sits in the crater of a supervolcanic eruption and is itself Tangaroa's inland domain — fresh water held in the wound of Papa's body.",
      "animals": ["Fish (all species)", "Whales", "Dolphins", "Sharks", "Taniwha (supernatural water guardians)"],
      "colors": ["Blue", "Sea-green", "Grey-white (surf)"],
      "consorts": ["Te Anu-matao (the chilling cold, in some traditions)"]
    },
    {
      "id": "tu",
      "name": "Tumatauenga",
      "title": "God of War and Humanity",
      "group": "children",
      "description": "Tumatauenga — Tu of the angry face — is the god of war, the god of humanity, and the atua who wanted to kill the parents rather than separate them. When the brothers debated in the darkness of Te Po, Tu argued for the most radical solution: destroy Rangi and Papa entirely. He was outvoted. When Tane succeeded in pushing the parents apart and Tawhirimatea attacked the brothers in a storm of revenge, the other atua fled — Tangaroa to the ocean, Rongo and Haumia into the earth, Tane into his forests. Tu alone stood his ground. He fought Tawhirimatea and was not defeated. Then, furious at his brothers' cowardice, Tu turned on all of them. He wove nets and caught Tangaroa's fish children. He dug up Rongo's cultivated plants and Haumia's wild ferns. He snared Tane's birds with traps. He consumed them all. This is why humans — Tu's people — eat fish, birds, and plants: Tu conquered his brothers' domains, and humanity inherited the right to harvest them. In Maori culture, Tu is the ancestor of all warriors and the spiritual patron of the haka, the war dance that channels controlled fury into ritual form. The All Blacks' pre-match haka is a direct descendant of invocations to Tu. On the volcanic plateau around Tongariro, Tu's presence is felt in the region's military history — Tongariro National Park lies near the Desert Road, which the New Zealand military has used as a training ground for over a century, and the Maori wars of the 1860s saw fierce conflict across the central North Island. The fortified pa sites along the Whanganui River are monuments to Tu's tactical intelligence. In tikanga Maori, Tu governs the rituals of conflict and resolution: the wero (challenge), the whaikorero (formal oratory that can be weaponized), and the protocols that transform enemies into guests.",
      "animals": ["Humans (Tu's primary children)"],
      "colors": ["Red", "Black"],
      "weapons": ["Taiaha (long fighting staff)", "Mere (short club, often pounamu/greenstone)", "Nets and snares (used to conquer his brothers' domains)"],
      "consorts": ["Hine-te-iwaiwa (goddess of the moon and feminine arts, in some traditions)"]
    },
    {
      "id": "rongo",
      "name": "Rongo",
      "title": "God of Cultivated Plants and Peace",
      "group": "children",
      "description": "Rongomatane is the god of cultivated food, of agriculture, and of peace — the atua who represents what humans build when they are not fighting. Son of Rangi and Papa, he is the brother who fled from Tawhirimatea's storm by hiding within Papatuanuku's body, burrowing into the earth alongside Haumia. When Tu later sought revenge on the brothers who had abandoned him during the storm, he dug Rongo up and ate his children — the kumara (sweet potato), taro, and all cultivated plants. But Rongo endures because cultivation endures. You dig up the crop, eat it, and plant again. Rongo is the cycle itself. The kumara holds a special place in Maori cosmology: it was brought to Aotearoa from the tropical Pacific homeland of Hawaiki, carried in the voyaging canoes alongside the people themselves. Growing kumara in the cooler climate of New Zealand required ingenuity — stone-lined storage pits (rua kumara) kept the tubers through winter, and the volcanic soils of the central North Island plateau, enriched by centuries of eruptions from Tongariro, Ngauruhoe, and Ruapehu, proved ideal for cultivation. The ash-enriched soil around the volcanic plateau is Rongo's gift filtered through Papa's body: destruction becoming fertility, eruption becoming harvest. In tikanga Maori, Rongo governs the arts of peace: diplomacy, oratory aimed at resolution rather than combat, and the rituals that restore balance after conflict. Where Tu is the war face, Rongo is the peace face. The two are not opposites but a single cycle — you fight, then you grow food, then you fight again, then you grow. The marae (meeting ground) is both Tu's arena and Rongo's garden, depending on what the occasion requires.",
      "colors": ["Green", "Gold", "Earth-brown"],
      "vegetation": ["Kumara (sweet potato)", "Taro", "All cultivated crops"],
      "consorts": ["Hine-raumati (the Summer Maid, in some traditions)"]
    },
    {
      "id": "tawhirimatea",
      "name": "Tawhirimatea",
      "title": "God of Weather and Storms",
      "group": "children",
      "description": "Tawhirimatea is the only brother who opposed the separation of Rangi and Papa — and when the separation happened anyway, he went to war against his siblings. He loved the closeness of the primordial embrace and could not forgive Tane for breaking it. When Tane pushed the parents apart, Tawhirimatea rose with Ranginui into the sky, and from that vantage he unleashed his children upon the world below: Apu-hau (fierce squalls), Apu-matangi (howling winds), Ao-nui (thick clouds), Ao-roa (long clouds), Ao-pakarea (fiery clouds), and Ao-whekere (dark clouds). He attacked Tane first, tearing the great trees apart, snapping trunks, uprooting forests, hurling them to the ground in a chaos of shattered wood. He turned on Tangaroa and churned the ocean into mountainous waves, scattering fish into the deep. Rongo and Haumia hid inside the earth. Only Tu stood against him, and the battle between them was unresolved — war and weather locked in permanent contest. This is why storms still come. Tawhirimatea is not defeated; he is ongoing. On the volcanic plateau, his presence is absolute. Tongariro sits in the path of weather systems that sweep across the North Island from the Tasman Sea, and the mountains force the air upward, creating some of the most violent and unpredictable weather in New Zealand. The Tongariro Alpine Crossing, one of the most popular day hikes in the country, is notorious for sudden storms that drop temperatures by twenty degrees in minutes — Tawhirimatea reminding walkers that the mountain is not theirs. The Desert Road, which passes between Ruapehu and the Kaimanawa Range, is regularly closed by blizzards that appear without warning. In Maori thought, Tawhirimatea is not malevolent — he is the grief of a son who did not want his parents torn apart, expressed as weather.",
      "animals": ["None — his children are the winds and clouds themselves"],
      "colors": ["Dark grey", "Storm-black", "Lightning-white"]
    },
    {
      "id": "haumia",
      "name": "Haumia",
      "title": "God of Wild Plants and Uncultivated Food",
      "group": "children",
      "description": "Haumiatiketike is the god of wild food — the uncultivated plants that grow without being planted, the fern roots dug from the forest floor, the berries found rather than farmed. Where Rongo governs the kumara garden, Haumia governs what the bush provides on its own. When Tawhirimatea attacked the brothers after the separation, Haumia fled alongside Rongo into the body of Papatuanuku, hiding among her wild growth. When Tu came for revenge against the brothers who had abandoned the fight, he dug Haumia up from the earth and ate his children — the aruhe (bracken fern root) and other wild foods. But Haumia, like Rongo, endures through the cycle of return: wild plants grow back without human intervention. You harvest them and they return. That is Haumia's nature — persistence without cultivation, abundance without agriculture. In the world before European contact, aruhe was a staple food for Maori, particularly in the cooler southern regions where kumara could not grow. The bracken fern was roasted, pounded, and eaten as a carbohydrate-rich food source. Across the volcanic plateau around Tongariro, the lower slopes and surrounding bush are thick with native plants that fall under Haumia's domain: bracken fern, supplejack berries, hinau berries, and the roots of the ti kouka (cabbage tree). The volcanic soils, regularly enriched by ashfall from the Tongariro volcanic complex, support dense undergrowth. Haumia's realm is the uncurated abundance of the bush — not the garden but the wild. In tikanga Maori, Haumia reminds people that the land provides even when no one plants. He is the atua of foraging, of reading the bush, of knowing which roots are safe and which seasons bring which foods. His knowledge is older than agriculture.",
      "colors": ["Dark green", "Brown", "Fern-gold"],
      "vegetation": ["Aruhe (bracken fern root)", "Mamaku (black tree fern)", "Hinau berries", "Supplejack"]
    },
    {
      "id": "ruaumoko",
      "name": "Ruaumoko",
      "title": "God of Earthquakes and Volcanoes",
      "group": "children",
      "description": "Ruaumoko is the unborn god — the last child of Rangi and Papa who was still at his mother's breast when Tane forced the separation. When Ranginui was pushed upward into the sky, Ruaumoko was not separated. He remained with Papatuanuku, still clinging to her body, and when she was turned face-down to spare the parents the sight of each other's grief, Ruaumoko was carried beneath the surface with her. He is still there. He has never been born into Te Ao Marama, the world of light. He remains in the womb of the earth, and his turning, his kicking, his restless movement in the darkness is the cause of earthquakes, volcanic eruptions, and geothermal activity. Nowhere in Aotearoa is Ruaumoko's presence more immediate than on the volcanic plateau of the central North Island. Tongariro, Ngauruhoe, and Ruapehu are his body breaking through the surface. The 1886 eruption of Mount Tarawera, the 1945 and 1995-96 eruptions of Ruapehu, the continuous geothermal activity at Whakaari (White Island) — all are Ruaumoko moving within Papa. The Taupo Volcanic Zone, which stretches from Ruapehu northeast to Whakaari, is one of the most active volcanic fields on Earth, and it sits directly over the subduction zone where the Pacific Plate dives beneath the Australian Plate. Ruaumoko rides that boundary. In Maori tradition, his anger is not random but relational: he is the child who was denied the light, who never joined his brothers in Te Ao Marama, who was left in the dark while the others walked in the sun. His eruptions are grief made geological. Tongariro National Park — the first national park in New Zealand and one of the first in the world — was gifted to the Crown in 1887 by Te Heuheu Tukino IV, paramount chief of Ngati Tuwharetoa, specifically to protect the sacred mountains from exploitation. The gift was an act of kaitiakitanga — guardianship over Ruaumoko's body.",
      "colors": ["Red-orange (lava)", "Black (obsidian, volcanic rock)", "Sulphur-yellow"],
      "consorts": ["Remains with Papatuanuku — never separated, never married"]
    },
    {
      "id": "maui",
      "name": "Maui",
      "title": "The Trickster Demigod",
      "group": "other",
      "description": "Maui-tikitiki-a-Taranga — Maui of the topknot of Taranga — is the great trickster of Polynesian mythology, a figure shared across the Pacific from Hawaii to Aotearoa, whose stories are among the most vivid and human in all world mythology. He was born premature, so small and unpromising that his mother Taranga wrapped him in a tuft of her hair (the tikitiki) and threw him into the sea. The ocean spirits raised him. He returned to his family, proved himself through cunning rather than strength, and set about rearranging the world. He slowed the sun: it was moving too fast across the sky, and the days were too short for his mother to cook and work, so Maui braided ropes from flax, traveled to the pit where the sun rises, snared it, and beat it with the enchanted jawbone of his grandmother Murirangawhenua until it agreed to move more slowly. He fished up the North Island of New Zealand: using a fishhook made from that same grandmother's jawbone and his own blood as bait, he cast his line from his brothers' canoe into the deep ocean and pulled up a great fish — Te Ika-a-Maui, the Fish of Maui, which is the North Island itself. The South Island is the canoe (Te Waka-a-Maui), and Stewart Island is the anchor stone (Te Punga). The volcanic plateau sits near the centre of the fish's body, and the mountains of Tongariro are features on its spine. He stole fire from the underworld by tricking his grandmother Mahuika, the goddess of fire, into giving him her burning fingernails one by one until she was left with only one, which she hurled at him in fury, setting the world ablaze before the fire was captured in the wood of certain trees — the mahoe, the kaikomako — where it lives still, waiting to be drawn out by friction. His final act was his attempt to conquer death itself: he planned to crawl through the body of Hine-nui-te-po while she slept, entering through her birth passage and emerging from her mouth, reversing death by reversing birth. A fantail bird laughed at the sight and woke the goddess. She crushed him between her thighs. Maui died, and humanity remained mortal. He is the hero who won everything except the one thing that mattered most.",
      "animals": ["Fantail (piwakawaka — the bird that betrayed him)", "Dolphins (ocean kin)", "Eels"],
      "colors": ["Red-brown", "Ocean blue", "Flax-gold"],
      "weapons": ["Enchanted jawbone of Murirangawhenua (his grandmother's jawbone)", "Fishhook (Te Matau-a-Maui)", "Flax ropes (used to snare the sun)"],
      "consorts": ["Hina (in some Polynesian traditions)"]
    },
    {
      "id": "hine-nui-te-po",
      "name": "Hine-nui-te-po",
      "title": "Goddess of Death and the Underworld",
      "group": "other",
      "description": "Hine-nui-te-po — Great Woman of the Night — is the goddess of death, the ruler of the underworld, and the reason every human life ends. But she was not always death. She began as Hinetitama, the Dawn Maid, daughter of Tane and Hineahuone (the first woman Tane shaped from the red earth of Kurawaka). Hinetitama was radiant, beautiful, the first child born of the first human union. Tane took her as his wife — his own daughter — and she bore him children without knowing who her father truly was. When she asked the pillars of the house to tell her the identity of her father, and the pillars answered that Tane was both her father and her husband, her shame and horror drove her to flee. She descended to Rarohenga, the underworld, and declared that she would remain there forever, pulling her children — all of humanity, all of Tane's descendants — down to her in death. She turned her face away from the world of light and became Hine-nui-te-po, the personification of death. When Maui attempted to defeat her by crawling through her body as she slept — reversing death by reversing birth — she woke and crushed him, confirming that mortality is permanent. Her choice to become death is not villainy but consequence: incest violated the natural order, and death is the correction. In Maori understanding, Hine-nui-te-po is not feared as an enemy but acknowledged as an ancestor. She waits at the end, and when a person dies, they travel to her domain — often described as a journey to Te Reinga, the leaping-off place at the northern tip of the North Island, where spirits descend along the roots of an ancient pohutukawa tree into the underworld. On the volcanic plateau, her presence is felt in the sulphurous, otherworldly landscapes of the Tongariro Alpine Crossing — the Emerald Lakes, the Red Crater, the barren terrain that looks like the surface of another world. The Maori name for Ngauruhoe's crater invokes death and the underworld. She is the darkness that Tane's light cannot reach, the night that follows every day, the debt that every living thing owes simply for being alive.",
      "animals": ["Morepork owl (ruru — its call is an omen of death)"],
      "colors": ["Black", "Deep red", "Obsidian"],
      "consorts": ["Tane (as Hinetitama, before her transformation — she fled from him)"]
    }
  ]
}
