{
  "id": "mapuche",
  "name": "The Pillanes and Ngen",
  "description": "The Mapuche of south-central Chile understand Villarrica volcano — Ruka Pillan, the 'House of the Spirits' — as the dwelling place of ancestor souls who followed the admapu (customary law) in life and earned their place among the pillanes after death. Its permanent lava lake is not geological accident but ongoing spiritual presence: the fire that never goes out because the dead are still there, still watching. Mapuche spirituality is not a pantheon in the Greek sense but a living relational system — spirits of ancestors, spirits of nature, a four-aspected supreme being, and cosmic serpents whose battles shaped the land itself — all bound together by reciprocity between the human and more-than-human worlds.",
  "deities": [
    {
      "id": "ngenechen",
      "name": "Ngenechen",
      "title": "Supreme Deity — The Four-Aspected One",
      "group": "supreme",
      "description": "Ngenechen — 'ruler of the people' — is the supreme being of Mapuche cosmology, and the single most structurally interesting deity concept in South American religion. Ngenechen is not one entity but four: Fucha (old man), Kude (old woman), Weche Wentru (young man), and Ulcha Domo (young woman). These four aspects combine age and gender into a quaternary that is not a pantheon of four gods but one god expressed through four simultaneous modes of being. This is not a Trinity with an extra member bolted on. It is a model of wholeness that insists completeness requires both masculine and feminine, both elder and youth — a claim that neither Greek theology nor Christian Trinitarianism makes. Faron's 'Hawks of the Sun' documented how this structure is enacted in the ngillatun ceremony: prayers address all four aspects in sequence, and to omit any one is to address an incomplete god. The psychological implication is precise. A culture that resisted Inca expansion, then fought the Spanish for over three hundred years without ever being fully conquered, built its supreme deity as a model of the complete life cycle. Old age and youth are not successive — they coexist. Male and female are not opposite — they are co-present in the divine. If your god contains all stages and all genders simultaneously, then no single stage or gender can claim spiritual monopoly. This is an anti-authoritarian theology embedded at the highest level of the cosmology."
    },
    {
      "id": "antu",
      "name": "Antu",
      "title": "The Sun",
      "group": "supreme",
      "description": "Antu is the sun itself and the most powerful pillan — the ancestor spirit who rules the Wenu Mapu, the upper spiritual realm. He is light, wisdom, and spirit set against darkness and the physical world. Antu is not merely a celestial body. He is a governing intelligence: the other pillanes answer to him, and the machi (shaman) invokes his authority during the ngillatun fertility ceremonies and the funeral rites of the awn and kurikawin, where he is called upon to protect the soul of the deceased on its passage to Wenu Mapu, countering the wekufe (malevolent forces) that would drag it downward. The Mapuche calendar and agricultural cycle orient around his movements. What is notable is the relationship between Antu and Ngenechen — Antu is the most powerful individual spirit, but Ngenechen is the supreme totality. This creates a cosmological structure where the strongest single force in the sky still does not constitute completeness. No matter how bright the sun, it is only one aspect of what wholeness requires. For a warrior culture that spent centuries resisting imperial conquest, this distinction matters: the greatest individual hero is not the highest value. The whole community, in all its aspects, outranks even the sun. Antu chose Kuyenh (the moon) as his wife, and their celestial pairing — the masculine solar force and the feminine lunar force — governs the fundamental polarity of Mapuche cosmological time."
    },
    {
      "id": "kuyenh",
      "name": "Kuyenh",
      "title": "The Moon",
      "group": "supreme",
      "description": "Kuyenh is the moon — the principal wangulen spirit, the first among the star-women, and the feminine complement to Antu's solar masculinity. She governs the night, fertility, water, and the rhythms of growth, and she rules over all the wangulen (star spirits), those feminine celestial beings the Mapuche understand as close representations of the ideal of womanhood. Antu chose her above all other wangulen, which provoked a revolt among the remaining star spirits — a myth that encodes both cosmic hierarchy and the social tensions around selection and status. Kuyenh's phases mark the planting and harvesting calendar. Her light on the lakes of the Araucania region — Villarrica, Calafquen, Panguipulli — is understood not as reflection but as presence: she is there, on the water, watching. The polarity between Antu and Kuyenh is not oppositional but complementary, and it maps onto one of the fundamental structural principles of Mapuche thought: the cosmos operates through paired forces that require each other to function. Day needs night. Warmth needs coolness. The sun that drives growth needs the moon that governs rest and gestation. This is not a philosophical abstraction for the Mapuche — it is agricultural reality. At nearly forty degrees south latitude, the seasonal extremes are dramatic, and the interplay between solar warmth and lunar-timed planting cycles is the difference between a successful harvest and starvation."
    },
    {
      "id": "pillan",
      "name": "Pillan",
      "title": "The Volcano Spirit — Ancestral Fire",
      "group": "pillanes",
      "description": "The pillanes are the ancestor spirits who dwell inside the volcanoes of the Southern Andes, and Pillan — as both a specific spirit and a category — is the force that makes the earth tremble and the mountains breathe fire. The name 'Ruka Pillan' (Villarrica's Mapuche name) means 'House of the Pillan,' and this is not metaphor: the Mapuche understand the permanent lava lake inside the caldera as the actual dwelling place of important dead. A person who follows the admapu — the body of customary law governing Mapuche life — can become a pillan after death, joining the ancestors inside the volcano. Those who violated the admapu are denied entry. Faron documented this belief extensively: the pillanes are 'hawks of the sun,' the righteous dead who earned their place through moral conduct. This is an afterlife theology built on ethics, not faith or belief — you get in by how you lived, not by what you professed. The pillanes are generally benevolent, bringing rain and fertility, but they can also unleash eruptions, earthquakes, and drought as punishment for human wrongdoing, or allow the wekufe to do so. The ngillatun ceremony addresses them directly: offerings are made, and the community asks for their continued protection. When Villarrica erupts — and it erupts frequently, most recently in 2015 — the Mapuche reading is not geological but moral. Something in the relationship between the living and the dead has gone wrong."
    },
    {
      "id": "ngen",
      "name": "Ngen",
      "title": "Guardian Spirits of Nature",
      "group": "pillanes",
      "description": "The Ngen are the spirit-owners of every element of the natural world — not gods in a distant heaven but localized, specific presences inhabiting particular rivers, forests, mountains, and winds. Ngen-ko owns the water. Ngen-mawida guards the forest. Ngen-kuruf governs the winds. Ngen-kutral holds fire. Ngen-kullin watches over the animals. Each element of nature has its own Ngen, and no human may use that element without first asking permission. You do not drink from a stream without acknowledging Ngen-ko. You do not cut a tree without addressing Ngen-mawida. This is not animism in the dismissive sense that nineteenth-century anthropologists used the term — it is a comprehensive system of ecological reciprocity encoded as spiritual obligation. Augusta's early twentieth-century Mapudungun dictionary records the specificity of these relationships: each Ngen has protocols, offerings, and consequences for violation. The psychological and social function is profound. A culture that assigns a spirit-guardian to every river, every stand of trees, every hilltop has built environmental protection into its theology at the most fundamental level. You cannot exploit a resource without first confronting the being who owns it. Around Villarrica, where the Araucaria (monkey puzzle) forests clothe the volcanic slopes and the lakes feed from glacial melt, the Ngen system meant that every act of harvesting was also an act of relationship."
    },
    {
      "id": "wangulen",
      "name": "Wangulen",
      "title": "The Star Spirits",
      "group": "pillanes",
      "description": "The Wangulen are the spirits of the stars — feminine celestial beings who, in Mapuche cosmology, represent the original form of womanhood itself. The tradition holds that the earliest Mapuche woman was first a star in the sky before descending to earth, making the Wangulen not merely symbols of femininity but its source. The Meli Wangulen — the Four Star Spirits — are particularly significant, and their number echoes the four-aspected structure of Ngenechen, suggesting that the quaternary principle extends throughout the cosmos. Kuyenh (the moon) is their principal, the chief Wangulen who governs all others. When Antu chose Kuyenh as his wife, the remaining Wangulen rebelled — a star-war in the sky driven by envy and desire, a myth that gives celestial explanation to a recognizably human social dynamic. The Wunyelfe — the morning star, Venus, the 'bearer of the dawn' — holds special importance, represented in Mapuche textile and silverwork as an eight-pointed star (the gunelve). In some accounts, the Wunyelfe is an amalgamation of spirits who became trapped between the realms while trying to ascend from the Minche Mapu (the world below) back to the Wenu Mapu (the world above). This is a striking image: the brightest object in the pre-dawn sky is understood as souls caught in transit, permanently suspended between descent and ascent — a visible metaphor for the spiritual journey that never quite reaches its destination."
    },
    {
      "id": "trentren-vilu",
      "name": "Tren Tren Vilu",
      "title": "The Earth Serpent",
      "group": "cosmic",
      "description": "Tren Tren Vilu is the great serpent of the land — the earth-force that lifts mountains, raises coastlines, and protects humanity from the sea. In the central Mapuche flood myth, Cai Cai Vilu (the sea serpent) sends the waters rising to drown the world, and Tren Tren Vilu responds by raising the hills higher. The battle between them is the Mapuche explanation for the geography of southern Chile: the mountains exist because the earth serpent pushed them up; the flooded valleys and thousands of islands of the Chiloe archipelago are the places where the sea serpent won. Geologists studying the Southern Volcanic Zone have noted that this myth maps with uncomfortable precision onto actual tectonic processes. The subduction of the Nazca Plate beneath the South American Plate produces exactly the phenomena the myth describes: coastal uplift (Tren Tren raising the land), tsunamis and marine incursion (Cai Cai flooding the valleys), earthquakes (the writhing of the serpents). The Mapuche did not have plate tectonics. What they had was centuries of direct observation, encoded into narrative. Tren Tren Vilu is a beneficent force — he is on humanity's side, literally lifting people above the floodwaters — but he is not gentle. Mountains are not gentle. The people who survived by climbing to the high ground became the Mapuche. This is an origin myth that begins with catastrophe and ends with resilience — which is, in fact, the pattern of Mapuche history itself."
    },
    {
      "id": "caicai-vilu",
      "name": "Cai Cai Vilu",
      "title": "The Sea Serpent",
      "group": "cosmic",
      "description": "Cai Cai Vilu is the serpent of the waters — the ocean force that rises to claim the land, antagonist to Tren Tren Vilu and the embodiment of the sea's power to swallow everything. In the flood myth, Cai Cai struck the ocean with his fish-shaped tail and the waters obeyed, surging inland, covering valleys, drowning those who could not reach high ground. The battle between the two serpents is not a simple good-versus-evil binary. Cai Cai Vilu represents a force that is destructive to humans but not inherently evil — the sea is the sea, and its nature is to take. The myth does not ask why the waters rose. It records that they did, and that survival required vertical escape. Southern Chile's coast is one of the most seismically active zones on earth. The 1960 Valdivia earthquake — magnitude 9.5, the most powerful ever recorded — generated tsunamis that crossed the Pacific. The Mapuche, living in this landscape for millennia, experienced repeated marine incursions following earthquakes, and Cai Cai Vilu is the narrative container for that accumulated experience. The serpent is not a fantasy. It is the ocean doing what the ocean does in a subduction zone, given a name and a story so that the knowledge persists across generations. Psychologically, Cai Cai represents the force that cannot be reasoned with, only escaped — the flood that comes regardless of human merit. The only answer to Cai Cai is Tren Tren: go higher."
    },
    {
      "id": "anchimallen",
      "name": "Anchimallen",
      "title": "Spirit of Fire",
      "group": "cosmic",
      "description": "The Anchimallen are small luminous beings — fireballs, glowing child-sized apparitions, spheres of light that streak across the night sky near volcanic regions. They exist in two forms: the sacred Anchimallen, created by a machi through ritual awakening of a curamilla (a 'fire stone' believed to hold elemental power), and the dangerous Anchimallen, servants of the kalku (sorcerer) sent to cause illness and death. The benevolent form, once awakened and nurtured with offerings of milk and honey, becomes a guardian spirit — protecting livestock, repelling illness, warding off malevolent forces. The malevolent form is a weapon of witchcraft. This duality is the point. Fire itself is dual: it warms the ruka (house) and cooks the food, and it also burns the forest and flows as lava from Ruka Pillan. The Anchimallen embody this truth at the spiritual level — the same element that protects you can be turned against you, depending on the intention of the person who directs it. In a volcanic landscape, this is not abstract philosophy. The people of the Villarrica region live with fire literally beneath their feet; the Anchimallen give that fire a face and a moral dimension. Whether an Anchimallen is guardian or curse depends on whether it was made by a machi (healer, working within community) or a kalku (sorcerer, working against it). The spirit of fire reflects the ethics of the human who channels it."
    },
    {
      "id": "machi",
      "name": "Machi",
      "title": "The Shaman — Axis Between Worlds",
      "group": "cosmic",
      "description": "The Machi is not a deity but a spiritual role so central to Mapuche cosmology that it functions as an archetype: the human being who stands at the intersection of the living and the dead, the natural and the supernatural, the sick and the whole. The machi heals through the machitun ceremony — entering trance, communicating with spirits, diagnosing the spiritual cause of illness. Her tool is the kultrung (ritual drum), painted with the Mapuche cosmogram: the four cardinal directions, the sun and moon, the four aspects of Ngenechen, the whole cosmos mapped on a drumhead. Her altar is the rewe — a carved wooden pole, typically of canelo (the sacred foye tree), with notched steps representing levels of spiritual ascent. A new machi's first rewe has four steps; as she gains power, additional steps are carved. The foye tree is hermaphroditic — its flowers contain both male and female structures — and this botanical fact mirrors the machi's traditional gender fluidity. Bacigalupo's 'Shamans of the Foye Tree' documented how machi historically occupied a gender-crossing role. The machi draws power from Ngenechen, from ancestor spirits, and from specific natural locations — waterfalls, lakes, volcanoes. She is not above the community; she is its nervous system, the point where spiritual disturbance registers as physical symptom and where healing requires restoring balance between the human world and everything else. In a culture that never centralized political authority into a permanent state, the machi provided continuity through spiritual rather than institutional power."
    }
  ]
}
