{
  "humanSelf:center": {
    "summary": "The Self is the fifth element — the distinctly human contribution to existence. It is not simply the sum of body, mind, spirit, and emotions but the being who holds and balances all four powers.",
    "teaching": "Estcheemah teaches that every person is directly responsible for their own care throughout life. How one balances the Self — spiritually, emotionally, physically, and mentally — is the challenge each human must accept while living on Mother Earth. The Zero Chiefs considered the discovery and knowledge of the Self to be the highest of all knowledge. Most people never truly learn who they are because they substitute outside authorities for genuine Self-knowledge. The Self is described through the metaphor of the Self Commander — the one who unifies and leads all the different parts of the inner world. In the Sacred Earth Count, the human is the number Five, placed at the center of the wheel. Being centered in the Self means placing five first, which is what makes a person balanced.",
    "pages": [202, 326, 342, 466]
  },
  "humanSelf:N": {
    "summary": "The North is the place of Knowledge and Wisdom. Its color is White.",
    "teaching": "The North represents the mental capacity for clear, wise understanding. However, a person who develops only the mental aspect will be wise but detached from feeling. Pure intellectualism without the balance of the other three directions produces a person who is knowledgeable but cold. The Zero Chiefs studied the human Mind over thousands of years, asking: What is anger? Why do people kill other people? Why do humans love? What is hate? Their discoveries led to the identification of the Twelve Principal Powers, with the Mental Power being one of the four at the center. The Mind is also the site where internalized cultural images compete for authority. The goal is a Democracy of Mind — not a mind ruled by a single dictator-image but one in which the Self Commander exercises balanced leadership over all inner beings and powers.",
    "pages": [201, 440]
  },
  "humanSelf:E": {
    "summary": "The East is the place of Illumination and Enlightenment. Its color is Gold, the color of Fire and the Sun.",
    "teaching": "Spirit is understood as Pure-Intellect — the deathless essence that exists before birth and after death. Spirit can imagine and dream but cannot truly experience. It is only through being born into Life on Earth that Spirit gains the opportunity to learn, grow, feel, and evolve. The warning about living only in the East is that such people will have clear, farsighted vision but will never be close to things. They will feel separated, above Life, and will never understand that they can be touched by it. Each human has a twin in the Spirit world — the Higher Self. Unification of the Self with the Higher Self is described as the human's greatest healing, achieved not through withdrawal from life but through Self Energy and Self Care while living.",
    "pages": [201, 264, 541]
  },
  "humanSelf:S": {
    "summary": "The South is the place of Trust and Innocence. Its colors are Green or Red.",
    "teaching": "The South is the seat of the Emotional Power of the Self — the capacity to feel, to trust, and to perceive closely our emotional nature. Those who insist upon dwelling in the idyllic Innocence of the South will pretend their lives long and find only disappointment. Innocence is natural and necessary in children, but adults who refuse to grow beyond emotional innocence become perpetual pretenders. In the Sacred Earth Count numbering, placing emotions first (3+5) produces imbalance. The balanced approach is 5+3: the Self first, then emotion informing the Self rather than overwhelming it. Lightningbolt's experience in the Child's Lodge dramatizes the raw power of emotions: he learned that fighting feelings only makes the head pound and the body ache. Instead, one must learn to let go of strange tensions until they become part of one's tears.",
    "pages": [201, 232, 543]
  },
  "humanSelf:W": {
    "summary": "The West is the place of Introspection and Intuition. Its color is Black, the symbolic color of Earth and the Power to Dream and Regenerate.",
    "teaching": "The West represents the Physical Power of the Self — the capacity to look within. The body is not merely physical matter but the vehicle through which all experience becomes real. It is only through having a body that Spirit can actually taste, feel pain, love another being, run, work, and play. The body makes Life concrete rather than abstract. The danger of the West is that those who perceive only from it will go over the same thoughts again and again in their minds, yet will always be undecided. Pure introspection without the balance of the other directions leads to paralysis. When the physical power is centered in the Self (5+4), it becomes courage; when it leads without Self-awareness (4+5), it becomes fear or rage.",
    "pages": [201, 264, 543]
  },

  "perspective:center": {
    "summary": "Perspective is the integrating awareness at the center of the wheel. When all four directional powers converge in the Self, the result is true perspective — clear, integrated awareness of the full situation.",
    "teaching": "Lightningbolt teaches that at the True Center of the Medicine Wheel is the Self. Self perspective is the ability to clearly discern what is actually happening — both within oneself and in one's surroundings. Perspective clarifies the true situation. Without it at the center, the other responses remain fragmented and disconnected. The power of this Wheel belongs to those who apply the teaching to the inner world. Lightningbolt tells Liberty: Always search within for Self power, for it is the unfolding of the Blossom of inner Discipline that brings the Flower Soldier into true Medicine Power.",
    "pages": [444]
  },
  "perspective:N": {
    "summary": "Focus Evaluation is the trained ability to evaluate all incoming information pertinent to the situation.",
    "teaching": "After the emotional alert (South) and the bodily commitment to engage (West), the mind must do its work. Focus Evaluation involves a detailed, disciplined mental assessment: What exists? What weapons does the danger possess? How many dangers or enemies might exist? How strong or old or young is the enemy? What does the danger actually look like? It is a thorough inventory of reality — not panic, not projection, not assumption, but disciplined assessment. Liberty applies Focus Evaluation when she pauses during an unsuccessful hunt and asks herself where her evaluation has gone. She learns to assess the rabbit's world — its habits, food sources, water, whether it hunts by day or night, what it builds, where its companions are.",
    "pages": [444, 489]
  },
  "perspective:E": {
    "summary": "Center-Ring is the estimation of the distance between the Center Self and the challenge being faced.",
    "teaching": "After being alerted, choosing to engage, and evaluating the situation, the Flower Soldier must determine the distance between the Self and the enemy or challenge. How far away the enemy is and how fast it can move is determined by the Center Ring. Center-Ring involves spatial and relational awareness — understanding the actual distance, speed, and dynamics between yourself and what you face. It requires knowing the range and behavior of your own capacities and how they interact with the space between you and your challenge. When Liberty encounters a rabbit with her bow, Lightningbolt says 'That is Center Ring' — pointing to the spatial relationship between Liberty, her weapon, and the rabbit.",
    "pages": [444, 489]
  },
  "perspective:S": {
    "summary": "Point Reference Focus is the initial emotional alerting moment — the instant something unexpected captures your attention.",
    "teaching": "While Flower Soldiers live and explore, they maintain constant attentiveness to both the physical and inward world — this ongoing state of awareness is Point Reference Focus. When something unexpected occurs — a sudden sound, an unanticipated movement — it instantly captures attention. Every Point Reference Focus directly affects the emotions. Before reasoning kicks in, before the body has chosen its response, the emotions have already been activated. This is demonstrated when Lightningbolt detonates a firecracker behind Liberty. The explosion sends her nearly sprawling. She leaps to her feet and spins around. That was certainly not intellectual! It is not an idea but a lived, bodily-emotional experience — the moment the whole system snaps to attention.",
    "pages": [444, 489]
  },
  "perspective:W": {
    "summary": "Battle or Flee is the physical will's binary response: engage or withdraw.",
    "teaching": "After Point Reference Focus has alerted the emotions, humans naturally face a binary physical response: they either desire to do battle with the source of danger or to flee from it. This is a demand upon the physical will. All humans who are not trained in the art of combat will try to hide or flee, to escape. The trained Flower Soldier will always choose battle. This is placed in the West because it is fundamentally a bodily event — the will and the physical organism making a choice about physical action. Choosing battle over flight is an inward act of will as much as an outward physical one. The Flower Soldier does not merely react; the Flower Soldier chooses. The West is where introspective courage lives — facing what confronts you rather than turning away.",
    "pages": [444, 489]
  },

  "elements:center": {
    "summary": "Beauty and Earth Mother Goddess are the same. She is known as the Rose — Healer and Warrioress, Giver and Taker. The four elements are Her children.",
    "teaching": "The center of the Elements Wheel is Beauty, the Earth Mother/Father. Estcheemah calls the four elements 'the children of Beauty.' She has been known by many names — Warrioress, Healer of Light. The Greeks knew this Goddess as Helen, and the word Healing comes from the word Hellen, meaning Light. The Rose is the Earth Woman. Goddess Life is powerful and births all Life. She is the Giver and the Taker, Healer and Warrioress. The Rose has Her thorns. Mother Life is the Perfectness of Wisdom and Courage. She is Strength and Healing for us Humans. She is the Great Zero, the Medicine Wheel, and the Mother of all things Born. Estcheemah teaches: Do not let Beauty embarrass you. Allow this Medicine Wheel to become your Cradle of Thinking. Our Mother World, our Sacred Mother Earth, is very beautiful. Everything we harvest or fabricate is built from Earth's gift of substance.",
    "pages": [227, 235, 221, 130, 314]
  },
  "elements:N": {
    "summary": "Wehomah is Air and Wind — the Breath of Being. She is the Wind Dancer.",
    "teaching": "Wehomah is the Breath of Being. She is the Breath of all things alive. She is the Wind Dancer. Wehomah Breathes our existence. Air is not merely atmosphere — it is the very breath that animates every living creature, in constant graceful motion, never static. In the North, the place of Knowledge and Wisdom, the color White represents the invisible yet essential nature of air. During training, Estcheemah tells Lightningbolt: While you have your eyes closed you can hear Wehomah, the Wind — linking attentive listening to awareness itself. In the Rainbow Lodge ceremony, Ehahmah dances with Wehomah, Earth with Air — the relationship between substance and the invisible breath that gives it life.",
    "pages": [227, 211, 300, 559]
  },
  "elements:E": {
    "summary": "Cheemah is Fire and Light, bringing Life-Source to all growing things. She is Warrioress and Healer.",
    "teaching": "Cheemah is Fire and Light, bringing Life-Source to all growing plants and animals. The East is the direction of the Sun, and One is the Sun in the Earth Count. Estcheemah teaches: Cheemah, Fire, is Healing. She brings warmth and has saved countless millions of lives. Cheemah also destroys and alters; She is the heart of the blast furnace. The only way for humans to touch Cheemah is through knowledge, otherwise we will be burned. Cheemah is a Warrioress and a Healer. The Cheemahdah — the sacred fire pit at the center of ceremonial lodges — takes its name from Cheemah, meaning 'little fire' or 'volcano.' In the Rainbow Lodge, Morealah dances with Cheemah, Water with Fire, to create the steam of purification.",
    "pages": [227, 511, 231, 559]
  },
  "elements:S": {
    "summary": "Morealah is Water — all Waters bringing the Blood of Life to all things Living. She is the dew on the petal of the flower.",
    "teaching": "Morealah is all Waters, bringing the Blood of Life to all things Living. Estcheemah teaches: Morealah is Water. She bathes and cleanses. She is our renewal. She gives us drink, but She is also the restless tide of the Ocean. She is the snow of Winter, and She is the driving rain. She is the Warrioress, and She is our Healer. She is the dew on the petal of the flower. Like all the elements, Morealah has a dual nature — gentle and fierce. In the Rainbow Lodge, Water is sprinkled over red-hot stones, pairing with Fire to create transformation and cleansing. The Moon moves the tides of the Earth, and the tidal waters and blood within all living things.",
    "pages": [227, 511, 559, 224]
  },
  "elements:W": {
    "summary": "Ehahmah is the Earth-Ground, bringing all things to Birthing. Substance from which all forms emerge.",
    "teaching": "Ehahmah is the Earth-Ground, bringing all things to Birthing. The West is the direction of the Earth in the Earth Count (Two is the Earth), the Place of Looking Within. Its color is Black — the symbolic color of Earth and the Power to Dream and Regenerate. Black is not negativity but depth, interiority, the darkness of the womb and of the soil where seeds germinate. The Earth receives and gives form to what the Sun initiates, just as the Womb receives and gives form to new life. In the Rainbow Lodge, Ehahmah dances with Wehomah, Earth with Air — substance paired with the invisible breath that animates it. Mother Earth has birthed every living creature and all things that live on her Planet.",
    "pages": [227, 222, 559]
  },

  "sacredElements:center": {
    "summary": "The Self is the Fifth Sacred Element. The human stands at the center of the four elements — Fire, Water, Earth, and Air — and is the one who holds and balances them all.",
    "teaching": "Estcheemah teaches that the Four Sacred Elements of Life are Fire, Earth, Water, and Air. But there is a Fifth Element that stands at the center: the Human Self. The Self is the meeting place of all four elemental powers. Just as the center of the Medicine Wheel holds all directions in balance, the human being is the only creature given the responsibility and power to consciously balance the elements within. The Self is not separate from the elements — it is born from them, sustained by them, and returns to them. Beauty, the Earth Mother, is the center from which all elements radiate. She is the Rose — Healer and Warrioress, Giver and Taker. The four elements are Her children, and the human Self is the child who can know and name them.",
    "pages": [466, 227, 342, 326]
  },
  "sacredElements:N": {
    "summary": "Air is the Breath of Being — Wehomah, the Wind Dancer. The invisible, ever-present power that animates all living things. Its color is White, the color of the North.",
    "teaching": "Air is the element of the North, corresponding to the Mind and to Knowledge and Wisdom. Its color is White — invisible yet essential, like the air itself. Wehomah breathes our existence. Air is not merely atmosphere but the very breath that animates every living creature, in constant graceful motion, never static. Air corresponds to the mental capacity for clear, wise understanding. The North wind carries knowledge. During training in the wilderness, Estcheemah tells Lightningbolt: While you have your eyes closed you can hear Wehomah, the Wind — linking attentive listening to awareness itself. In the Rainbow Lodge ceremony, Earth dances with Air — Ehahmah with Wehomah — the relationship between substance and the invisible breath that gives it life.",
    "pages": [227, 211, 300, 559, 466]
  },
  "sacredElements:E": {
    "summary": "Fire is Light and Life-Source — Cheemah, Warrioress and Healer. Fire brings warmth and illumination to all growing things. Its color is Gold, the color of the East.",
    "teaching": "Fire is the element of the East, corresponding to Spirit and to Illumination. Its color is Gold — the color of the Sun, the first-born from the Sacred Zero. Cheemah brings Life-Source to all growing plants and animals. She brings warmth and has saved countless millions of lives. But Cheemah also destroys and alters — She is the heart of the blast furnace. The only way for humans to touch Cheemah is through knowledge, otherwise we will be burned. Cheemah is a Warrioress and a Healer. The Cheemahdah — the sacred fire pit at the center of ceremonial lodges — takes its name from Cheemah, meaning little fire or volcano. In the Rainbow Lodge, Water dances with Fire — Morealah with Cheemah — to create the steam of purification and transformation.",
    "pages": [227, 511, 231, 559, 466]
  },
  "sacredElements:S": {
    "summary": "Water is the Blood of Life — Morealah, who bathes and cleanses all things. She is the dew on the petal of the flower. Its color is Red, the color of the South.",
    "teaching": "Water is the element of the South, corresponding to the Emotions and to Trust and Innocence. Its color is Red or Green — the colors of vital life-blood and growing things. Morealah is all Waters, bringing the Blood of Life to all things Living. She bathes and cleanses. She is our renewal. She gives us drink, but She is also the restless tide of the Ocean. She is the snow of Winter, and She is the driving rain. She is the Warrioress, and She is our Healer. She is the dew on the petal of the flower. The Moon moves the tides of the Earth, and the tidal waters and blood within all living things. In the Rainbow Lodge ceremony, Water is sprinkled over red-hot stones, pairing with Fire to create transformation and cleansing.",
    "pages": [227, 511, 559, 224, 466]
  },
  "sacredElements:W": {
    "summary": "Earth is Substance and the Ground of all Being — Ehahmah, who brings all things to Birthing. From Her body all forms emerge. Its color is Black, the color of the West.",
    "teaching": "Earth is the element of the West, corresponding to the Body and to Introspection and Intuition. Its color is Black — not negativity but depth, interiority, the darkness of the womb and of the soil where seeds germinate. Ehahmah is the Earth-Ground, bringing all things to Birthing. Everything we harvest or fabricate is built from Earth's gift of substance. Our Mother World, our Sacred Mother Earth, is very beautiful. She has birthed every living creature and all things that live on Her planet. The West is the direction of looking within, and Earth is what gives form and substance to all vision and dreaming. In the Rainbow Lodge, Earth dances with Air — Ehahmah with Wehomah — substance paired with the invisible breath that animates it.",
    "pages": [227, 222, 559, 466]
  },

  "earthCount:center": {
    "summary": "The Sacred Zero — WahKahn and SsKwan. The Zero is not nothing but Everything. All of Creation's Children were born from the Sacred Zero.",
    "teaching": "In the Beginning was WahKahn. She is the Creatress Mother and the Great Zero, the Womb that Births All of Existence. Within instantaneous being was born the SsKwan. He is the Creator Father, and is the Dividing of the Zero. Creation, the Zero, is perfectly balanced. The Zero is Female and Male, and has designed and Birthed all of Life. The Zero Chiefs say that the Zero is not nothing, but is instead Everything. The Sacred Zero has been given to us humans; without the understanding of the Zero, there exists no Mathematics.",
    "pages": [222]
  },
  "earthCount:E": {
    "summary": "ONE is the Sun — the FirstBorn from the Sacred Zero, the marriage of WahKahn and SsKwan. The East is the dancer called the Sun.",
    "teaching": "The FirstBorn from The Sacred Zero — the Marriage of WahKahn, the Creatress Mother, and SsKwan, the Creator Father — was One. The East is the dancer called the Sun. ONE is the SUN. Eleven is the Number for all the Stars. The Sun is a Star, and all the Stars are Suns. Come, Children, become a Source of Light within your own Life dance.",
    "pages": [222, 224]
  },
  "earthCount:W": {
    "summary": "TWO is the Earth — the SecondBorn from the Sacred Zero, existing in the West, the place of the Coloring of Time.",
    "teaching": "The SecondBorn from the Sacred Zero was Two. The Two exists in the West of the Medicine Wheel, the place of the Coloring of Time. The West is the dancer called Earth. TWO is the number for the EARTH. Twelve is the Number for all the Planets. Mother Earth is a special Planet, for She has Birthed you and can Birth all Life. Come, dancers, orbit your Sacred Self, guiding your Children to Honor Mother Life.",
    "pages": [222, 224]
  },
  "earthCount:S": {
    "summary": "THREE is all Plants — born from the union of Sun and Earth. The grasses are ever singing with the trees, the corn dancers, and the flowers.",
    "teaching": "The First Children of the Sacred Zero were the Sun and the Earth. One, the Sun, and Two, the Earth, joined together, and from this Union Three was Born. The grasses are ever singing with the trees, the corn dancers, and the flowers. THREE is the Number for all PLANTS. Thirteen is White Buffalo Woman. Every flower, tree, grass, herb, vegetable, and underwater plant is a cell that forms the Great Body and Knowing of White Buffalo Woman and Her Twin.",
    "pages": [222, 224]
  },
  "earthCount:N": {
    "summary": "FOUR is all Animals — born when the Sun married the Plants. The Animals are in Circles ever moving with Life.",
    "teaching": "Time turned the Earth, and the Plants turned the Wheel within shadow and light. One, the Sun, married Three, all Plants, and the first Animals were Born on the Earth. The Animals are in Circles ever moving with Life. FOUR is the Number for all ANIMALS. Fourteen is Sweet Medicine. Every Animal — that flies, walks, crawls, or swims — is a cell that forms the Great Body and Knowing of Sweet Medicine and His Twin.",
    "pages": [222, 225]
  },
  "earthCount:C5": {
    "summary": "FIVE is all Humans — Born of the First Circle, existing in its Center. The Humans send their voices into the Four Directions.",
    "teaching": "The FIVE are all HUMANS. The Five were Born of the First Circle and exist in its Center. The Humans are sending their voices into the hearts of the Four Directions in celebration of their Lives. Fifteen is the Collective Consciousness of All Humans. Every thought ever imagined or acted upon by a human in the past, present, or future exists within the Great Library of human Imagination and Discovery. Come, Children of Destiny and Creativity, let your Imaginations be guided by the Sacred and Perfect Balance of the Creatress Mother and the Creator Father.",
    "pages": [223, 225]
  },
  "earthCount:SE": {
    "summary": "SIX is Spirit-Spirit — the Experiencing of the Presence of Life. When humans are conscious and Present with the Spirit of Life.",
    "teaching": "SIX is the Number for Experiencing the Presence of Life. When the human children of Mother Earth are conscious and Present with the Spirit of Life they are Experiencing the Six. The Six is called SPIRIT-SPIRIT because all things Born into Substance are Born from Spirit. Six Directions make up all Spheres: East, West, South, North, Zenith, and Nadir. Sixteen is the Sphere of the Great Teachers. They encourage all people to Remember that Life is Holy.",
    "pages": [223, 225]
  },
  "earthCount:SW": {
    "summary": "SEVEN is the Dream of Life — all things made within Beauty, or broken and thrown away. We look into our Past and learn.",
    "teaching": "SEVEN is the Number for the DREAM OF LIFE, for all things that are made within Beauty, or that are broken and thrown away. We look into our Past and learn of what we have built. Come, Children, and Build your World Dance. Seventeen is the Sphere of the Kachinas — the Powers that form all Symbols, Dreams, and Images. Come, Children, place your Painted Masks of the Natural World upon your face. Come, adults, remove the Masks of your culture and Learn.",
    "pages": [224, 225]
  },
  "earthCount:NW": {
    "summary": "EIGHT is the Circle of Law — all Natural Laws. Mother Earth sculpts everything with Her Sacred Laws. The Future.",
    "teaching": "EIGHT is the Number for all Natural Laws and THE CIRCLE OF LAW. Mother Earth sculpts the Substance and Body of everything that lives with Her Sacred and Natural Laws. The Eight guides the Forming of all that is within the Future, and gives us a way to Reappear each day. Eighteen is Absolute Justice — the Shee-nah-meeah, the Balancers of Existence. Who will claim to understand Balance? Justice is the Shee-nah-meeah.",
    "pages": [224, 225]
  },
  "earthCount:NE": {
    "summary": "NINE is the Moon and Movement. The Moon moves the tides of the Earth, and the tidal waters and blood within all Living things.",
    "teaching": "NINE is the Number for the MOON, and for MOVEMENT. The Moon moves the tides of the Earth, and the tidal waters and blood within all Living things. Come, Children, and dance in the Moonlight. Nineteen is the Sphere known as PURE SCIENCE. Pure Science is both Goddess and God. Their Presence is the Design of all Existence, and the Sacred Mathematics of WahKahn and SsKwan.",
    "pages": [224, 225]
  },
  "earthCount:C10": {
    "summary": "TEN is Pure Intellect, Measure, and the Higher Self. Creation gave humans the power of Reason and Self Choice.",
    "teaching": "TEN is the Number for PURE INTELLECT and MEASURE. Creation gave humans the power of Reason and Self Choice. Ten is also the Number of humans' HIGHER SELF, their Sacred Twin. What can give better Measure than this Spirit-Knowing? Come, Children, have you met your Self and Known Existence? Twenty is COMPLETION — the Return to the Great Zero where all things were Born. The Return to WahKahn and SsKwan.",
    "pages": [224, 226]
  },

  "bodySpheres:C10": {
    "summary": "Ten is Intellect. Ten is Measure. Ten is the Higher Self — the Spirit Twin who dwells in the world of Pure Energy.",
    "teaching": "While a woman lives on Earth, her Twin, who is male, is her Higher Self and lives in the Spirit world. While a man lives on Earth, his Twin, who is female, is his Higher Self and lives in the Spirit world. When we exist as Pure Essence, we are one unified being, both female and male, united with Creation. When born into existence, we are separated and born as one or the other on Earth in order to learn and grow. Unification of the Self is the human's greatest healing. The Higher Self brings Pure Intellect from all higher numbers where it dwells. Genius and creativity are possible for those who unite their energies with those of Life and Measure. Madness results when humans are completely separated from the Self and from the presence of Life.",
    "pages": [541, 542]
  },
  "bodySpheres:E": {
    "summary": "Position 1 — The Genitals. In the Earth Count, One is the Sun. The first sphere is the seat of sexual energy, magnetism, and creativity.",
    "teaching": "The First Sphere of the Body is the human genitals. For women, the genitals are called the Woman's Flower, because all of humanity is born from the woman's body. The egg and semen are called Sun-born-in-the-Womb-Substance, linking human reproduction to the primal creative act of the Sun being born from the balance of darkness and light. This sphere corresponds to the Sun because, just as the Sun is the first creative force born into substance, human sexual and creative energy is the first and most fundamental power of the body.",
    "pages": [531, 532]
  },
  "bodySpheres:W": {
    "summary": "Position 2 — The Womb (women) / Testes (men). In the Earth Count, Two is the Earth. This sphere is the seat of the human Will.",
    "teaching": "The woman, like Mother Earth, carries the Sacred Temple of Life — the Womb — which is the center of human creation. There is no greater Will on Earth than the Will to create and birth Life, and then to continue living. The Earth receives and gives form to what the Sun initiates, just as the Womb receives and gives form to new life. The Will is the power that sustains creation. Humans are Spirits born from the world of Death-Spirit into Life through the Womb.",
    "pages": [532, 533]
  },
  "bodySpheres:S": {
    "summary": "Position 3 — The Stomach. In the Earth Count, Three is the number for all Plants. The stomach is the center of human emotions.",
    "teaching": "Like plants, the stomach transforms what is dead — the food we have killed and eaten — into living energy. Plants possess the power to transform dead substance into living tissue. They are the Great Transformers. The Zero Chiefs found that the stomach is the center of human emotions. Plants affect human emotions in many ways: directly through what we eat, and subtly through the beauty of flowers and green things. The emotional and the digestive are intertwined in this sphere — what we take in, both physically and emotionally, must be transformed.",
    "pages": [533, 534]
  },
  "bodySpheres:N": {
    "summary": "Position 4 — The Heart and Lungs. In the Earth Count, Four is the number for all Animals. This sphere governs Courage and Fear.",
    "teaching": "Animals were the first beings given physical independence through having a heart and lungs, which allowed them to move freely across the Earth, waters, and skies. The energies of this sphere are Courage and Fear, both gifts from the animal kingdom. Fear can be a friend, alerting us to danger, or a foe when it becomes panic. Courage is not bravado — bravado is emotional immaturity. Courage and Fear instantly affect all of the first four spheres: they quicken or dampen creativity (1), will (2), emotions (3), and the heart itself (4). Humans ruled by Fear have suppressed their sexuality and their yielding.",
    "pages": [534, 535]
  },
  "bodySpheres:C5": {
    "summary": "Position 5 — The Mouth and Throat. In the Earth Count, Five is the Human. This sphere is the sacred Voice.",
    "teaching": "The Fifth Body Sphere is described as Sacred. Humans are unique among all creatures in their ability to develop an intricate vocal system of Self communication. Through speech, humans can transform thought images and visual images into word symbols. The Voice can articulate the sacred, the profound, the mundane, the ignorant, and the wise. The placement of the Human (Five) at the Voice reflects the teaching that what makes us most distinctly human is our power of articulate communication — the ability to name, describe, and share our inner experience.",
    "pages": [535]
  },
  "bodySpheres:SE": {
    "summary": "Position 6 — The Center of the Forehead, including Eyes, Ears, and Nose. The paired sense organs that provide constant information about the present.",
    "teaching": "The Sixth Body Sphere encompasses the paired sense organs: two eyes, two ears, and two nostrils. These are located at the center of the forehead in the medicine wheel mapping of the body. This sphere constantly provides information about what exists in the present moment. Through the physical Sixth Sphere, humans experience both the visible and invisible worlds of the experiential. Six is the Number for Experiencing the Presence of Life — when humans are conscious and Present with the Spirit of Life they are Experiencing the Six.",
    "pages": [536, 223]
  },
  "bodySpheres:SW": {
    "summary": "Position 7 — The Physical Brain at the pinnacle of the head. The trans-active-experiencer — symbol is its language.",
    "teaching": "The Zero Chiefs made a critical distinction between the Brain and the Mind. The brain is called the trans-active-experiencer — an ancient term from the Temple of Baal-Hel-Atl-WahKahn. The brain maintains all physical body functions and stores all experiential information. However, the Self Mind is higher than the brain and has the ability to control it. No light, sound, or physical stimulus enters the brain directly. The brain receives only electrochemical impulses — light stimulates the retina, neurons fire along the optic nerve, and the brain translates these into images. It is the Mind that sees, not the brain. Symbol is the language of the brain-mind — its knowing, its translating, and its experiencing.",
    "pages": [536, 537]
  },
  "bodySpheres:NW": {
    "summary": "Position 8 — The entire physical body. The Body-Mind possesses its own direct knowing, different from the brain's symbolic knowing.",
    "teaching": "The Zero Chiefs taught that the body and its combined cells possess their own knowing — the Body-Mind. Each cell has its own Knowing and participates with every other cell in the entirety of the body. When we are awake, the brain-mind is typically awake and the body-mind is asleep. When we sleep, the brain-mind sleeps but the body-mind is awake. Both are awake together only at special moments: during deep creative thinking or extreme danger. The body-mind speaks a different language than the brain-mind. The body-mind knows the physical world directly, without translation into symbol. Children, poets, artists, musicians, creative mathematicians, and true philosophers receive knowing from the Energy Field because they are in communication with their body-mind. The body-mind speaks the language of the Energy Field.",
    "pages": [537, 538]
  },
  "bodySpheres:NE": {
    "summary": "Position 9 — The Energy Field. The measurable electromagnetic sphere surrounding every human body — each person's connection to the great Energy Field of Life.",
    "teaching": "Movement is Energy; Energy is Movement. Both are Life. Humans are Spirits born from Pure Energy into the Energy of Substance. Everything born into substance is patterned from the Energy Field of Creation. All beings who die on Earth are born back into Spirit through the Energy Field. The Womb is the meeting place of Pure Spirit Energy and our Earth world. The Energy Field contains the design and consciousness of all Numbers, all Deities, and all Knowing. Every rock, tree, bird, flower, fish, and human possesses its own Energy Sphere. The Energy Field around the body is directly affected by the Moon, and it connects all beings of the Earth with the higher numbers of Life and Creation.",
    "pages": [538, 539, 542]
  },

  "mathematics:center": {
    "summary": "WahKahn is the Creatress Mother and SsKwan is the Creator Father. Together they are the Sacred Zero — the source, origin, and Womb of all Creation.",
    "teaching": "The Zero is not nothing but rather Everything. All of Creation's Children were designed and born from the Sacred Zero, and all exist as Numbers within the Medicine Wheel. WahKahn is the Great Zero, the Womb that Births All of Existence. SsKwan is born within instantaneous being as the Dividing of the Zero — the Creator Father who is Time itself. Creation is perfectly balanced, both Female and Male. The Zero Chiefs sang: The Sacred Zero has been given to us humans; without the understanding of the Zero, there exists no Mathematics. From the Eternal, which is Time, and from all Energies, which are Space, all of everything was born from the Zero. Surely the voice of WahKahn and SsKwan is Mathematics. No voice in Time is greater.",
    "pages": [222, 215, 543]
  },
  "mathematics:N": {
    "summary": "Measure and Time — the capacity to quantify and comprehend the grand scale of existence.",
    "teaching": "The Zero Chiefs were driven by the desire to measure. They asked: What is Time? What does endless Space mean? What is our Sun? They sought to know where they were within Time and Space, and to discover this they had to know the exact measurement of the Earth, the Moon, and the Solar system. Ten in the Earth Count is Pure Intellect and Measure. Genius and creativity are possible for those who unite their energies with those of Life and Measure. The placement of Measure and Time in the North connects measurement to Wisdom. Without Measure, humans cannot achieve the Knowledge that the North represents.",
    "pages": [221, 541]
  },
  "mathematics:NE": {
    "summary": "Division — the first act of Creation. SsKwan, the Creator Father, is the Dividing of the Zero.",
    "teaching": "The very first act of Creation after the Great Zero is an act of division — the One separating from the Whole so that numbers, multiplicity, and existence can come into being. Division is how the Zero gives rise to differentiation, to distinct identities and individual numbers. The evolution of learning brought about by Mathematics helped the Zero Chiefs separate what we presently call the abstract world from the world of measurable substance. This capacity for distinction, for telling one thing apart from another, is the foundational intellectual operation that underlies all further scientific inquiry.",
    "pages": [222, 221]
  },
  "mathematics:E": {
    "summary": "Light and Dark — the primordial duality that emerges once Energy exists, from which all Substance is continually Birthed.",
    "teaching": "Light and Darkness are Born from Energy. From Light and Darkness, Substance is Born and is continually being Birthed. This the Zero Chiefs called Binding. The atom itself is Energy (which they called Continuing), and from this Energy, Light and Darkness differentiate. Their interaction produces Substance — all physical matter. Humans are born from Spirit Energy into the Energy of Light and Dark to become Spirit in Substance. Lightningbolt learns in his dream: Darkness is not my enemy. Light is not my enemy. When he stops opposing darkness, it reveals an inner light of its own and forms a radiant Circle.",
    "pages": [537, 284]
  },
  "mathematics:SE": {
    "summary": "Addition — the combining of numbers to create new forms. How energies and aspects of being join together matters profoundly.",
    "teaching": "The Numbers of the Earth Count combine through addition to create new meanings and new forms of existence. Light (1) plus Earth (2) equals Plant (3). A vegetarian is Earth elements plus plants (2+3=5, Human). A Human (5) eating an Animal (4) equals Movement and Energies (9). The placement of numbers in addition matters profoundly: a 5+1 (Self plus Sexuality) person is fundamentally different from a 1+5 (Sexuality plus Self) person. The centered human considers all things from a five Self point of view first. Placing the Self first is very important.",
    "pages": [543, 544]
  },
  "mathematics:S": {
    "summary": "Velocity and Gravity — the complementary forces governing how celestial bodies move through space and hold to their orbits.",
    "teaching": "The Zero Chiefs asked: How fast does our Planet traverse Space and orbit our Sun? Velocity is the principle of movement and traversal; Gravity is the principle of attraction and holding. Together they explain how celestial bodies orbit, how planets move through space, and why things fall. In the Earth Count, Nine is Movement and the Moon — the Moon that moves the tides of the Earth and the tidal waters and blood within all living things. Rhythm is Mathematics — it is the Soldier's song of Numbers. The rhythm of planetary motion, governed by the balance of velocity and gravitational pull, is a physical expression of the sacred mathematical language.",
    "pages": [216, 224]
  },
  "mathematics:SW": {
    "summary": "Subtraction — the operation of taking away, of loss, and of what remains when something has been removed.",
    "teaching": "The Southwest is associated with the Past and the Sacred Dream of Life. Seven is the Number for the Dream of Life, for all things that are made within Beauty, or that are broken and thrown away. We look into our Past and learn of what we have built. Subtraction in a spiritual sense is the discipline of stripping away what is false to reveal what is true. The disease of fantasy is the number-one killer of humans — the failure to subtract illusion from reality, pretense from honesty. What remains after subtraction is Essence.",
    "pages": [224]
  },
  "mathematics:W": {
    "summary": "Weight and Volume — the physical reality of matter, its heft and extent. The measure of substance itself.",
    "teaching": "The Zero Chiefs asked: What is weight? What is Pressure? What is Force and Counterforce? They asked about the Circle, the Square, Volume, and Movement. Weight is the property of substance pulled by gravity; Volume is the measure of the space that substance occupies. Together they describe the tangible presence of matter. The West is the direction of Earth and Body — the natural home for these concepts of physical substance. Ehahmah, the Earth-Ground, brings all things to Birthing into physical form. Weight and Volume are the measurements of that physicality — the questions of how much and how large.",
    "pages": [216, 227]
  },
  "mathematics:NW": {
    "summary": "Multiplication — exponential increase, patterns repeating and compounding. The Northwest is the direction of the Future.",
    "teaching": "Eight in the Earth Count is all Natural Laws and the Circle of Law — the principles that govern how things form and re-form. Mother Earth sculpts the Substance and Body of everything that lives with Her Sacred and Natural Laws. The Eight guides the Forming of all that is within the Future. Multiplication is the mathematical expression of this forming and re-forming: cells dividing and multiplying to build bodies, seasons cycling through years, forces compounding. While Subtraction in the Southwest strips away, Multiplication in the Northwest builds outward and forward. The Natural Laws ensure that multiplication operates within the discipline of the Circle.",
    "pages": [224]
  },

  "meta:overview": {
    "summary": "The Medicine Wheels are very old — as ancient as the first Americans themselves. They are an inheritance that belongs to all of Earth's peoples, with the power to transform not only each individual but also the course of humanity.",
    "teaching": "The Medicine Wheel is the shape of the Zero — and the Zero is not nothing, but Everything. The Circle is primal to Creation. It is the shape of all things created. The Zero Chiefs were the People who sought to solve the riddle of the Language of Space and Time. They discovered Mathematics, and from these questions the Medicine Wheels were born. There has been no discovery known to Humans that can equal the discovery of Mathematics, and the discovery of the Zero is equal in importance to, or even greater than, the discovery of chemistry, metallurgy, electricity, or atomic energy — because without the Zero, these sciences would not be known.\n\nThere were many kinds of Medicine Wheels. Some represented human interaction, some represented Mathematical principles in Life, and some represented the study of the human Presence of Mind. The Medicine Wheel reveals the relationship and integration of all things created. The manner in which the Medicine Wheels integrated Knowledge provided an easy way to learn and remember information — easy-to-memorize pictures of Wisdom.\n\nThe Wheels teach that Life is not a philosophical question. Life is our human Reality, Truth, Fact, and Teacher. The Wheels teach that Life is not a religion. Rather, Life is the perfect opportunity to Learn and Grow by first questioning — asking who each Human is. You are more than what your social world says. You are Spirit, Body, Emotion, and Mind, and you are responsible for the care of that Being we call your Self.\n\nAfter thousands of years of studying and experimentation, the Zero Chiefs began to see that the Medicine Wheels revealed an inward relationship they had not previously recognized, one that concerned the human Self. The Zero Chiefs gave the Medicine Wheels to the people so that they would desire Balance within their own Minds. They called this Balance a Democracy of Mind. The Zero Chiefs say that human Choice is the most valuable power and presence that Creation has given to humans.\n\nSeven Arrows (1972) was a simple introduction to the Medicine Wheels. Lightningbolt (1994) begins where Seven Arrows left off. These ancient teachings have survived because of the courageous dedication of a tiny handful of devoted people — the Flower Soldiers and their Zero Chiefs. The legacy of the Medicine Wheels renews our understanding of the true intelligence of our Sacred Mother Earth, and teaches that without healing of the Self there can be no healing of the world.",
    "pages": [187, 189, 191, 194, 201, 202, 366, 400, 407, 409]
  },
  "meta:author": {
    "summary": "Hyemeyohsts Storm is Cheyenne, Sioux, Irish, and German — a Breed, a Metis. Born and raised on the Northern Cheyenne and Crow Reservations in southeastern Montana, he was trained as a Flower Soldier by the Zero Chief Estcheemah. He is the first person to ever write publicly about the Zero Chiefs and their discipline.",
    "teaching": "My name is Hyemeyohsts Storm. I am the author of Seven Arrows and The Song of Heyoehkah. I was born and raised on the Northern Cheyenne and Crow Reservations, which exist side by side in southeastern Montana. I am an enrolled Indian on the Cheyenne Reservation. I am a Breed of many places and many races. My mother was born Cheyenne, Sioux, and Irish-American. My father was born in northern Germany and later became an American.\n\nLightningbolt tells the story of how I met Estcheemah, my teacher. For me, Estcheemah was the most important and wisest human being who ever lived on Earth. She was a Zero Chief and a healer. The greatest gift that Estcheemah shared with me was teaching me how to teach myself. She said: 'Self-Teaching is one of the most profound reasons that humans live. When we teach the Self, we recognize the Spirit of Mother Life and learn to respect the Energies that birthed us all.'\n\nEstcheemah chose me because she believed I would endure. Breeds develop the strength to endure, because we are not a protected group in any society. She also chose me because I had learned to walk between cultures. To be a Flower Soldier means that you have been trained directly by Flower Soldier Chiefs. My lineage of Chiefs goes far back into antiquity.\n\nLightningbolt is the first book ever written about the Zero Chiefs — the highest rank possible within the ancient discipline of the Flower Soldiers. These patient, wise, courageous, and powerful teachers discovered and faithfully taught the wisdom and teachings of our ancient Medicine Wheels. The true power of these Chiefs is the wondrous way they teach the secrets of the human Self and the mysteries of our living Universe. Through their teachings we learn about the nature of war within every human being, and the triumph of the Human Self.\n\nI am very honored to dedicate this book to the courageous Zero Chiefs, who faced every kind of persecution and tyranny, and yet chose to devote their lives to the protection and furthering of the Teachings of the Medicine Wheels. Because of their enduring legacy, I have been given the greatest of privileges — the sharing of their history and knowledge with all of the Earth's people.\n\nI challenge you as you read to not reduce Estcheemah, or the Teachings of the Zero Chiefs, to only the examples shared here. Instead, try to expand the Teachings and reality of Estcheemah into the vastness of who this Holy Woman really was, and the ancient Self Discipline she taught.",
    "pages": [104, 176, 383, 386]
  }
}
