{
  "id": "mongolian",
  "name": "The Tenger",
  "description": "The Tenger are the divine spirits of Tengriism, the oldest continuous spiritual tradition of the Central Asian steppe, anchored to Lake Baikal — the Sacred Sea (Dalai-Nor) of the Buryat Mongols, the deepest and oldest lake on Earth. Baikal holds one-fifth of the world's fresh surface water in a rift valley that has been opening for twenty-five million years, and to the peoples of its shores it has always been alive: a breathing, ice-singing presence whose winter ice booms like thunder and whose summer surface holds the reflection of the Eternal Blue Sky — Tengri itself mirrored in the deepest water on the planet. Tengriism is not a religion of temples or scriptures but of open sky, running water, and sacred mountains. It was the theology of mounted nomads who lived beneath the largest unbroken sky on Earth, and its central insight is disarmingly direct: the sky is not where God lives — the sky is God.",
  "deities": [
    {
      "id": "tengri",
      "name": "Tengri",
      "title": "The Eternal Blue Sky",
      "group": "supreme",
      "description": "Tengri is the sky itself — not a god who inhabits the sky, not a figure enthroned above the clouds, but the open, endless, eternal blue vault as a living, conscious, governing presence. This is the theological center of Tengriism and the feature that makes it genuinely distinctive among world religions: the supreme deity has no face, no body, no mythology in the narrative sense. Tengri does not marry, does not fight, does not descend. Tengri simply is — above everything, seeing everything, patient and immense. The Secret History of the Mongols (c. 1228), the foundational text of Mongolian literature, opens by placing Genghis Khan's ancestry under Tengri's mandate: 'born with a destiny from Heaven above.' Every major decision in the text is framed as Tengri's will or Tengri's refusal. William of Rubruck, the Franciscan friar who visited the Mongol court in 1253-1254, recorded that the Mongols 'believe in one God, who is the maker of all things visible and invisible,' and that they called this God Tengri. Giovanni da Pian del Carpini, who preceded him in 1246, wrote similarly. The word itself is ancient Turkic and Mongolic, cognate with the Chinese 'Tian' (Heaven) — a linguistic connection that may reflect shared deep ancestry or millennia of cultural exchange across Inner Asia. What matters psychologically is what it means to worship the sky as such. There is no intermediary, no icon, no building that can contain it. You step outside your ger (yurt) onto the steppe and you are standing inside the temple. The pastoral nomad's entire life — riding, herding, migrating — takes place under this open sanctuary. Genghis Khan claimed his conquests were authorized by Tengri, establishing a model of cosmic mandate that parallels but predates the Chinese Mandate of Heaven. At Lake Baikal, the sky meets the water in a horizon line so vast and clean that on still days the boundary between them dissolves. The Buryat Mongols who have lived on Baikal's shores for centuries understand this: Tengri above, the Sacred Sea below, and the human life conducted in the luminous space between.",
      "animals": ["horse (the animal of the open sky)", "eagle (Tengri's messenger)"],
      "colors": ["eternal blue (khukh mongol)", "white"]
    },
    {
      "id": "etugen",
      "name": "Etugen",
      "title": "The Earth Mother",
      "group": "supreme",
      "description": "Etugen (also Eje, Itugen, or Etugen Eke — Mother Earth) is Tengri's counterpart and complement, the living body of the earth beneath the eternal sky. If Tengri is the open vault above, Etugen is the solid, fertile, grass-covered ground below — the steppe itself as divine feminine presence. She is the land that feeds the herds, the soil from which grass grows, the ground into which the dead return. Her theology is ecological in the most literal sense: the Mongols understood the earth as a conscious being whose body they lived on and whose generosity they depended upon. Rashid al-Din, the Persian historian who served the Mongol Ilkhanate and compiled the Jami' al-tawarikh (c. 1307), recorded that the Mongols venerated the earth alongside the sky, and that offerings of milk and airag (fermented mare's milk) were poured on the ground before drinking. Carpini noted that the Mongols were careful not to drive stakes into the earth unnecessarily, not to spill milk on the ground wastefully, and not to wash clothing in running streams — all acts that would offend Etugen or the water spirits associated with her. This is not mere animism in the dismissive colonial sense; it is a coherent ethic of reciprocity with the biosphere. What does it mean, psychologically, to treat the ground you walk on as a living mother? It means you cannot own it, only inhabit it. The Mongol resistance to agriculture was not merely economic preference for pastoralism — it carried a theological dimension: to tear open the earth with a plow was to wound Etugen's body. At Lake Baikal, Etugen's presence is felt in the taiga forests, the wildflower meadows of the shoreline, and the rich grasslands where Buryat herds have grazed for centuries. The lake itself sits in a rift in her body — a wound in the earth that filled with the deepest freshwater on the planet, as though her injury became a gift.",
      "animals": ["cow", "sheep", "marmot"],
      "colors": ["green", "brown", "gold (ripe grass)"],
      "vegetation": ["steppe grass", "wild thyme (used in shamanic fumigation)"]
    },
    {
      "id": "qormusta",
      "name": "Qormusta Tengri",
      "title": "Chief of the 99 Tenger",
      "group": "supreme",
      "description": "Qormusta Tengri (also Khormusta, Hormusta) is the chief of the 99 Tenger — the 99 celestial spirits who populate the sky and serve as intermediaries between the supreme, abstract Tengri and the human world below. He is the closest figure in Tengriism to a personal sky god in the Indo-European mold, and his name betrays his syncretic origins: Qormusta derives from Ahura Mazda, the supreme deity of Zoroastrianism, filtered through centuries of cultural contact along the Silk Road and absorbed into Mongol cosmology as the leader of the heavenly spirits. This is honest and important to acknowledge — Tengriism was never a sealed system. It absorbed elements from every tradition the nomads encountered: Zoroastrian, Buddhist, Manichaean, Nestorian Christian. Qormusta's role as king of the 99 Tenger reflects this layering. The 99 Tenger themselves divide into two groups in Buryat tradition: 55 Western Tenger (benevolent, associated with the right hand and goodness) and 44 Eastern Tenger (more ambivalent, associated with the left hand and conflict). Qormusta leads the 55 Western Tenger in an ongoing cosmic struggle against Atai Ulaan, leader of the Eastern Tenger — a dualism that maps loosely onto Zoroastrian good-versus-evil but retains a distinctly Mongol character, since the Eastern Tenger are not purely evil but represent the harsh, necessary forces of conflict, disease, and hardship. Buryat shamanic invocations (preserved in fieldwork by early twentieth-century ethnographers like Agvan Dorzhiev and later scholars like Roberte Hamayon and Caroline Humphrey) address Qormusta as the great protector, the spirit who sends heroic souls to earth and guards the order of the sky. His mythology includes a war in heaven that has clear parallels to both the Zoroastrian cosmic conflict and Buddhist Indra narratives — another indicator of the deep syncretic currents flowing through Inner Asian religion. At Baikal, Qormusta presides over the vast sky that the Buryats read as a living map: the stars are the campfires of the Tenger, the Milky Way is the seam of the sky-tent, and the Pole Star is the golden stake (Altan Gadasa) to which the sky-tent is pinned.",
      "animals": ["white horse", "eagle"],
      "colors": ["white", "sky blue", "gold"]
    },
    {
      "id": "ulgen",
      "name": "Ulgen",
      "title": "God of the Upper World",
      "group": "upper",
      "description": "Ulgen (also Ulgen Tengri, Bay-Ulgen) is the benevolent lord of the Upper World in the broader Turkic-Mongol shamanic cosmology — the sky-realm of light, goodness, and creative power that mirrors and extends Tengri's domain into the layered universe the shamans navigate. He is most fully attested in Altaic (South Siberian) traditions, where the universe is imagined as a great tree or cosmic mountain with multiple levels: Ulgen dwells at or near the summit of the Upper World, which contains anywhere from seven to sixteen layers depending on the tradition. The shaman's journey to reach Ulgen was one of the most demanding rituals in Central Asian practice — described in detail by the nineteenth-century ethnographer Wilhelm Radloff and later by Mircea Eliade in Shamanism: Archaic Techniques of Ecstasy. The shaman would ritually 'climb' through each level of the sky, passing obstacles and spirit-guardians, to deliver prayers and sacrifices to Ulgen's celestial court. He is a creator figure in several Altaic origin myths: he created the first humans, or the earth itself, sometimes in collaboration and sometimes in opposition to Erlik Khan, the lord of the Underworld. In one widespread Central Asian myth, Ulgen sends a diver (a duck, a loon, or a turtle) to bring mud from the bottom of the primordial ocean to build the earth — a creation-by-diving motif found across Siberia and into North America, suggesting extraordinary antiquity. He is generous, luminous, and somewhat remote — he gives good things but must be reached through shamanic effort. His animals include the white goose and the white horse, and his color is white throughout. It is important to note that much of our knowledge of Ulgen comes from Altaic and South Siberian sources rather than strictly Mongolian ones, but the cosmological framework is shared across the broader Turko-Mongol cultural zone. Around Baikal, the Buryat shamanic tradition maintains the layered sky-world that Ulgen inhabits, and the white-headed eagle — the eagle whose feathers adorn the shaman's costume — carries the shaman's soul upward toward his domain.",
      "animals": ["white goose", "white horse", "eagle"],
      "colors": ["white", "light blue", "silver"]
    },
    {
      "id": "dayisun",
      "name": "Dayisun Tenger",
      "title": "God of War",
      "group": "upper",
      "description": "Dayisun Tenger (also Dayichin Tengri, Daisun Tenger) is the war-spirit of the Upper World, the Tenger associated with military victory, martial courage, and the divine authorization of conquest. He looms large in the Mongol imperial period because Genghis Khan's campaigns were explicitly framed as Tengri's will executed through human agency — and Dayisun Tenger was the specific spirit invoked to grant the khan's armies strength, coordination, and the terrifying momentum that carried them from the Mongolian steppe to the gates of Vienna. The Secret History of the Mongols attributes Temujin's rise to Tengri's favor, and Dayisun is the war-aspect of that cosmic patronage. The Mongol military system — decimal organization, mounted archery, coordinated maneuver across hundreds of kilometers, the psychological warfare of deliberate terror — operated with a conviction that Heaven was actively behind it, and that conviction was not merely propaganda. The soldiers believed it. The generals planned on it. When campaigns failed, the explanation was that Tengri's mandate had shifted — not that the theology was wrong, but that Heaven's favor was conditional. This is the deep structure of Dayisun Tenger's significance: cosmic authorization is not a blank check. It can be granted and withdrawn. The Mongol model of war-as-divine-mandate influenced successor states across Eurasia — the Timurids, the Mughals, the early Ottoman ideology all carry traces of it. Rashid al-Din's chronicles repeatedly frame Mongol victories as Heaven's judgment, and the Mongol diplomatic letters preserved in European archives (including Pope Innocent IV's correspondence with Guyuk Khan in 1246) explicitly state: 'By the power of the Eternal Heaven, we, the Oceanic Khan, command you.' That is Dayisun Tenger's voice in the political register. At Baikal, far from the centers of empire but close to the ancestral homeland, the Buryat traditions preserve Dayisun as a protective war-spirit invoked in times of conflict — smaller in scale than the imperial theology, but continuous with it.",
      "animals": ["stallion (war-horse)", "wolf"],
      "colors": ["red", "iron grey", "black"],
      "metals": ["iron"]
    },
    {
      "id": "esege-malan",
      "name": "Esege Malan",
      "title": "The Creator Father",
      "group": "upper",
      "description": "Esege Malan (also Esege Malan Tengri — 'Father Bald-Head') is one of the most important Tenger in specifically Buryat tradition — the creator-father who, in some Buryat cosmogonies, made the first humans and established the order of the world. He is a Baikal deity in the most direct sense: the Buryat Mongols who live around Baikal's shores are his primary devotees, and his mythology is deeply embedded in the landscape of the Baikal region. In Buryat shamanic tradition, Esege Malan dwells in the upper levels of the sky and is the father of the most important heroic spirits. His creative act is often framed as collaborative — he works alongside or in tension with other Tenger — and the Buryat epic tradition (the uliger) frequently references his role in shaping the conditions under which heroes operate. What distinguishes Esege Malan from Tengri proper is personality: where Tengri is abstract, impersonal, the sky-as-such, Esege Malan is a father figure with agency, will, and something approaching emotion. He cares about the outcome. He intervenes. The ethnographic record on Esege Malan comes primarily from Russian and Soviet-era fieldwork among the Buryats — scholars like Matvei Khangalov (himself a Buryat), Garma Sanzheyev, and later Natalya Zhukovskaya compiled oral traditions that preserve his role in creation narratives, shamanic invocations, and ritual calendars. It is honest to note that these sources were collected during periods of colonial administration and Soviet atheist policy, which inevitably shaped what was recorded and how. Some traditions may have been suppressed, altered, or lost. What survives portrays Esege Malan as the intimate, accessible face of celestial power — the sky personalized as a father who made you and watches what you do with what he gave you. At Baikal, this theology carries emotional weight: the lake is ancient, the tradition is ancient, and Esege Malan represents the claim that this particular place and these particular people have a creator who knows their name.",
      "animals": ["eagle (as with most upper-world Tenger)"],
      "colors": ["white", "blue"]
    },
    {
      "id": "tsagan-ebugen",
      "name": "Tsagan Ebügen",
      "title": "The White Old Man",
      "group": "upper",
      "description": "Tsagan Ebügen (the White Old Man, also Tsagaan Uvgun or Sagaan Ubgen) is one of the most beloved and enduring figures in Mongolian and Buryat spiritual life — a white-bearded elder who embodies longevity, protection of livestock, fertility of the herds, and the blessing of a good life. He is depicted as an old man dressed in white, leaning on a dragon-headed staff, surrounded by animals — deer, sheep, birds — who gather around him in peace. He is the protector of life in its most grounded, domestic sense: healthy herds, safe children, enough milk, a mild winter. His origins are debated. Buddhist scholars point to his resemblance to the Chinese deity Shou Xing (the god of longevity) and argue he entered Mongolian tradition through Buddhist cultural transmission. Tengriist scholars counter that the White Old Man archetype predates Buddhism in the region and was later syncretized with Buddhist iconography — the white color, the association with nature, the protective elder, all fit comfortably within pre-Buddhist Mongol cosmology. The truth is probably layered: an indigenous spirit of nature and longevity encountered a similar Buddhist figure and the two merged over centuries of cultural contact. What is not debated is his centrality. Tsagan Ebügen appears in Tsam dances (the ritual masked dances performed at Mongolian Buddhist monasteries), in shamanic invocations, in folk art, and in the annual Tsagaan Sar (White Moon / Lunar New Year) celebrations. He is the figure who greets the new year, who blesses the herds at spring, who appears in dreams as a sign of good fortune. In Buryat tradition around Baikal, he is associated with the taiga and the lake's ecosystem — the seals (nerpa) that live only in Baikal, the omul fish that sustained generations, the forests that provided shelter. He protects what is already alive. His psychology is the psychology of sufficiency: not more, but enough. Not conquest, but continuity. Not the eternal sky in its terrible vastness, but the warm ger and the full stomach and the old man's blessing that tomorrow will be like today — and that will be enough.",
      "animals": ["deer", "sheep", "birds", "Baikal seal (nerpa)"],
      "colors": ["white"],
      "vegetation": ["birch (sacred tree in Buryat shamanism)"]
    },
    {
      "id": "erlik-khan",
      "name": "Erlik Khan",
      "title": "God of the Dead and Underworld",
      "group": "lower",
      "description": "Erlik Khan (also Erleg Khan, Erlik) is the lord of the Underworld — the ruler of the dead, the judge of souls, and the master of the dark realm beneath the earth. He is the most fully mythologized figure in Tengriist tradition, precisely because he is the figure who most closely resembles the narrative gods of other pantheons: he has a biography, a fall, a kingdom, servants, desires, and grudges. In the Altaic creation myth preserved by Radloff and later analyzed by Eliade and Jean-Paul Roux, Erlik was originally a companion or brother of the creator god (Ulgen or the supreme deity, depending on the version) who participated in the creation of the world but then fell from grace through pride, ambition, or disobedience — and was cast down to rule the Underworld as a consequence. He is the Central Asian Lucifer, but with important differences: his realm is not a place of punishment for sinners in the Christian sense but the destination of all souls after death, where Erlik judges them and assigns their fate. He is terrible but not gratuitously cruel. He demands his due. Shamans who journey to the Underworld to retrieve stolen souls or negotiate with Erlik on behalf of the sick undertake the most dangerous ritual in the shamanic repertoire — the descent, the confrontation, the bargaining. Erlik demands payment: a sacrifice, usually an animal, whose soul he accepts in place of the patient's. His servants, the elchi (messengers), roam the Middle World looking for souls to snatch — illness and sudden death are their work. His iconography in Mongol-Buddhist Tsam dances is spectacular: a massive blue or black mask with bulging eyes, crowned with skulls, wreathed in flames. He drinks from a skull cup. His animals are black — the black horse, the black bull, the black dog. It is crucial to understand what Erlik represents psychologically: the acknowledgment that death has a lord, that the underworld is organized, that the end is not chaos but a domain with rules. The steppe nomad who lived in constant proximity to death — from weather, warfare, childbirth, and animal predation — could not afford to pretend death was an abstraction. Erlik gave it a face, a court, and a protocol. Around Baikal, shamanic traditions of soul-retrieval journeys to Erlik's domain were practiced into the modern era and are being revived today as part of the broader Tengriist renaissance in Mongolia and Buryatia.",
      "animals": ["black horse", "black bull", "black dog", "owl"],
      "colors": ["black", "dark blue", "red (flames)"],
      "metals": ["iron (chains, gates)"]
    },
    {
      "id": "yer-sub",
      "name": "Yer Sub",
      "title": "Spirits of Earth and Water",
      "group": "lower",
      "description": "Yer Sub (also Yer-Su, Yер-Су — literally 'Earth-Water') are the collective spirits of the land and water, the animating presences that inhabit every river, spring, mountain, forest, and lake in the Mongol world. They are not a single deity but a category of spirit — and they are perhaps the oldest and most fundamental layer of Tengriist theology, the stratum that predates any named god. The Secret History of the Mongols mentions them repeatedly: Genghis Khan invokes Tengri above and Yer Sub below as the twin divine witnesses to his oaths and the twin sources of his mandate. The pairing is essential — Tengri is the vertical axis, the sky above; Yer Sub is the horizontal plane, the land and water that spread in every direction. Together they constitute the complete cosmos. Every significant landscape feature has its own Yer Sub spirit (ezen or ezed — 'master' or 'owner'), and proper behavior requires acknowledging these spirits when passing through their territory. The Buryat tradition of ovoo worship — cairns of stones built on mountain passes and hilltops where travelers stop to add a stone, circle three times, and make offerings of milk, vodka, or blue silk scarves (khadag) — is the most visible expression of Yer Sub theology. There are thousands of ovoos across Mongolia and Buryatia, each marking a place where the earth-water spirits are especially present. Marco Polo noted the Mongols' reverence for natural features; Rubruck described their offerings to earth and water spirits. The Soviet period suppressed these practices — ovoos were destroyed, shamans persecuted, rituals forbidden — but they survived underground and have returned with force since the 1990s. Lake Baikal is the supreme Yer Sub site. The lake has its own master spirit — Baikal Baabai or Dalai-Lama Ezen — and the Buryats have maintained specific ritual relationships with the lake for centuries: offerings before fishing, prohibitions against pollution, seasonal ceremonies at sacred points along the shore. The Baikal Yer Sub theology is essentially an indigenous environmental ethic: the lake is alive, it has a master, and that master will respond to how you treat it. In a time of ecological crisis — Baikal faces real threats from industrial pollution, tourism, and climate change — the Yer Sub framework is not merely a cultural artifact. It is an argument.",
      "animals": ["fish", "snake", "bear (master of the taiga)"],
      "colors": ["blue (water)", "green (earth)", "brown"],
      "vegetation": ["larch (sacred tree of Siberia)", "birch"]
    },
    {
      "id": "natigai",
      "name": "Natigai",
      "title": "God of the Household and Hearth",
      "group": "lower",
      "description": "Natigai (also Natigay, Nachigai, Itoga) is the god of the household, the hearth, and the domestic prosperity of the family — the protector of wives, children, livestock, grain, and milk. Our primary source for Natigai is Marco Polo, who described him at length in his account of Mongol religious practices (c. 1298): 'They have a god whom they call Nacigay, and they say he is an earthly god who watches over their children, their cattle, and their grain. They worship him with great reverence. Every man in the house has one. They make him of felt and cloth and keep him in the house.' Marco Polo describes the felt idols as having a wife and children — a complete domestic household in miniature — and explains that the Mongols would smear fat on Natigai's mouth before eating, offering the god the first portion of every meal. This is the theology of the ger (yurt) as sacred space: the round dwelling, with its central hearth, its smoke hole open to Tengri above, its doorway facing south, is itself a microcosm — and Natigai is the spirit who blesses its interior. The hearth fire is particularly sacred in Mongol tradition, protected by fire-spirits (Golomt Eej, the 'Mother of the Hearth') with strict taboos: never put a knife into the fire, never step over the hearth, never extinguish a fire with water. Natigai presides over this domestic sanctity. What Natigai represents psychologically is the recognition that the spiritual does not begin at the temple door — it begins at the threshold of your home. The ger is the temple. The milk tea is the offering. The felt idol with fat on its lips is the presence that makes a shelter into a household. William of Rubruck also noted felt figures in Mongol tents, confirming Marco Polo's account from fifty years earlier. Around Baikal, Buryat families maintained (and in many cases still maintain) household spirits and hearth rituals continuous with the tradition Polo described. The felt figures are rarer now, but the theology persists: the home is sacred, the fire is alive, and the first pour of tea goes to the spirits before anyone drinks.",
      "animals": ["sheep", "cow", "goat (the herds he protects)"],
      "colors": ["warm brown (felt)", "orange-red (hearth fire)", "cream (milk offerings)"]
    },
    {
      "id": "bai-ulgen",
      "name": "Bai-Ülgen",
      "title": "Creator of Souls",
      "group": "lower",
      "description": "Bai-Ülgen (also Bay-Ulgen, Bai-Ulgan) is the supreme creator-spirit of the Altaic Turkic tradition — the benevolent lord of the Upper World who creates human souls and sends them down to be born. He overlaps significantly with Ulgen and is often treated as the same figure under a slightly different name, but Bai-Ülgen specifically designates the Altaic variant found among the peoples of the Altai Mountains, southern Siberia, and the broader Turko-Mongol shamanic zone. The 'Bai' prefix means 'rich' or 'holy.' Radloff's late nineteenth-century fieldwork among the Altai Turks — the most detailed ethnographic record of Central Asian shamanic practice before Soviet disruption — preserves the white-horse sacrifice to Bai-Ülgen as the most elaborate ritual in the shamanic calendar: a white mare was sacrificed, its soul sent upward through the sky-levels by the shaman who beat his drum and chanted the stages of the celestial ascent, passing through each layer of the Upper World until he reached Bai-Ülgen's golden court and delivered the community's prayers. This ritual sequence was the basis for Eliade's analysis of shamanism as 'techniques of ecstasy' — the drum as the shaman's horse, the ascent through cosmic levels, the audience with the sky-god. Bai-Ülgen creates souls — the kut or suns — and sends them earthward to enter newborn children. He decides who receives a soul and what qualities it carries. He is the source of shamanic power itself: the shaman's gift comes from the Upper World, and Bai-Ülgen (or his emissaries) choose who will bear it. His presence in this pantheon alongside Ulgen reflects the reality that Tengriism is not a single system with a fixed canon but a family of related traditions spread across the Turko-Mongol world, with local variations that resist neat systematization. Honest scholarship acknowledges the overlap rather than pretending each name maps to a wholly separate deity. Around Baikal, the Buryat tradition draws from both Mongol and broader Siberian sources, and Bai-Ülgen's soul-creation theology is woven into shamanic initiatory narratives — the new shaman's soul was chosen and marked by the Upper World before birth, which is why the call cannot be refused.",
      "animals": ["white horse (the primary sacrificial animal)", "white goose"],
      "colors": ["white", "gold", "sky blue"]
    }
  ]
}
