{
  "golden-age": "ATLAS: This is the bright and blooming world—the world we’re taught to trust, the one that calls itself real. It is the garden before the fall, the reflection before the ripple. Everything is separate here. Everything makes sense. But this “normal” is not neutral. It is shaped by history, by hierarchy, by inherited scripts. And beneath the appearance of harmony lies a longing: for something lost, or not yet known. The surface is not a lie—it’s a mask. And every mask is waiting to be lifted.\n\nPSYCHLES: Sun reaches the apex of noon each day. The moon fills with light each month. Summer Solstice brings the year to its fullness of illumination. By midday we are fully awake. Plants and animals are in full flower when sexually mature. A fully mature adult is in the prime of life.\n\nFORMS: For Propp, this is the initial situation, which Campbell describes as the ordinary world of waking day. For Jung, this is the world of consciousness. For Andre Breton, this is an imprisoning reality of reason, which builds on Nietzsche’s notion of a world built around common rules and social norms—similar to how Hegel presents the spirit of the age. Such normality makes up a kind of surface world of the known and understood. The surface self, the mask self, is what Jung calls the persona. When the ego—everything with which I identifies with—limits its identity to the persona, the ego, like narcissus, identifies with its face in reflection.\n\nThe surface world is that of our common sensory experience—what Kant calls, Nature. This is the world of phenomena—of the world as it appears to us. In Plato’s allegory, the cave of perception is also the abode of common sense. To Plato, this is the world of the particulars. To Democritus, this is the world of particulates—he called them atoms. In this world of material objects, everything is separate, everyone is separate. Since the birth of atomism in the Milesian Eden of philosophy, the understanding of reality as reducible to material bits has led to the belief in deterministic causality and the disbelief in free will, soul and the gods. Plato, who saw the forms and soul as more foundational than the material that imitated them, wanted to burn Democritus’ writings. Aristotle, however, who saw substance as more foundational than form, spun the history of philosophy as the birth of materialism.\n\nSCRIPTS: For Vogler, this is the Normal World of Common Sense—the ordinary. As Harmon describes, this is You—where you are at the start of the story, in your comfort zone. Snyder calls it the current state or world before the story. To McKee, this is the status quo, which is a world in relative balance. What’s interesting about bringing this into such a narrative conversation is that we begin to see this as the world of set ups—this is where we establish all the change that needs to happen, all the norms that will have to shift. As Syd Field explains, audiences do not do well with extended disorientation at the start of a story. Instead, we tend to start in a world that matches the audience’s own orientation—normality. From Harry Potter to The Matrix, we start in a relatively normal and mundane reality before adventuring into the unknown. In this reality, we see what’s missing. We see the want. We see the need of each character and the needs of the world. Even Eden, in the Greek Septuagint, was meant as a set up. Humans, as in Greek myth, were never meant to not break their chains, to not find the fire, to not have free will, to not pursue knowledge. The human condition cannot be reduced to surface reality. The human condition includes a striving to adventure beyond the known.\n\nMYTHS: What walks on Two Legs at Noon? This is when Christ, at his height, gives his sermon on the mount—before his call to Jerusalem and journey through death. Osiris is a Pharaoh at the height of his reign, married to Isis in her prime. This is his life before his journey through the Dua. Inanna, when the story begins, before her journey through the nether world is the Queen of Uruk. This is when Adam & Eve live in the protective summit of Eden, in God’s garden of comfort, before the incident, before the human story started. Persephone, an adult, still goes by the name of Kore, or maiden—known to the world as her mother’s daughter. In full flower, she plays in a field of flowers with her friends in full flower. Siddhartha is a fully grown and quite exemplary man with a wife and child. Prince of a great kingdom on course to inherit the throne from his father. This is what his father wants, for his son to be like him, just as Demeter wants Persephone to be like her. To maintain this trajectory, he has to resist the authentic destiny of the Buddha. The mother of Perceval and Sosruquo do the same. In the case of Siddhartha, he is still within the illusion of his world. This can be said for Plato’s philosopher in the Allegory of the Cave, who begins within the illusion, convinced that shadows on the wall are reality. People in the cave have no idea they are in a cave, that they are bound or that they are mistaking shadows for truth. As the Buddha and Philosopher set out from their respective kingdoms of illusion, Hercules, at the start of each labor, is called forth from a kingdom, from a court, like the Arthurian Knights on quest. Prior to the first labor, he lived at home with his wife and children—not unlike the Buddha.",
  "falling-star": "ATLAS: The crack begins. Something slips in. Or out. A whisper, a blunder, a flash of lightning. A meteor falls. A shadow stirs. This is the moment something in us or around us says: “Not this.” We are summoned—sometimes gently, sometimes with fire. And though we resist, we cannot un-hear it. The story has begun its pull. The hero in us is called not toward triumph, but toward transformation.\n\nPSYCHLES: The sun enters into its afternoon hours, during which time shadows grow. This is when the slivers of darkness displace the moon’s brightness, allowing nights to grow darker again. The days, too, grow shorter. This is the fall when autumn colors the world. In this time of day, month and year, we see the new awareness of darkness and mortality shift priorities of flower to fertilization. These are the hours of the mating call. At the same time, this is the time of weary wilting—a call towards sleep and death.\n\nFORMS: For Hegel, this is when history sees an unconscious impulse come forward in the voice of a great leader. For Jung, this is when the individual experiences an unconscious impulse towards the great voice within. This can look like the disruption of an individual or collective ego by its shadow. Sometimes these can take the form of what Freud called blunders. We call them Freudian slips. This is when something slips from the repressed domain of the unconscious into that of the spoken. On a metaphysical level, this may take the form of a synchronicity, which is when something improbable happens—like a meteor or lightning—that changes or defines the course of a story.\n\nEven the hardest of walls and the most static of status quo’s can be disrupted by the smallest blunder or synchronicity, which can serve as the first crack or gap in a stage that the ritual studies scholar, Gannep, described as the preliminary rites—what we do to prepare for a rite of passage. Campbell called this a stage of separation. Separation, for Freud, is fundamentally Oedipal, by which he means, all separation evokes our deepest and most original trauma of separation, which was the separation from our mother, which was our first experience of separation from the world, which repeats when we leave home or any sanctum of love.\n\nWhat Propp saw in fairytales is that they are driven by an essential lack, that this lack will relate to a connective incident and an approach with a request. The experience of separation as trauma leads to its resistance. Resistance to departure has been described by Campbell as the refusal of the call, which is as much about a fear for the unknown ahead as it is about parting from comfort. This call to departure in the heroic psyche is seen by Nietzsche in the beast of burden, which feels called to champion the values of its homeland by accepting the burden of a perilous journey on its behalf.\n\nDuring this stage of the journey, protagonists are often met by mentors who have been on their own journeys before, which enables them to serve as guides, as psychopomps. It is often from these elders that supernatural aid in the form of a magical weapon or object empowers the decision to accept the quest.\n\nSCRIPTS: Stories get going from their starting place with inciting incidents, which should serve as a major hook for the audience. These are radical or abrupt dislodgings of characters and their worlds from that status quo in which they begin. According to McKee, this event often entangles the destiny of characters and their reality with a first cause that will necessitate a conclusory effect in what functions as an obligatory scene. In this obligatory scene, a balance will be restored that has entered a state of disequilibrium. The new balance, however, will not be a return, it will build on a new understanding that will come from an increase in awareness that this disequilibrium inspires. This is why Blake Snyder describes the inciting incident as a Catalyst, because it is not just something that disrupts, it is something that is going to trigger an acceleration towards a desired change. As Harmon explains, the change to come will follow the pursuit of a need or want by the now activated forces of protagonism.\n\nMYTHS: Inanna sets her mind on the great below. This is when Osiris is called to a coffin fitting party by his chaotic brother, Seth. This comes when the grain, entering its golden age, calls to be mowed down. This is when Persephone plucks the Narcissus flower, a reflection of her, which symbolizes her own readiness. This is when the readiness of Christ is tested—when he is called to his passion in the Garden of Gethsemane, when he is scared and resistant. It’s when Jonah resisted the journey before he was swallowed. It’s when Noah and Moses were called and resisted. When Perceval is called to Camelot by Arthurian Knights, resistance to his departure, like that of Sosruquo’s, is voiced by his mother. When the Buddha sees the four sights, when he recognizes the truth about humanity’s waning, his desire to go on a quest for enlightenment is resisted by his father. This call to departure from home and innocence is known to us in the form of Satan’s call from Eden, to Eve and the fall of first humans. The eating of the fruit is the great inciting incident for the entire Jewish, Christian, Islamic and Yizidi tradition. It disrupts their sense of who they are and dislodges them from their known home while their awareness increases. In the Grimm Fairytale called, The White Snake, the inciting incident occurs when the King’s Chef eats a bite of the king’s mysterious dish—a white snake—which gives him the ears to hear the animals.\n\nThe goddess, from the “great above” she set her mind toward the “great below,” My lady abandoned heaven, abandoned earth, To the nether world she descended, Abandoned lordship, abandoned ladyship, To the nether world she descended.",
  "impact-crater": "ATLAS: We leave the known. The bridge collapses behind us. We fall into forests, caves, oceans—through mirrors and under skins. The familiar is no longer here to save us. This is the domain of dream, of shadow, of psyche. We are being turned inside out. Crossing is not just about location. It is about orientation. Here, the world tilts, and we learn to walk without a map.\n\nPSYCHLES: Sunsets across the horizon, descending from above to below. The half-moon wanes towards empty. Shortening days are as short as they are long at the Fall Equinox. Falling asleep, we depart from wakefulness. Mother and Earth are penetrated for the planting of seed. Consciousness departs from the body upon death.\n\nFORMS: For Nietzsche, this is when the Beast of Burden crosses into the desert in an effort to prove that he can be the greatest champion of status quo values. This is when the sea farer is swallowed—into the sea, into the whale. According to Frobenius, this was the sunset. According to Jung, water represents the unconscious. To be swallowed by the sea or overwhelmed by waves is to be taken into the space of dream—into an inner reality that is not familiar to a conscious ego. Joseph Campbell describes this as Crossing the Threshold of Adventure, which is when a hero departs from the known world to enter an unknown reality. The phrase appeared earlier in Rudolf Steiner’s work, Way of Initiation, as a description of an initiatory threshold crossing—sometimes with a disorienting blindfold. As Propp describes, this is a stage of departure—of leaving home. It could be the result of a brother battle or crucifixion, abduction or a ferry crossing. Sometimes the stories we tell, like those of our lives, are those that close with the sunset, and for these, time and again, we see imagery of ships sailing off to the West. [See Aristotle’s Beginning, Middle, End as Sunrise, Day, Sunset.]\n\nSCRIPTS: Plot Point 1 is, according to Field, the point between Act 1 and 2—it hooks and spins the action in a new amped up direction. Vogler, drawing from Campbell, describes this as Crossing the Threshold. This is when a protagonist goes from the ordinary world into a special world. This may look like a choice to accept the call and to confront the conflict ahead. Snyder emphasizes the connection between the threshold crossing between worlds and acts when he describes this part of the story as a Break into 2. For Harmon, this is Go—this is when the characters begin an exploration into an unfamiliar situation. Dara Marks calls it the first turn, which comes with a sort of awakening to newly discovered reality. For someone who has long leaned into masculine qualities, this can mean new identification with feminine virtues, or, as Maureen Murdoch describes, for someone who has yet to identify with masculine virtues, this can mean a new thread of identification with the masculine.\n\nMYTHS: Behind the scenes, Osiris has had sex with Nepthys—Seth’s wife. What everyone sees is that when Osiris enters the coffin, Seth and his conspirators slam it shut then send it to sea, like a baby in a basket. This mythic crossing of the departure threshold corresponds with an esoteric moment from the Pyramid Texts, AKA the Book of the Dead. This is the moment when Osiris, riding the solar boat, a correlate of the coffin, crosses into the duat. At the front of the solar boat is Seth, who cuts the way, for the solar company, into the underworld. To enter the underworld, he must use his crooked staff to part the sea, a sea of chaos represented by a serpent—Apep—known by the Greeks as Oceanus. The staff he uses is a stylized adze, which is the original tool used to penetrate earth for the planting of seeds. This is the essential imagery for the entire scene. This is the sex of Osiris with Nepthys, this is the crossing of the sun from sky to earth, the crossing of corpse from above to below. The earth splits open before Hades arrives in his chariot to abduct Persephone. This represents her entry into death and marriage—also depression and winter. The splitting of earth—the mother of mother of mothers—is a sexual image. Inanna crosses the first gate into the underworld. To do so, she must humble herself of the living ego and remove a layer of her clothing—clothing of the living world that carries her queenly powers and pride. When Christ dies on the cross, the veil isolating the holy of holies is ripped. This communicates the availability of Holy Spirit to every heart following his sacrifice. He is then embalmed and placed in a sepulcher, in a cave. Hercules crosses the river Styx as he enters the underworld, where he is ferried across by Charon, and his long pole—not unlike the poles used by Gilgamesh, to cross the western ocean. Siddhartha departs from home, from the palace, from his family, and into the forest—the domain of ascetics from whom he will learn. Upon his departure he cuts his hair, which is an expression of his complete inner commitment to the journey. Plato’s philosopher leaves the cave.",
  "forge": "ATLAS: The road forks and burns. Trials mount. Friends arrive. Masks fall. This is the heart of the journey. It doesn’t look like success—it looks like confusion, humility, failure, surrender. But something is being shaped. Not through conquest, but contact. We are being asked to listen. To be undone. To feel. The self is forged not by force, but by the fire of encounter. And there is beauty here—beauty we never saw when we were whole.\n\nPSYCHLES: Sun journeys from sunset to its nadir. Shadow grows as the moon wanes. Days darken and cool. Fall dies to Winter. The sleeper journeys through dream. Procreation—Seed, sperm and pollen journey to the womb of conception. The body becomes dust as the soul journeys through death.\n\nFORMS: The Beast of Burden Journeys Deep into the Desert, where the introspections begin to define the landscape. The seafarer now travels in and with the whale—down, into the depths of the sea. The middle stage, for Gennep, is defined by the rites we experience in the liminal space to which we have journeyed. This is when we initiate. In the process of individuation, this is when we develop Inferior Functions of the Shadow and Unconscious while the ego begins to be deconstructed and the will begins to fail. For Campbell, this is the Road of Trials on which the hero meets helpers and grows from tests—a word Propp uses for this stage of the journey. For Maureen Murdoch, this is a Road of Trials, Ogres and Demons.\n\nSCRIPTS: This is the heart of Act 2, which, for Field, is defined by confrontation. Driven by their dramatic need, protagonists work through a series of obstacles. McKee describes them as Progressive Complications that continue to raise the level of antagonism and conflict. This is when, as Vogler describes, the hero is tested. They may also, as in the Wizard of Oz, meet a series of friends, some of which may prove to be enemies. Snyder describes this stage of the story as Fun and Games, which he also describes as the moments and montages that tend to find their way into trailers. This is when, after having been swallowed into an unknown world, the characters begin, as Dan Harmon would say, to adapt. This rising action will lead us into the midpoint ahead, which will raise the stakes as the second half of act 2 starts into the nadir. On the way, as Dara Marks describes, the character may be pushed to their breaking point.\n\nMYTHS: Osiris is led by the solar company through the Duat of stars and sea. This is associated with the cutting of Osiris into 14 pieces by Set, which mimes the 14 disappearing slivers of moon. During this time, Isis searches for her lover. Persephone is taken down into Hades, by Hades. Simultaneously, Demeter searches for her daughter. Inanna descends to the underworld, gate after gate, level after level; and at each level, she is required to release an article of clothing or me, which refers to her unique personal power and essence. She has to release a little more pride and a little more ego or self-identity as she descends lower and lower. Christ journeys into hell, bruising to pieces the gates of iron.\n\nHercules travels through Hades, like Orpheus, Persephone and later Dante. Along the way, these figures see the recurring landscape of the underworld with always profound additions and deviations. On this stretch of Siddhartha’s Journey, he is pursuing the ascetic’s path. He is resisting the influence of his body on his consciousness through the purifying of his desire for sensory pleasures and material sustenance. During this time he experiences transcendence of the body and learns equanimity and detachment, but he has also become emaciated. In Plato’s Cave, the figure is at first blinded by the light, but then the eyes adjust. Traversing the open domain, truth is seen, received and transformative. The illusion and its influences fade away.\n\nMIDPOINT — ATLAS: Something turns. The direction of descent slows, and a deeper awareness begins. We realize we’ve gone too far to turn back—and too deep to deny. This is the axis of the spiral. The fire does not rage—it refines. Clarity begins to glow like embers in the ash. Often misunderstood as climax, this is not a peak, but a pivot. Here, illusions die, motives shift, and the hero may betray an old loyalty to make space for a truer path. This is the undoing of false quests. The grail was never out there. Something within begins to pulse with knowing.\n\nMIDPOINT — PSYCHLES: At the midpoint between sunset and midnight, the world finally becomes dark, between the fall equinox and the winter solstice, when we truly enter winter; between falling asleep and the destination of our dreams, when the quarter moon becomes a crescent. It’s Halloween and Día de los Muertos, which occur at the transition-point between fall and winter, between twilight and darkness, between dying and dead. Like Samhain, their situation in the calendar correlates with their cosmological position: the threshold of darkness and wintery death. It doesn’t get dark at the sunset or cold at the fall equinox—this is a different threshold, a next threshold, a deeper threshold.\n\nMIDPOINT — SCRIPTS: Vogler’s interpretation of Campbell is that the Ordeal at the Nadir is the Midpoint. Blake Snyder places the nadir at the transition between act two and three. What comes into focus is that the ordeal, at its fullest, extends from midpoint to the end of act two. In Star Wars, the entire ordeal takes place in the Death Star. At the midpoint, they are pulled out of the Death Star. At the end of Act 2, they escape. In the context of the three-act structure, the midpoint is in the middle of the movie, which is also in the middle of Act 2. It’s known as the midpoint, around which several concepts revolve. On a geometrical level, the midpoint is often associated with some kind of turn. This turn takes many forms. It can look like a turn of events, a betrayal or a flip in perspective around what’s really good or bad. At the midpoint, it’s common for the plan to go totally wrong. This might be when the world finally starts to get really dark or deadly.\n\nMIDPOINT — FORMS: Though the thinkers we have been following engage the initiatory phase and coming ordeal, midpoint is not addressed directly by Jung, Campbell, Nietzsche, Frobenius or Gannep. That having been said, we can imagine the moment when, traveling in the belly of the whale, the direction changes—from more down to more forward. This would be noticed by the traveler, who would begin to think about what’s coming. For Jung, we might imagine a shift in emphasis from expanding our undiscovered self to an emphasis on shedding. This is when the final slivers of former moon let go, and not always willingly. As we approach the Nadir, our struggle is to let go of what was, or, as detailed by Nietzsche, a confrontation with its upholder—the Tyrant Thou Shalt.\n\nMIDPOINT — MYTHS: Inanna descends through several thresholds. These are the nine realms of hell described by Dante. Notice, the more gates and passages we move through after we enter a foreign world, the deeper in we feel. Buddha entered the forest and began his training as an ascetic at the threshold. By this point in his journey, he was famously emaciated. Ascetics are. This is because they believe body is corrupting their clarity—that they have to liberate consciousness from the demands of body if they are to see with clarity. On this path, the Buddha achieves many superpowers—the liberation of mind from body is profound—but he is not achieving his goal. He set out to achieve liberation from suffering that comes from the fear of disease and death.\n\nThe ascetic’s goal has to do with the liberation of consciousness and spirit from body, which is seen as a prison. The supporting metaphysical understanding is that the spirit can and will retain its identity long after our bodies die. In the Hindu tradition, this is called the Atman, which is a word for breath, not unlike the word for soul used by so many other traditions, including those of the essentially ascetic Hebrews and Pythagoreans at the heart of Western thought. The Buddha was beginning to understand that the strategy of the ascetic is a strategy built around the purification of an immortal atman. He was also beginning to understand that the ascetic perspective was fundamentally at odds with nature and the body. This is when he decides to betray the ascetic path. This is when he shifts from building superpowers to refocusing on his main goal. It’s when his friends part ways from him, and when the trajectory of events takes a major turn. Women were not allowed in the holy orders before Buddha, and Maya, illusion, was seen as the great mother. This is when he realizes women and the material world are not the enemy, they are vessels. This is when he accepts a bowl of milk and rice from a young girl. The betrayal is the filling of his belly with material sustenance, but also the reception of this feminine symbol from a feminine figure.\n\nParsifal, Wagner’s opera on the Holy Grail, was originally based on the Buddha. This juxtaposition of the grail quest with the quest for Enlightenment was there, is there and will always be part of the story—but why the grail? The reduction of women to wombs is a travesty for the ages. The recognition of womb as of the woman is unavoidable. So, too, is the alignment of vessels with wombs—cups, bowls, ovens and the furnace. When a man in a man’s world with male company is on a quest for a vessel, it’s a quest for the feminine. This quest may be for a literal woman or literal grail. It might be a quest for the understanding of Mahamaya achieved by Buddha. The reduction of women to mothers to matter to object to prison is harmful and enmitous to life. The Maya of Mater—the illusion of the material world—is not a prison. The body is not a prison. Without body or reality, there is no space for life or its journeys.\n\nAll that anger we see in Adam and Eve’s narrative, in Pandora’s Box, is an anger at the feminine for bringing us into our fallen reality, into the human condition, into the suffering of mortality and its labors. The ascetic traditions are mad at being born. As Dionysus’ teacher, Silenus, once said, may your life be short, because it is better to not be born at all. Not for the Buddha, not for the Grail Knight—these are the male heroes who have traveled beyond the limitations of toxically self-referential masculinity into the territory of balance, of integration. But the midpoint is not when Buddha achieves that integration, and it’s not when the grail knights find their chalice. This is when Siddhartha stops what he’s doing and makes way for the Bodhi Tree for his big ordeal—the 39 day meditation in which he will achieve enlightenment.",
  "quenching": "VIA NEGATIVA — ATLAS: We surrender the searchlight. The questions fade into silence. We stop asking what to do and begin unlearning who we thought we were. This is the path of shedding, scraping, emptying. The moon goes dark. The voice quiets. The will sleeps. We are not abandoned—we are being stripped of what could not go forward. This is not loss. It is kenosis. The vessel must be hollow to hold the wine. And here, in the stillness, in the absence of answers, we hear the sound of something waiting to be born.\n\nVIA NEGATIVA — PSYCHLES: This is when the moon wanes from a quarter to its final sliver. This is when the days shrink to their darkest during the winter season. This is when the night approaches its darkest. It might be seen as the final journey of a seed in earth as it approaches its point of conception—that time when the sperm has all but reached its destination.\n\nVIA NEGATIVA — FORMS: Socrates’ approach to truth is the emptying of self. This is known as the via negativa, the negative road, the pursuit of truth through the annihilation of delusion, which comes through an annihilation of the deluder, which is the ego in service to worldly needs. In Christianity, this is known as kenosis, the way of emptying. Christ’s tomb isn’t emptied yet, but this is where we are going. Ahead will be the final challenges of self-emptying, here, we feel it coming. Maureen Murdoch describes this as the stage in which we awaken to feelings of spiritual aridity and death.\n\nFor Eliade, this is when those on journey become near to the center of existence. We are not there yet, but we are nearing, and this is our focus. We are, for Campbell, approaching the Nadir, where the ordeal will occur. Expectation, anticipation, preparation—this is where we are at this stage. For Eliade, as we approach the center, we begin to become aware we are participating in sacred time, that we are living a myth of great renewal.\n\nVIA NEGATIVA — SCRIPTS: A lot is said about characters being the decisions they make, but agency is reached along an arc. While on one level, characters will gain agency as they complete their journeys, on another, part of this late stage of our initiation is learning to not try to control what we cannot, to let go of our grip. Real agency can only be assumed by our inmost self when our self-important ego stops gripping the wheel. This can take what Snyder describes as a false defeat, which might be better described as the defeat of the will, which will set us up to find power that can come through us when we empty ourselves. Sometimes this looks like the team breaking up. For Snyder, this is when the bad guys close in. For Vogler, this is when characters might put an emphasis on preparation and approach. The innermost chamber may even be ahead and in sight.\n\nVIA NEGATIVA — MYTHS: The negative road is the Socratic path of pursuing wisdom through the dissolution of ignorance. This is the scattering of the lunar pieces, that are the seeds that are the body parts of Osiris, from which the temples of Egypt will spring. This is when Inanna is losing her last articles of me. Demeter is withholding rain and growth, allowing winter, out of stubbornness and hurt, demanding Zeus give her daughter back. Crops are not growing.\n\nNADIR — ATLAS: The Nadir is the sacred zero—the midnight of the soul when the last light gutters and the first spark has not yet shown itself. Here the via negativa ripens into its deepest work: not refinement, but undoing. The ego loosens its grip, the sword melts, the will bows, and we pass through the crucible where false agency dies so that true agency can be born. This is the dark chamber before resurrection, the winter solstice pivot, the new moon womb, the belly of the whale where fire is seized from the depths. It is confrontation and atonement, death and sacred marriage, the meeting of father and mother within, where thesis and antithesis yield to a hidden synthesis. In myth it is Osiris quickened in the Duat, Inanna fed from beneath the nail, the Grail recovered, the Boon grasped in darkness. Not purification but integration; not triumph but surrender so complete that poison turns to medicine and hero becomes human. At the Nadir, we are not tested—we are transformed at the root, and from that root the first light begins its rise.\n\nNADIR — PSYCHLES: Midnight is to day what new moon is to month is what the winter solstice is to the year. This is the time of the least light—the darkest hour, the darkest night, the shortest day. This is when direction changes from the last light to the first. This is seen in the first spark of life. This is the first sliver of moon, the radical first root of a still seed, the first spark of a new life.\n\nThe last sliver of moon might be associated with the crescent blade of death’s sickle or a sword curved into a symbolic expression of death. Here, too, are tusks and horns, knives and axes. The other side of the crescent, however, the light and life bringing side, is an expression of new life, new hope and a day on the rise. Here we see the juxtaposition of creation and destruction in the rooting and tilling of a boar. The tusk of destruction, just like the blade, becomes recognized as a weapon of creation. This is seen in Arthur’s sword or the cornucopia that had threatened Hercules as a deadly horn.\n\nAround the winter solstice, we see holiday after holiday associated with the miracle of light. The Roman Sol Invictus is about the challenge of the Sun to make it through the nadir, to change direction on the darkest night and to begin its return at the hardest hour. This is why, in Southern California, Chumash shamans perform ceremonies in caves at this pivot. This is when Slo’ow, the great eagle, plays dice with Coyote. This is the darkest moment. Will things begin getting better, finally? Or will they get worse?\n\nNADIR — FORMS: For Frobenius, this is when fire is seized from the belly or heart of the whale, once it’s come to rest on the seafloor. This is what we see in Pinocchio, but it also occurs with Hercules, who comes back from the whale’s belly with his head burned bald. For Nietzsche, this is that moment when Lion roars No, when the defender of the status quo is heroically confronted. For Jeff Kripal, this would be the tipping point from victimhood to agency, to authorship.\n\nIn the Freudian Drama, the thou shalt tyrant is the father, for which reason this moment can look like a confrontation with the father, the devouring father, like Cronos, like Darth Vader—Dark Father. In the Jungian context, this is when the ego dies, and in the wake of the death of the ego, we meet the Self, the totality of our being and inner image of God. Campbell calls this, atonement with the father. Shifting from an emphasis on the confrontation with the father as conflict, Campbell points to it as what sets up atonement with the father figure or inner divinity.\n\nThe Nadir aught to be broken into three key points, last light, no light and first light. The last light would be the blade, the confrontation, the lion’s fight with thou shalt or fight with the father. No-light would be the experience of self in the wake of ego’s annihilation and atonement with the father. This is also when we atone with the mother, or, as Campbell describes, meet the Goddess. This is when the Buddha reaches down and touches the earth to demonstrate his union with what she represents—with mater, maya and the feminine. This is also when we have to dig in extra on the question of masculine and feminine perspective as we move through psychles. While this may be the moment in which the masculine integrates the feminine, this can also be when our questing feminine unifies with a previously externalized masculine. Jung and Campbell describe this as a Hieros Gamos, a sacred marriage, a union of opposites. Beyond masculine and feminine, this is when any thesis and antithesis, as Hegel would say, find synthesis.\n\nNADIR — SCRIPTS: This is what Dara Marks calls the Second Turn. For Syd Field, the Nadir aligns with Plot Point 2, which he describes as the big plot point that swings us from act 2 to act 3. Snyder describes this moment as the Break into 3, which follows what he describes as the Dark Night of the Soul, or what sometimes gets described as the Dark Moment. This notion might be said to come from St. John of the Cross, who talks about finding the light and his faith only in the darkest hour, when he had abandoned all hope. This, however, is the same structure as the final extinguishing of light known as Nirvana, as seen when the moon turns new, when the sun reaches midnight, when the ball drops on new year. For Vogler, this is when the sword, fire or elixir is retrieved. Campbell calls it the Boon. McKee describes this final push of Act 2 as a major crisis, and as described before, Vogler has called our attention to the fact that the ordeal often takes place in an innermost chamber.\n\nNADIR — MYTHS: Osiris receives the first spark of life on his journey to resurrection. This occurs in Aker, the bottommost point of the Duat, between two great cats. These are the great cats we see on either side of a gate or earth mother goddess. These are the defenders of sunrise and sunset. These are the thighs of the great mother, between which we find life’s spark. This is the spark that comes forward when Persephone conceives of the pomegranate seed in Hades’ chambers. This is the spark of Enlightenment with which Buddha returns (dependent coarising). This is the fire retrieved from the belly or heart of the whale as it sits on the ocean floor. This is the theft of fire from Zeus and the sword from the stone. It is the Holy Grail—that thing for which we quest. That thing with which all can be saved, through which the journey can fulfill its purpose. When we return with this elixir, boon, insight, weapon or child, we return with that actuating agent that can transform our world. Inanna may hang totally dead on the peg for three days and three nights, but when she receives the water and food of life from beneath the thumbnail of her maternal grandfather, she not only starts to life, she starts into labor.\n\nRise like Lions after slumber / In unvanquishable number— / Shake your chains to earth like dew / Which in sleep had fallen on you / Ye are many—they are few. — Percy Bysshe Shelley",
  "integration": "ATLAS: We rise, but not as we were. We have not defeated the world—we have allowed it to shape us. Now we come back, not to restore the old order, but to seed the new. The boon is not a trophy. It is a shift. A new frequency. A deeper sight. And though the world may not welcome us, we return anyway—carrying starlight in our bones and stories that can awaken.\n\nPSYCHLES: From midnight on, the sun begins to return. After the new moon, nights brighten with waxing light. After the Winter Solstice, the days begin to lengthen, the world begins to warm, snow thaws and life takes start. The sleeper ascends from the depths of their dreams and mothers go into labor with gestated children. In the journey of resurrection, this is when the soul begins to ascend towards rebirth.\n\nFORMS: Campbell begins with an emphasis on the tendency of the hero to refuse the return. Following the great loss and great boon of the Nadir, does the character on quest really want to head back towards the world from which they departed? If and when the answer is yes, we begin the Magic Flight—the escape—and as Campbell says, you can’t be a hero unless you return to deliver what you have discovered. For Jung, this is when, after having found a new understanding of Self and union of opposites, we confront the demons of regression. We confront the challenge of annihilating all the old ways of seeing that we now see through—that are going to test us. For Nietzsche, this is after the Dragon has been confronted, but we have not created the new world yet, we have not transformed into a baby. We are on the way, riding back in the whale’s belly. The refusal of the return must eventually be overcome, and we will return, which is the emphasis of Gannep at this stage of the initiatory way.\n\nSCRIPTS: This is the first part of Act 3, what Aristotle and McKee would call, The End, or what Field would call, the Resolution. This third act will take us from the nadir through to the final climax and resolution. This first part of Act 3 is when, as Snyder describes, we gather the team to storm the castle. For Vogler, this is the Road back, and it is filled with consequences. This is a journey of return towards delivery execution and the arrival of the newly transformed self.\n\nMYTHS: This is when Persephone, Inanna, Hercules and Osiris are returning from the underworld. It’s not when they arrive home, it’s when they’re on the way. For Odysseus, this is a majority of his journey—the return home, but in the Odyssey itself, this is the stage of the journey that begins when he leaves the place of his storytelling to finally make way for his point of origin. Christ, at this point, is Harrowing Hell. He’s grasped the hands of the first couple and has begun guiding them out. Orpheus, too, is guiding his wife from the underworld. For the Buddha, this is when he’s returning, Enlightened, to teach. He is on his way to deliver what he’s found to the world. Inanna, at this point, has gone into labor, working to deliver her child. The barque of Osiris, dragged by Khepri, the Solar Scarab, is making its way home. The whale, too, is returning to the surface.",
  "drawing": "ATLAS: This is the blooming after winter. The child after labor. The sound after silence. We arrive not back, but forward—into the moment that was always waiting. The mountain is in us now. The blade, the bell, the garden. Arrival is not perfection. It is presence. Not closure, but continuity. The story doesn’t end here—it begins again, in the dirt, in the reader, in the world that now reflects what was found. This is the first step, again.\n\nPSYCHLES: Sun rises, delivering light to bring a new day, and, with that light, visible safety and order. This is when the moon finally becomes a glass half full after spending three quarters of its time half empty or waning. This begins the quarter of the month when the moon waxes—from half full to fully illuminated. Compared with the solar year, this is spring equinox, when, for the first time in three quarters of the year, the days are longer than the nights and lengthening. Mapped onto the human experiences of wake, procreation and life cycles, we recognize the conflation of sunrise with awakening and birth—of ourselves, offspring, and the next generation.\n\nFORMS: Campbell describes this as the Return threshold. It is the threshold of consciousness as well as the threshold between wake and sleep. To cross this threshold is to be resurrected, which, for Jung, is an expression of Individuation—a reassembly of ego upon the completion of a journey meant to break, expand and actuate who we can be. For Gannep, this is the completion of those rites that return us to home. Once we have transformed in the liminal space of our adventure, we must meet the world we left as the new person we have become, and when we do, it will have to change to receive us, but not without tests. This, for Nietzsche, is when we become the ubermench, superman, which is represented by the final stage of his allegory. This is when the inner lion, following its defeat of our inner tyrant, becomes a child; and in this form, it opens new eyes—new eyes to see a new way, a way not bound by yesterday, a way into which our youth will grow. At the same time, it may be important for such transfiguration to be recognized, as Propp would say, by community.\n\nIn the context of Fraser’s understanding of wasteland and redemption myths, rituals and holidays, this is when vitality is restored to the world by an ascending leader-spirit, replacing what had become a vitality draining tyrant. As Campbell describes, this tyrant of the status quo tends to put up a resistance at the precipice. To succeed at this return threshold, what Propp calls, Arrival, a solution must be delivered. This solution may be symbolized as an elixir, grail, fire or weapon. What is arriving is new life.\n\nSCRIPTS: Vogler continues the understanding developed by Jung and Campbell of this return threshold as the point of resurrection at which the character arc is completed. The completion of this character arc becomes the key that enables the completion of the world’s arc, macro narrative or plot. Script experts like Field, Marks and McKee refer to the familiar concept of the climax, and though there may have been act 1 and act 2 climaxes, this act 3 climax should be the climax of the larger story and the arcs of key characters. For Dara Marks, this is a moment of transformation. What Harmon recognizes as a “return to the familiar having changed” is recognized by Snyder, as a High Tower Surprise. This high tower is at the threshold. This is the summit over which our sun will rise, climactically, resolving core problems of the world and its character.\n\nMYTHS: The completion of Osiris’ journey through the Duat occurs with a mountain sunrise. The resurrection of Osiris occurs at sunrise, like the birth of his son, Horus. Similarly, we celebrate the resurrection of Jesus as he empties his cave and sepulcher with Easter Sunrise ceremonies. These occur just after the equinox. Before Christian Easter, we celebrated Oestara, goddess of spring and sunrise, at this time. The story of the goddess’ return from the underworld at spring is recalled in the return of Persephone from Hades, at which point the wasteland of winter gives way to new life. Oestara, Astarte, Ishtar—these goddesses express the return, renewal and birth of life. Like Aphrodite, are the goddesses associated with Venus, which travels alongside the sun. This is why we see her in the Solar barque with Osiris.\n\nSecretly, in some stories, and openly in others, the goddess gives birth upon the return’s completion—this is seen in the narratives of Persephone and Isis. Perhaps no greater contour of the monomyth has been illuminated than the association of return from the underworld with birth, with spring, with sunrise and with the goddess. We worship her on Friday, the day of Frigga, who the Romans saw as Venus, as Aphrodite, as Isis. What the story of Orpheus tells us, however, is that the wife cannot come back. In the symbolism of the Orphics, the wife is body and the music of Orpheus is that consciousness that brings all to dance—even in Hades. Osiris does not walk among the living after his resurrection is completed, and, in some gospels, critically, neither does Christ. In others, for the gnostics, for example, what walks again is only spirit, only image. Like a hologram with no body, what is resurrected is not mater, not the mother, not the vessel, not the wife. What comes back, most importantly, is the light itself.\n\nThe elixir that’s delivered represents understanding and insight, as represented by the return of the Buddha to his home, where he is able to resolve war and bring peace with understanding he has achieved. Enlightenment is what saves the day. The next level of understanding is what brings the next level of existence, which moves beyond the day behind us, which was doomed. In Plato’s Allegory, we see the returning philosopher meet violent resistance from those cave dwellers who do not care for truth beyond their bubble to come to light.",
  "new-age": ""
}
