[
  {
    "id": "delphi",
    "name": "Oracle of Delphi",
    "lat": 38.4824,
    "lng": 22.5010,
    "category": "sacred-site",
    "description": "Ancient Greek sanctuary sacred to Apollo, home of the Pythia oracle who spoke prophecy from volcanic fumes at the navel of the world.",
    "region": "Greece"
  },
  {
    "id": "giza",
    "name": "Great Pyramid of Giza",
    "lat": 29.9792,
    "lng": 31.1342,
    "category": "sacred-site",
    "description": "Tomb of Pharaoh Khufu, last surviving Wonder of the Ancient World. Gateway between the living and the dead in Egyptian cosmology.",
    "region": "Egypt"
  },
  {
    "id": "uluru",
    "name": "Uluru (Ayers Rock)",
    "lat": -25.3444,
    "lng": 131.0369,
    "category": "sacred-site",
    "description": "Sacred sandstone monolith central to Anangu Dreamtime. Songlines converge here, marking it as a place of ancestral creation.",
    "region": "Australia"
  },
  {
    "id": "varanasi",
    "name": "Varanasi (Kashi)",
    "lat": 25.3176,
    "lng": 83.0064,
    "category": "sacred-site",
    "description": "City of Light on the Ganges, one of the oldest continuously inhabited cities. Sacred to Shiva, where cremation grants liberation from the cycle of rebirth.",
    "region": "India"
  },
  {
    "id": "eleusis",
    "name": "Eleusis",
    "lat": 38.0413,
    "lng": 23.5413,
    "category": "sacred-site",
    "description": "Site of the Eleusinian Mysteries, the most famous secret rites of ancient Greece. Initiates experienced the myth of Persephone's descent and return.",
    "region": "Greece"
  },
  {
    "id": "mt-olympus",
    "name": "Mount Olympus",
    "lat": 40.0859,
    "lng": 22.3583,
    "category": "mythic-location",
    "description": "Highest mountain in Greece, mythological home of the twelve Olympian gods ruled by Zeus.",
    "region": "Greece"
  },
  {
    "id": "mt-sinai",
    "name": "Mount Sinai",
    "lat": 28.5394,
    "lng": 33.9753,
    "category": "sacred-site",
    "description": "Mountain where Moses received the Ten Commandments from God. Sacred axis mundi connecting heaven and earth in Abrahamic tradition.",
    "region": "Egypt"
  },
  {
    "id": "newgrange",
    "name": "Newgrange",
    "lat": 53.6947,
    "lng": -6.4755,
    "category": "sacred-site",
    "description": "Neolithic passage tomb older than Stonehenge and the pyramids. At winter solstice, sunlight penetrates the passage to illuminate the inner chamber.",
    "region": "Ireland"
  },
  {
    "id": "troy",
    "name": "Troy (Hisarlik)",
    "lat": 39.9575,
    "lng": 26.2389,
    "category": "mythic-location",
    "description": "Archaeological site of ancient Troy, setting of Homer's Iliad. Where Achilles, Hector, and the Trojan Horse shaped Western storytelling.",
    "region": "Turkey"
  },
  {
    "id": "teotihuacan",
    "name": "Teotihuacan",
    "lat": 19.6925,
    "lng": -98.8438,
    "category": "sacred-site",
    "description": "City of the Gods in central Mexico. The Pyramid of the Sun and Moon aligned with cosmic forces, where the fifth sun was born through divine sacrifice.",
    "region": "Mexico"
  },
  {
    "id": "mt-kailash",
    "name": "Mount Kailash",
    "lat": 31.0672,
    "lng": 81.3119,
    "category": "sacred-site",
    "description": "Unclimbed peak sacred to four religions — Hinduism, Buddhism, Jainism, and Bon. Abode of Shiva and cosmic axis of the world.",
    "region": "Tibet"
  },
  {
    "id": "avalon",
    "name": "Glastonbury Tor (Avalon)",
    "lat": 51.1442,
    "lng": -2.6987,
    "category": "literary-location",
    "tradition": "European",
    "description": "Hill identified with the legendary Isle of Avalon, where King Arthur was taken after his final battle. The Tor rises from the Somerset levels like an otherworldly island.",
    "region": "England",
    "readUrl": "https://sacred-texts.com/neu/arthur/index.htm",
    "wikisourcePage": "Le_Morte_d'Arthur",
    "excerpt": "And when they were at the water side, even fast by the bank hoved a little barge with many fair ladies in it, and among them all was a queen, and all they had black hoods, and all they wept and shrieked when they saw King Arthur.\n\n\"Now put me into the barge,\" said the king. And so he did softly; and there received him three queens with great mourning; and so they set them down, and in one of their laps King Arthur laid his head.\n\nAnd then that queen said: \"Ah, dear brother, why have ye tarried so long from me? Alas, this wound on your head hath caught over-much cold.\" And so then they rowed from the land, and Sir Bedivere beheld all those ladies go from him. Then Sir Bedivere cried: \"Ah my lord Arthur, what shall become of me, now ye go from me and leave me here alone among mine enemies?\"\n\n\"Comfort thyself,\" said the king, \"and do as well as thou mayest, for in me is no trust for to trust in; for I will into the vale of Avilion to heal me of my grievous wound: and if thou hear never more of me, pray for my soul.\"\n\n— Sir Thomas Malory, Le Morte d'Arthur, Book XXI"
  },
  {
    "id": "ithaca",
    "name": "Ithaca",
    "lat": 38.3659,
    "lng": 20.7181,
    "category": "literary-location",
    "tradition": "Greek",
    "description": "Homeland of Odysseus in Homer's Odyssey. The island he spent ten years trying to reach after the fall of Troy — symbol of the longing for return.",
    "region": "Greece",
    "readUrl": "https://sacred-texts.com/cla/homer/ody/index.htm",
    "wikisourcePage": "The_Odyssey_(Butler)",
    "excerpt": "Tell me, O Muse, of that ingenious hero who travelled far and wide after he had sacked the famous town of Troy. Many cities did he visit, and many were the nations with whose manners and customs he was acquainted; moreover he suffered much by sea while trying to save his own life and bring his men safely home; but do what he might he could not save his men, for they perished through their own sheer folly in eating the cattle of the Sun-god Hyperion; so the god prevented them from ever reaching home. Tell me, too, about all these things, O daughter of Jove, from whatsoever source you may know them.\n\nSo now all who had escaped death in battle or by shipwreck had got safely home except Ulysses, and he, though he was longing to return to his wife and country, was detained by the goddess Calypso, who had got him into a large cave and wanted to marry him.\n\n— Homer, The Odyssey, Book I (trans. Samuel Butler)"
  },
  {
    "id": "angkor-wat",
    "name": "Angkor Wat",
    "lat": 13.4125,
    "lng": 103.8670,
    "category": "sacred-site",
    "description": "Largest religious monument in the world, originally Hindu, later Buddhist. A stone mandala representing Mount Meru, cosmic center of the universe.",
    "region": "Cambodia"
  },
  {
    "id": "delphi-sibyl",
    "name": "Cumae (Sibyl's Cave)",
    "lat": 40.8487,
    "lng": 14.0539,
    "category": "literary-location",
    "tradition": "Roman",
    "description": "Entrance to the Underworld in Virgil's Aeneid. The Cumaean Sibyl guided Aeneas into Hades to meet his father's shade and learn Rome's destiny.",
    "region": "Italy",
    "readUrl": "https://sacred-texts.com/cla/virgil/aen/index.htm",
    "wikisourcePage": "The_Works_of_Virgil_(Dryden)/Aeneid",
    "excerpt": "There was a deep cave hewn from the flank of Cumae's rock, vast and gaping wide, guarded by the dark lake and the gloom of forests. No birds could wing their way safely overhead, so foul the breath that poured from those black jaws up to the vault of heaven.\n\nThe Sibyl cried: \"Now is the time to ask your destinies! The god! Behold, the god!\" And as she spoke before the doors, her face, her color changed; her hair streamed wild; her breast heaved and her heart swelled with frenzy; she seemed taller, her voice no longer mortal, for the god breathed upon her, ever nearer.\n\n\"Trojan Aeneas, the descent to Avernus is easy. Night and day the door of dark Dis stands open. But to retrace your steps and escape to the upper air — that is the task, that is the labor.\"\n\n— Virgil, The Aeneid, Book VI (trans. John Dryden)"
  },
  {
    "id": "stonehenge",
    "name": "Stonehenge",
    "lat": 51.1789,
    "lng": -1.8262,
    "category": "sacred-site",
    "description": "Prehistoric stone circle aligned to the solstices. Geoffrey of Monmouth attributed its creation to Merlin's magic, transported from Ireland by giants.",
    "region": "England"
  },
  {
    "id": "mt-fuji",
    "name": "Mount Fuji",
    "lat": 35.3606,
    "lng": 138.7274,
    "category": "sacred-site",
    "description": "Sacred volcanic peak in Shinto tradition, dwelling place of the goddess Konohanasakuya-hime. Symbol of immortality and transcendence in Japanese culture.",
    "region": "Japan"
  },
  {
    "id": "chaco-canyon",
    "name": "Chaco Canyon",
    "lat": 36.0604,
    "lng": -107.9614,
    "category": "sacred-site",
    "description": "Ancient Puebloan ceremonial center aligned with solar and lunar cycles. Great kivas served as portals for emergence myths connecting underworld to sky.",
    "region": "New Mexico, USA"
  },
  {
    "id": "mt-ararat",
    "name": "Mount Ararat",
    "lat": 39.7019,
    "lng": 44.2991,
    "category": "mythic-location",
    "description": "Traditional resting place of Noah's Ark after the Great Flood. The mountain where humanity began again after divine destruction.",
    "region": "Turkey"
  },
  {
    "id": "lascaux",
    "name": "Lascaux Cave",
    "lat": 45.0544,
    "lng": 1.1686,
    "category": "sacred-site",
    "description": "Paleolithic cave with 17,000-year-old paintings of bulls, horses, and deer. Possibly the earliest known mythic-ritual space, a cathedral of the Ice Age imagination.",
    "region": "France"
  },
  {
    "id": "caral-supe",
    "name": "Caral-Supe",
    "lat": -10.8926,
    "lng": -77.5203,
    "category": "sacred-site",
    "description": "Oldest known civilization in the Americas, dating to 3000 BCE. Its monumental pyramids and sunken plazas predate the invention of pottery, built by a society that thrived on music and trade rather than warfare.",
    "region": "Peru"
  },
  {
    "id": "catalhoyuk",
    "name": "Çatalhöyük",
    "lat": 37.6661,
    "lng": 32.8281,
    "category": "sacred-site",
    "description": "Neolithic proto-city dating to 7500 BCE, one of the earliest large human settlements. Homes contained shrines with bull horns and goddess figurines — evidence of humanity's first mythic imagination taking architectural form.",
    "region": "Turkey"
  },
  {
    "id": "mt-elbrus",
    "name": "Mount Elbrus",
    "lat": 43.3499,
    "lng": 42.4453,
    "category": "mythic-location",
    "description": "Highest peak in the Caucasus, sometimes identified as the mountain where Prometheus was chained by Zeus for stealing fire and giving it to humanity.",
    "region": "Russia"
  },
  {
    "id": "pillars-of-hercules",
    "name": "Pillars of Hercules",
    "lat": 35.9838,
    "lng": -5.4955,
    "category": "mythic-location",
    "description": "The Strait of Gibraltar, marked by the Rock of Gibraltar and Jebel Musa. Hercules split a mountain during his tenth labor, creating the gateway between the known world and the Atlantic unknown. Plato placed Atlantis just beyond.",
    "region": "Gibraltar / Morocco"
  },
  {
    "id": "talmud-sura",
    "name": "Babylonian Talmud — Sura",
    "lat": 32.07,
    "lng": 44.99,
    "category": "literary-location",
    "tradition": "Abrahamic",
    "description": "Site of the great Talmudic academy founded by Rav in 219 CE. The Babylonian Talmud, the central text of Rabbinic Judaism, was compiled here and at nearby Pumbedita over centuries of scholarly debate.",
    "region": "Iraq",
    "readUrl": "https://sacred-texts.com/jud/talmud.htm",
    "excerpt": "Rabbi Simlai expounded: Six hundred and thirteen commandments were communicated to Moses — three hundred and sixty-five negative commandments, corresponding to the number of days in the solar year, and two hundred and forty-eight positive commandments, corresponding to the parts of the human body.\n\nDavid came and reduced them to eleven principles, as it is written in Psalm 15: \"Lord, who shall abide in thy tabernacle? Who shall dwell in thy holy hill? He that walketh uprightly, and worketh righteousness, and speaketh the truth in his heart.\"\n\nIsaiah came and reduced them to six. Micah came and reduced them to three: \"Do justly, love mercy, and walk humbly with thy God.\" Isaiah again reduced them to two: \"Keep judgment and do righteousness.\" Amos came and reduced them to one: \"Seek Me and live.\"\n\n— Babylonian Talmud, Makkot 23b–24a"
  },
  {
    "id": "new-testament-jerusalem",
    "name": "New Testament — Jerusalem",
    "lat": 31.7683,
    "lng": 35.2137,
    "category": "literary-location",
    "tradition": "Abrahamic",
    "description": "The city where Christ's passion, crucifixion, and resurrection took place. The Gospels and Epistles emerged from the early Christian communities rooted in this holy city.",
    "region": "Israel / Palestine",
    "readUrl": "https://sacred-texts.com/bib/kjv/index.htm",
    "wikisourcePage": "Bible_(King_James)",
    "excerpt": "In the beginning was the Word, and the Word was with God, and the Word was God. The same was in the beginning with God. All things were made by him; and without him was not any thing made that was made. In him was life; and the life was the light of men. And the light shineth in darkness; and the darkness comprehended it not.\n\nThere was a man sent from God, whose name was John. The same came for a witness, to bear witness of the Light, that all men through him might believe. He was not that Light, but was sent to bear witness of that Light. That was the true Light, which lighteth every man that cometh into the world.\n\nHe was in the world, and the world was made by him, and the world knew him not. He came unto his own, and his own received him not. But as many as received him, to them gave he power to become the sons of God, even to them that believe on his name.\n\nAnd the Word was made flesh, and dwelt among us, and we beheld his glory, the glory as of the only begotten of the Father, full of grace and truth.\n\n— Gospel of John 1:1–14 (KJV)"
  },
  {
    "id": "quran-mecca",
    "name": "Qur'an — Mecca",
    "lat": 21.4225,
    "lng": 39.8262,
    "category": "literary-location",
    "tradition": "Abrahamic",
    "description": "Birthplace of the Prophet Muhammad and site where the Qur'an was first revealed by the angel Jibril. The Ka'aba at its center is the axis mundi of Islam.",
    "region": "Saudi Arabia",
    "readUrl": "https://sacred-texts.com/isl/quran/index.htm",
    "wikisourcePage": "The_Holy_Qur'an_(Maulana_Muhammad_Ali)",
    "excerpt": "In the name of God, the Most Gracious, the Most Merciful.\n\nPraise be to God, Lord of all the worlds, the Most Gracious, the Most Merciful, Master of the Day of Judgment. It is You we worship and You we ask for help. Guide us on the straight path — the path of those upon whom You have bestowed favor, not of those who have earned anger or of those who are astray.\n\n— Al-Fatiha (The Opening), Surah 1\n\nGod is the Light of the heavens and the earth. The parable of His light is as if there were a niche and within it a lamp: the lamp enclosed in glass: the glass as it were a brilliant star, lit from a blessed tree, an olive, neither of the east nor of the west, whose oil is well-nigh luminous, though fire scarce touched it: Light upon Light! God doth guide whom He will to His Light.\n\n— Surah 24:35, The Light Verse (An-Nur)"
  },
  {
    "id": "book-of-mormon-manchester",
    "name": "Book of Mormon — Manchester, NY",
    "lat": 42.9701,
    "lng": -77.2303,
    "category": "literary-location",
    "tradition": "Abrahamic",
    "description": "Where Joseph Smith reported finding the golden plates on Hill Cumorah in 1827. The Book of Mormon was translated and first published nearby in Palmyra in 1830.",
    "region": "New York, USA",
    "readUrl": "https://sacred-texts.com/mor/bom/index.htm",
    "wikisourcePage": "Book_of_Mormon_(1981)",
    "excerpt": "I, Nephi, having been born of goodly parents, therefore I was taught somewhat in all the learning of my father; and having seen many afflictions in the course of my days, nevertheless, having been highly favored of the Lord in all my days; yea, having had a great knowledge of the goodness and the mysteries of God, therefore I make a record of my proceedings in my days.\n\nYea, I make a record in the language of my father, which consists of the learning of the Jews and the language of the Egyptians. And I know that the record which I make is true; and I make it with mine own hand; and I make it according to my knowledge.\n\n— 1 Nephi 1:1–3"
  },
  {
    "id": "rigveda-punjab",
    "name": "Rigveda — Sapta Sindhu",
    "lat": 31.5,
    "lng": 72.5,
    "category": "literary-location",
    "tradition": "Hindu",
    "description": "The Land of Seven Rivers where the oldest Vedic hymns were composed, circa 1500–1200 BCE. The Rigveda is humanity's oldest surviving religious poetry, invoking Agni, Indra, and the cosmic order.",
    "region": "Punjab",
    "readUrl": "https://sacred-texts.com/hin/rigveda/index.htm",
    "wikisourcePage": "The_Hymns_of_the_Rigveda",
    "excerpt": "I praise Agni, the chosen Priest, God, minister of sacrifice, the hotar, lavishest of wealth. Worthy is Agni to be praised by living as by ancient seers. He shall bring hitherward the Gods.\n\nThrough Agni man obtaineth wealth, yea, plenty waxing day by day, most rich in heroes, glorious.\n\nAgni, the perfect sacrifice which thou encompassest about verily goeth to the Gods. May Agni, sapient-minded Priest, truthful, most gloriously great, the God, come hither with the Gods.\n\nWhatever blessing, Agni, thou wilt grant unto thy worshipper, that, Angiras, is indeed thy truth. To thee, dispeller of the night, O Agni, day by day with prayer bringing thee reverence, we come.\n\n— Rigveda, Mandala I, Hymn 1 (trans. Ralph T.H. Griffith)"
  },
  {
    "id": "upanishads-kuru",
    "name": "Upanishads — Kuru-Panchala",
    "lat": 28.95,
    "lng": 78.15,
    "category": "literary-location",
    "tradition": "Hindu",
    "description": "The philosophical heartland where forest sages composed the Upanishads, exploring Brahman, Atman, and the nature of ultimate reality. These texts form the mystical foundation of Hindu thought.",
    "region": "Uttar Pradesh, India",
    "readUrl": "https://sacred-texts.com/hin/upan/index.htm",
    "excerpt": "From the unreal lead me to the real. From darkness lead me to light. From death lead me to immortality.\n\n— Brihadaranyaka Upanishad 1.3.28\n\nIn the beginning this was Self alone, in the shape of a person. He looking round saw nothing but his Self. He first said, \"This is I\"; therefore he became I by name.\n\nHe was afraid, and therefore anyone who is lonely is afraid. He thought, \"As there is nothing but myself, why should I fear?\" Then his fear passed away. For what should he have feared? Truly fear arises from a second only.\n\nBut he felt no delight. Therefore a man who is lonely feels no delight. He wished for a second. He was so large as man and wife together. He then made this his Self to fall in two, and thence arose husband and wife.\n\n— Brihadaranyaka Upanishad 1.4.1–3 (trans. Max Müller)"
  },
  {
    "id": "mahabharata-kurukshetra",
    "name": "Mahabharata — Kurukshetra",
    "lat": 29.9695,
    "lng": 76.8783,
    "category": "literary-location",
    "tradition": "Hindu",
    "description": "Battlefield of the great war between the Pandavas and Kauravas. The longest epic poem ever written — a cosmos of dharma, duty, and divine play spanning 100,000 verses.",
    "region": "Haryana, India",
    "readUrl": "https://sacred-texts.com/hin/maha/index.htm",
    "wikisourcePage": "The_Mahabharata",
    "excerpt": "Ugrasrava Sauti, the son of Lomaharshana, versed in the Puranas, while present in the forest of Naimisha, at the twelve-year sacrifice of Saunaka, surnamed Kulapati, approached with humility the Rishis sitting at their ease and said:\n\n\"What is there in this world, the wonder that is sung of in the tale of the Bharatas? What is narrated therein on virtue, on profit, on desire, and on salvation?\"\n\nThe Rishis answered: \"We are eager to learn the history called Bharata, the holy composition of the wonderful Vyasa. That history is called Jaya. It should be heard by every person desirous of salvation. It is equal to the Vedas; it is sacred and excellent; it is the highest of narratives. It is adorned with every form of art, of divine significance, and unrivalled in beauty.\"\n\n— Mahabharata, Adi Parva, Section I (trans. Kisari Mohan Ganguli)"
  },
  {
    "id": "ramayana-ayodhya",
    "name": "Ramayana — Ayodhya",
    "lat": 26.7922,
    "lng": 82.1998,
    "category": "literary-location",
    "tradition": "Hindu",
    "description": "Birthplace of Lord Rama and starting point of Valmiki's epic. The Ramayana traces Rama's exile, Sita's abduction, and the great war against Ravana — the archetypal journey of righteous kingship.",
    "region": "Uttar Pradesh, India",
    "readUrl": "https://sacred-texts.com/hin/rama/index.htm",
    "wikisourcePage": "The_Ramayana",
    "excerpt": "Once upon a time there was a great and prosperous city by the name of Ayodhya in the kingdom of Kosala. It lay along the banks of the river Sarayu and was vast and magnificent. The city had royal highways that were always watered and strewn with flowers.\n\nKing Dasaratha ruled it as Manu once ruled the world. It was full of warriors mighty as Indra, men of truth, with no trace of avarice or narrowness. In that great city none was unlearned, none was not generous, none was without faith.\n\nIn the line of Ikshvaku was born the godly King Dasaratha, ever devoted to sacred rites, mighty as a Patriarch. He had no son. Then with pious resolve he performed the great Horse Sacrifice, and by the grace of the gods, four sons were born to him — Rama, Bharata, Lakshmana, and Satrughna.\n\n— Valmiki, Ramayana, Bala Kanda, Cantos I–XVIII (adapted)"
  },
  {
    "id": "bhagavad-gita-kurukshetra",
    "name": "Bhagavad Gita — Kurukshetra",
    "lat": 29.98,
    "lng": 76.87,
    "category": "literary-location",
    "tradition": "Hindu",
    "description": "On the battlefield between two armies, Krishna reveals the nature of duty, self, and the divine to the warrior Arjuna. The Gita's 700 verses became the most influential text in Hindu philosophy.",
    "region": "Haryana, India",
    "readUrl": "https://sacred-texts.com/hin/gita/index.htm",
    "wikisourcePage": "Bhagavad-Gita_(Besant_4th)",
    "excerpt": "Dhritarashtra said: What did my people and the sons of Pandu do when they had gathered together on the holy plain of Kurukshetra eager for battle?\n\nSanjaya said: Arjuna, seeing all his kinsmen arrayed for battle, was overcome with deep compassion and said in grief:\n\n\"Seeing these, my kinsmen, O Krishna, arrayed, eager to fight, my limbs fail and my mouth is parched, my body quakes and my hair stands on end. My skin burns all over; I am unable to stand; my mind is reeling.\"\n\nThe Blessed Lord said: \"Thy tears are for those beyond tears; and are thy words words of wisdom? The wise grieve neither for the living nor for the dead. There was never a time when I did not exist, nor you, nor any of these kings. Nor is there any future in which we shall cease to be.\n\n\"As the soul passes in this body through childhood, youth, and old age, so also does it pass into another body. The wise are not deceived by this.\"\n\n— Bhagavad Gita, Chapters 1–2 (trans. Sir Edwin Arnold)"
  },
  {
    "id": "pali-canon-aluvihara",
    "name": "Pali Canon — Aluvihara",
    "lat": 7.5156,
    "lng": 80.6032,
    "category": "literary-location",
    "tradition": "Buddhist",
    "description": "Rock cave monastery where the Theravada Buddhist canon was first written down in the 1st century BCE, preserving the Buddha's teachings after centuries of oral transmission.",
    "region": "Sri Lanka",
    "readUrl": "https://sacred-texts.com/bud/sbe10/index.htm",
    "wikisourcePage": "Dhammapada_(Muller)",
    "excerpt": "All that we are is the result of what we have thought: it is founded on our thoughts, it is made up of our thoughts. If a man speaks or acts with an evil thought, pain follows him, as the wheel follows the foot of the ox that draws the carriage.\n\nAll that we are is the result of what we have thought: it is founded on our thoughts, it is made up of our thoughts. If a man speaks or acts with a pure thought, happiness follows him, like a shadow that never leaves him.\n\n\"He abused me, he beat me, he defeated me, he robbed me\" — in those who harbour such thoughts hatred will never cease.\n\n\"He abused me, he beat me, he defeated me, he robbed me\" — in those who do not harbour such thoughts hatred will cease.\n\nFor hatred does not cease by hatred at any time: hatred ceases by love. This is an old rule.\n\n— Dhammapada, Chapter 1: The Twin Verses (trans. F. Max Müller)"
  },
  {
    "id": "lotus-sutra-gandhara",
    "name": "Lotus Sutra — Gandhara",
    "lat": 34.2,
    "lng": 71.8,
    "category": "literary-location",
    "tradition": "Buddhist",
    "description": "Crossroads region where Mahayana Buddhism flourished and key sutras like the Lotus Sutra were composed. The text proclaims that all beings possess Buddha-nature and can attain enlightenment.",
    "region": "Northwest Pakistan",
    "readUrl": "https://sacred-texts.com/bud/lotus/index.htm",
    "excerpt": "Thus have I heard. At one time the Buddha was staying in Rajagriha, on Mount Gridhrakuta, together with a great assembly of twelve thousand monks. They were all great Arhats whose outflows had been exhausted.\n\nAt that time the World-Honored One, surrounded by the four kinds of believers, having received offerings and being respectfully revered, for the sake of the Bodhisattvas preached the Great Vehicle Sutra called Immeasurable Meanings.\n\nWhen the Buddha had finished preaching this sutra, he sat in the lotus position and entered into the concentration of Immeasurable Meanings. Heaven rained mandarava flowers and great mandarava flowers, and scattered them over the Buddha and the great assembly.\n\nThe whole Buddha world quaked in six different ways. At that time all in the assembly — monks, nuns, laymen, laywomen, gods, dragons, spirits — all gazed at the Buddha with a single mind.\n\n— Lotus Sutra, Chapter 1: Introduction (trans. Burton Watson)"
  },
  {
    "id": "tibetan-book-dead-samye",
    "name": "Tibetan Book of the Dead — Samye",
    "lat": 29.3289,
    "lng": 91.5064,
    "category": "literary-location",
    "tradition": "Buddhist",
    "description": "Tibet's first monastery, founded by Padmasambhava in the 8th century. The Bardo Thodol, attributed to him, maps the soul's journey through the intermediate states between death and rebirth.",
    "region": "Tibet",
    "readUrl": "https://sacred-texts.com/bud/tib/index.htm",
    "excerpt": "O nobly-born, listen with full attention, without being distracted: There are six states of Bardo, namely: the natural state of Bardo while in the womb; the Bardo of the dream-state; the Bardo of ecstatic equilibrium while in deep meditation; the Bardo of the moment of death; the Bardo of the experiencing of Reality; the Bardo of seeking rebirth.\n\nO nobly-born, that which is called death hath now come. Thou art departing from this world, but thou art not the only one; death cometh to all. Do not cling to this life. Even though thou clingeth, thou hast not the power to remain here.\n\nRemember the clear light, the pure clear white light from which everything in the universe comes, to which everything in the universe returns; the original nature of your own mind. The natural state of the universe unmanifest. Let go into the clear light, trust it, merge with it. It is your own true nature, it is home.\n\n— Bardo Thodol (trans. W.Y. Evans-Wentz)"
  },
  {
    "id": "tao-te-ching-hangu",
    "name": "Tao Te Ching — Hangu Pass",
    "lat": 34.52,
    "lng": 110.30,
    "category": "literary-location",
    "tradition": "East Asian",
    "description": "Legend holds that Laozi, departing civilization on a water buffalo, was stopped at this mountain pass by a gatekeeper and asked to write down his wisdom. The result was the 5,000 characters of the Tao Te Ching.",
    "region": "Henan, China",
    "readUrl": "https://sacred-texts.com/tao/taote.htm",
    "wikisourcePage": "Tâo_Teh_King",
    "excerpt": "The Tao that can be told is not the eternal Tao. The name that can be named is not the eternal name. The nameless is the beginning of heaven and earth. The named is the mother of ten thousand things.\n\nEver desireless, one can see the mystery. Ever desiring, one can see the manifestations. These two spring from the same source but differ in name; this appears as darkness. Darkness within darkness. The gate to all mystery.\n\n— Chapter 1\n\nUnder heaven all can see beauty as beauty only because there is ugliness. All can know good as good only because there is evil.\n\nTherefore having and not having arise together. Difficult and easy complement each other. Long and short contrast each other. High and low rest upon each other. Voice and sound harmonize each other. Front and back follow one another.\n\n— Tao Te Ching, Chapters 1–2 (trans. Gia-fu Feng & Jane English)"
  },
  {
    "id": "analects-qufu",
    "name": "Analects — Qufu",
    "lat": 35.5969,
    "lng": 116.9913,
    "category": "literary-location",
    "tradition": "East Asian",
    "description": "Birthplace and home of Confucius, where his disciples collected his sayings into the Analects. The Temple and Cemetery of Confucius here have been sites of pilgrimage for over two millennia.",
    "region": "Shandong, China",
    "readUrl": "https://sacred-texts.com/cfu/conf1.htm",
    "wikisourcePage": "The_Analects",
    "excerpt": "The Master said, \"Is it not pleasant to learn with a constant perseverance and application? Is it not delightful to have friends coming from distant quarters? Is he not a man of complete virtue, who feels no discomposure though men may take no note of him?\"\n\nThe philosopher Yu said, \"They are few who, being filial and fraternal, are fond of offending against their superiors. There have been none, who, not liking to offend against their superiors, have been fond of stirring up confusion.\"\n\nThe Master said, \"Fine words and an insinuating appearance are seldom associated with true virtue.\"\n\nThe philosopher Tsang said, \"I daily examine myself on three points: — whether, in transacting business for others, I may have been not faithful; — whether, in intercourse with friends, I may have been not sincere; — whether I may have not mastered and practiced the instructions of my teacher.\"\n\n— Analerta, Book I (trans. James Legge)"
  },
  {
    "id": "kojiki-nara",
    "name": "Kojiki — Nara",
    "lat": 34.6851,
    "lng": 135.8048,
    "category": "literary-location",
    "tradition": "East Asian",
    "description": "Japan's oldest chronicle, compiled in 712 CE at the imperial court. It records the creation of the islands by Izanagi and Izanami, the sun goddess Amaterasu, and the divine ancestry of the emperors.",
    "region": "Japan",
    "readUrl": "https://sacred-texts.com/shi/kj/index.htm",
    "wikisourcePage": "Kojiki_(Chamberlain,_1882)",
    "excerpt": "The names of the Deities that were born in the Plain of High Heaven when the Heaven and Earth began were the Deity Master-of-the-August-Center-of-Heaven, next the High-August-Producing-Wondrous Deity, next the Divine-Producing-Wondrous Deity. These three Deities were all Deities born alone, and hid their persons.\n\nThe names of the Deities that were born next from a thing that sprouted up like unto a reed-shoot when the earth, young and like unto floating oil, drifted about medusa-like, were the Pleasant-Reed-Shoot-Prince-Elder Deity, next the Heavenly-Eternally-Standing Deity. These two Deities were likewise born alone, and hid their persons.\n\nThe above five Deities are separate Heavenly Deities.\n\nHereupon all the Heavenly Deities commanded the two Deities His Augustness Izanagi and Her Augustness Izanami, ordering them to \"make, consolidate, and give birth to this drifting land.\" Granting to them a heavenly jewelled spear, they charged them thus.\n\n— Kojiki, Section I–IV (trans. Basil Hall Chamberlain)"
  },
  {
    "id": "avesta-bactria",
    "name": "Avesta — Bactria",
    "lat": 36.75,
    "lng": 66.90,
    "category": "literary-location",
    "tradition": "Iranian",
    "description": "Region where Zoroaster is believed to have composed the Gathas, the oldest hymns of the Avesta. His vision of cosmic struggle between Ahura Mazda and Angra Mainyu shaped all subsequent dualistic theology.",
    "region": "Northern Afghanistan",
    "readUrl": "https://sacred-texts.com/zor/sbe31/index.htm",
    "wikisourcePage": "Sacred_Books_of_the_East/Volume_4",
    "excerpt": "This I ask Thee, tell me truly, Ahura. Who is by generation the Father of Right, at the first? Who determined the path of sun and stars? Who is it by whom the moon waxes and wanes again? This, O Mazda, and yet more, I am fain to know.\n\nThis I ask Thee, tell me truly, Ahura. Who upheld the earth beneath and the firmament from falling? Who the waters and the plants? Who yoked swiftness to winds and clouds? Who is, O Mazda, creator of Good Thought?\n\nThis I ask Thee, tell me truly, Ahura. What artist made light and darkness? What artist made sleep and waking? Who made morning, noon, and night, that call the understanding man to his duty?\n\n— Gathas, Yasna 44 (trans. L.H. Mills)"
  },
  {
    "id": "gilgamesh-uruk",
    "name": "Epic of Gilgamesh — Uruk",
    "lat": 31.3225,
    "lng": 45.6375,
    "category": "literary-location",
    "tradition": "Ancient Near East",
    "description": "The world's oldest epic poem, carved in cuneiform on clay tablets. Gilgamesh, king of Uruk, seeks immortality after the death of his friend Enkidu — the first written reckoning with mortality.",
    "region": "Iraq",
    "readUrl": "https://sacred-texts.com/ane/gilgamesh/index.htm",
    "wikisourcePage": "The_Epic_of_Gilgamish",
    "excerpt": "He who has seen everything, I will make known to the lands. I will teach about him who experienced all things alike. Anu granted him the totality of knowledge of all. He saw the Secret, discovered the Hidden, he brought information of the time before the Flood.\n\nHe went on a distant journey, pushing himself to exhaustion, but then was brought to peace. He carved on a stone stela all of his toils, and built the wall of Uruk-Haven, the wall of the sacred Eanna Temple, the holy sanctuary.\n\nLook at its wall which gleams like copper, inspect its inner wall, the likes of which no one can equal! Take hold of the threshold stone — it dates from ancient times! Go close to the Eanna Temple, the residence of Ishtar, such as no later king or man ever equalled!\n\nGo up on the wall of Uruk and walk around, examine its foundation, inspect its brickwork thoroughly. Is not its masonry of baked brick? Did not the Seven Sages themselves lay out its plans?\n\n— Epic of Gilgamesh, Tablet I (trans. Maureen Gallery Kovacs)"
  },
  {
    "id": "enuma-elish-babylon",
    "name": "Enuma Elish — Babylon",
    "lat": 32.5363,
    "lng": 44.4209,
    "category": "literary-location",
    "tradition": "Ancient Near East",
    "description": "Babylonian creation epic recited at the New Year festival. Marduk slays the primordial sea-dragon Tiamat and fashions the cosmos from her body — the original myth of order emerging from chaos.",
    "region": "Iraq",
    "readUrl": "https://sacred-texts.com/ane/enuma.htm",
    "excerpt": "When on high the heaven had not been named, firm ground below had not been called by name, naught but primordial Apsu, their begetter, and Mummu-Tiamat, she who bore them all, their waters commingling as a single body; no reed hut had been matted, no marsh land had appeared.\n\nWhen no gods whatever had been brought into being, uncalled by name, their destinies undetermined — then it was that the gods were formed within them.\n\nLahmu and Lahamu were brought forth, by name they were called. Before they had grown in age and stature, Anshar and Kishar were formed, surpassing the others. They prolonged the days, added on the years. Anu was their heir, of his fathers the rival; yea, Anshar's firstborn, Anu, was his equal.\n\n— Enuma Elish, Tablet I (trans. E.A. Speiser)"
  },
  {
    "id": "popol-vuh-chichicastenango",
    "name": "Popol Vuh — Chichicastenango",
    "lat": 14.9433,
    "lng": -91.1117,
    "category": "literary-location",
    "tradition": "Mesoamerican",
    "description": "The K'iche' Maya creation epic was preserved here by Francisco Ximénez in the early 18th century. It tells of the Hero Twins' descent to Xibalba and the creation of humanity from maize.",
    "region": "Guatemala",
    "readUrl": "https://sacred-texts.com/nam/pvuheng.htm",
    "excerpt": "This is the beginning of the Ancient Word, here in this place called Quiché. Here we shall inscribe, we shall implant the Ancient Word, the potential and source for everything done in the citadel of Quiché, in the nation of Quiché people.\n\nThis is the account, here it is: Now it still ripples, now it still murmurs, ripples, it still sighs, still hums, and it is empty under the sky. Here follow the first words, the first eloquence:\n\nThere is not yet one person, one animal, bird, fish, crab, tree, rock, hollow, canyon, meadow, forest. Only the sky alone is there; the face of the earth is not clear. Only the sea alone is pooled under all the sky; there is nothing whatever gathered together. It is at rest; not a single thing stirs. It is held back, kept at rest under the sky.\n\nWhatever there is that might be is simply not there: only the pooled water, only the calm sea, only it alone is pooled. Whatever might be is simply not there: only murmurs, ripples, in the dark, in the night.\n\n— Popol Vuh, Part One (trans. Dennis Tedlock)"
  },
  {
    "id": "guru-granth-sahib-amritsar",
    "name": "Guru Granth Sahib — Amritsar",
    "lat": 31.6200,
    "lng": 74.8765,
    "category": "literary-location",
    "tradition": "Sikh",
    "description": "The Golden Temple houses the Guru Granth Sahib, the living guru of Sikhism. Compiled by Guru Arjan in 1604, it contains hymns from Sikh gurus, Hindu saints, and Sufi poets — a scripture of radical inclusion.",
    "region": "Punjab, India",
    "readUrl": "https://sacred-texts.com/skh/granth/index.htm",
    "wikisourcePage": "The_Sikh_Religion",
    "excerpt": "There is One God. His Name is Truth. He is the Creator. He is without fear. He is without hate. He is timeless and without form. He is beyond death — the enlightened, self-existent.\n\nBy the Guru's grace He is known.\n\nHe was True in the beginning. He was True when the ages commenced. He is True now. And Nanak says He shall be True forever.\n\nBy thinking, He cannot be reduced to thought, even by thinking hundreds of thousands of times. By remaining silent, inner silence is not obtained, even by remaining lovingly absorbed deep within. The hunger of the hungry is not appeased, even by piling up loads of worldly goods. Hundreds of thousands of clever tricks, but not even one of them will go along with you in the end.\n\nSo how can you become truthful? And how can the veil of illusion be torn away? O Nanak, it is written that you shall obey the Hukam of His Command, and walk in the Way of His Will.\n\n— Japji Sahib, Mul Mantar and Pauri 1 (Guru Nanak)"
  },
  {
    "id": "agamas-pataliputra",
    "name": "Jain Agamas — Pataliputra",
    "lat": 25.6093,
    "lng": 85.1376,
    "category": "literary-location",
    "tradition": "Jain",
    "description": "At the Council of Pataliputra in the 3rd century BCE, Jain monks codified the teachings of Mahavira into the Agamas. These texts articulate the radical ethics of non-violence and the liberation of the soul.",
    "region": "Patna, India",
    "readUrl": "https://sacred-texts.com/jai/index.htm",
    "excerpt": "All breathing, existing, living, sentient creatures should not be slain, nor treated with violence, nor abused, nor tormented, nor driven away. This is the pure, unchangeable, eternal law which the clever ones, who understand the world, have proclaimed.\n\nA wise man should not act sinfully toward animals, nor cause others to act so, nor allow others to act so. Knowing the course of the world, having learned and thoroughly understood the misery of the world, he should cease from all sinful action.\n\nHe who has overcome all attachment and hatred, who is free from all sins, who knows and sees all things — he is the Liberated One. He who is free from anger, pride, deceit, and greed, whose senses are controlled, who is free from worldly desires, and who has realized the Self — such a one is a sage.\n\n— Acharanga Sutra, Book I (adapted from Hermann Jacobi translation)"
  }
]
