{
  "king-arthur": {
    "sections": [
      {
        "heading": "Wish Fulfillment, Healing and Spiritual Training",
        "text": "Freud thought dreams were wish fulfillment fantasies, Jung saw them as healing to imbalanced psyches, and Joseph Campbell saw myths as spiritual training. The Arthurian romances are so successful because on one level they're wish fulfillment, on another they are healing to an imbalanced collective psyche that devalued the feminine, and on another level, they offer tremendous spiritual training. What a good storyteller knows is that the fantasy is exactly what seduces us into a plot that brings change. It is exactly the wish fulfillments that are, on the surface, the most seductive. Then, once we are pulled into the dream, we can be worked, transformed and changed by the efforts of a storyteller.\n\nStories that are true are successful. We're drawn to stories that resonate. We don't always know what they're resonating with, and the truth they represent might not be literal or moral. In the case of Arthur, it resonates with its audience on countless levels. True romantic fantasies and true romantic nightmares, resonant visions of both moral righteousness and moral failure."
      },
      {
        "heading": "Europe's Cauldron of Stories",
        "text": "Common myths support common identities, and part of why the Arthurian material spread across Europe is because it resonated with so many Europeans. Its ability to do so came from its ability to reflect so much myth and history -- Classical, Christian, Celtic and Caucasian myths, memories, magic and crusades. With a French Lancelot and a German Parzival, the story created sharable narratives and identities. If King Arthur is the best known Brit in the world, it's because he's the most mixed Brit there's ever been.\n\nThe Mayan throne was a mat on which the culture's myth was woven, and into this myth was woven the entirety of their culture. This is a perfect metaphor for the Arthurian throne. His myth is one that weaves together the threads of Europe. We can work to pick apart its sources, but its successful resonance with so many people depends on the successful blending of so many identities. Tolkien's point about Arthur is that storytellers draw from what he called a Cauldron of Stories -- a poetic expression of the imagination. Do our dreams not mix life with legend? Myths are no different."
      },
      {
        "heading": "The Hypermasculine Quest for the Feminine",
        "text": "Jung saw dreams as snapshots of the psyche that represent both its imbalance and its internal efforts to heal. What we see in the Arthurian stories is a representation of a hypermasculine, hyperchristian reality trying to heal its rift with femininity. On one hand this looks like Guinevere's feminine disruption of a hypermasculine order, and on another, we see the Grail quest as a quest for the feminine.\n\nThe Arthurian consciousness is expressed as both repressing the feminine and in quest for it. Morgana represents the repressed feminine vitality. The wasteland of Arthurian legend represents the wasteland we get when we repress feminine vitality. The story of Guinevere represents the shadow disruption of the feminine when it's repressed. And the Grail quest represents our recognition that the splitting off and repression of feminine consciousness has created a wasteland that can only be redeemed by integrating what we've split off. The story of Camelot is the story of Eden recast as a narrative with which Europeans can identify. On another level, it's the story of anyone whose household has been destroyed by infidelity."
      },
      {
        "heading": "Arthur, Hercules and the Journey of the Sun",
        "text": "Arthur looks a lot like Hercules. In the folklore, his shield can become a boat, which reminds us of the cupboat Hercules takes to the Hesperides, an island of golden apples. Arthur also goes to an island of golden apples. And though both narratives associate the cup and a woman with life everlasting, the most obvious similarity of these culture-defining heroes is their origin story. Both were conceived by a father who pretended to be their mother's husband.\n\nWe follow Arthur from his birth to his rise, his fall, and all the way to his death and removal to Avalon, the island of golden apples. This is an ending at the sunset, a journey of the sun, just like the riddle of the Sphinx in the story of Oedipus. Arthur's rise and arrival is like the birth and arrival of the sun, and his rise to prominence is like the sun's rise to noon. The journey of the king and the journey of the sun are deeply associated with one another. They were in medieval Europe, and they were also associated with Christ, Horus, Osiris and so many other figures."
      },
      {
        "heading": "The Printing Press and the Power of New Media",
        "text": "King Arthur represents the consolidation of European and pagan mythologies, and the Morte d'Arthur represents the consolidation of all those Arthurian pieces. This happened at the exact same time the printing press came online, creating a gargantuan phenomenon. Not only did it resonate with the entirety of Europe in deep and profound ways, it was also distributable. Malory's Morte d'Arthur was one of the first major texts to be published with the printing press. Every time there's a new medium, every time there's a new level of distribution, there is a new level of phenomenon.\n\nFrom Nennius to the World Wars, Arthur's defense of England tends to be renewed every time it needs defenders. These stories don't just model ideals of the state and its status quo, they also point to a path of individual development from and beyond the state. While Arthur redefines the standard of governance as motivated by fairness and equality, the quest for the Grail is spiritual, mystical, philosophical and profound. There's a reason why Wagner's Parsifal was an adaptation of his earlier interpretation of Siddhartha's quest for enlightenment."
      }
    ],
    "overview": "The Arthurian romances are the most successful state myth of the most recent global empire — and also one of history's most profound examples of spiritual training embedded in wish fulfillment. Beneath the fantasy of an ideal kingdom lies a hypermasculine, hyperchristian psyche in quest for the feminine it has split off. The story resonates because it weaves together the threads of an entire continent — Classical, Celtic, Christian and Caucasian — and because its underlying pattern, the journey of the sun, is older than any single culture it absorbed."
  },
  "bermuda-triangle": {
    "sections": [
      {
        "heading": "A Repository for the Unproven",
        "text": "The Bermuda Triangle is alive today as an active part of our collective imagination. Based on the role it plays, it has become a repository for virtually every unproven but not disproven possibility -- from aliens to mystical energy and sea monsters, rare natural phenomena, you name it. The Bermuda Triangle isn't just a repository for all kinds of myths and phenomena, it's also one of the key places they all converge. Atlantis, underwater archaeology, psychic powers, UFOs, military mysteries -- all of these threads become fabric in the mythic triangle.\n\nThe oldest kings were of fishing ports, and wild stories about the sea are as old as boats. You might say there's always been a Bermuda Triangle -- a place over there beyond the known and observed, where all the craziest stuff you ever heard of happens. From Greek mythological sea monsters to mysterious phenomenon in the Bermuda Triangle, this is just an updated incarnation of the same old story."
      },
      {
        "heading": "Rogue Waves and Convergent Myths",
        "text": "One of the theories of what goes on in the Bermuda Triangle involves rogue waves, which, while literally compelling, make even better metaphors. The Bermuda Triangle is where all the little disturbances in our imagination add up to something huge. Some of these disturbances may be statistical, some psychological projections, some weird but natural, and under this cover, who knows, maybe there's some stuff we won't understand without expanding our worldviews.\n\nThe term rogue wave is a misnomer -- they aren't the most rogue of waves, they're the most convergent. Their harmonic or constructive interference is what makes them huge. A myth is like a rogue wave born of countless small ideas that converge in the fluid medium of our imaginations. Charles Berlitz wrote at the convergence of three great myths -- Atlantis, the Bermuda Triangle and Aliens. Fact or fiction, this weaving of threads has created the fabric of what we now think of as the Bermuda Triangle."
      },
      {
        "heading": "Ancient Perils in Modern Dress",
        "text": "Skylla and Charybdis seem to be personified versions of true perils -- a tight strait, dangerous rocks and even maelstroms. The Skylla and Charybdis of the Bermuda Triangle are the Blue Hole vortexes and limestone breakers, dangerous rocks that can be invisible on calm days. As with Charybdis, locals in the Bahamas personify the ship-destroying vortices as monsters. The most famous is called Lusca, whose breath creates the maelstrom.\n\nOne of the recurring themes -- from the Bermuda Triangle to the Devil's Sea -- is that many of the ships are carrying ore. Another theme is that electric or magnetic instruments have failed or been affected. The fact that humanity's relationship with electromagnetism and radio waves is relatively new means that we are still integrating it into both our understanding and our imaginations. These stories play with both -- sometimes there are phenomena we hardly understand, and in some cases the Bermuda Triangle is serving as a place for our imagination to model possibilities."
      },
      {
        "heading": "Why We Need the Mystery",
        "text": "We don't want to believe in a world without miracles, which for most of us, conscious or not, means living in a world without soul, free will, divine presence or potentially even meaning. It's not just about the things that can happen there, it's that those are the places they seem most likely to happen, and if they can't happen there, they can't happen anywhere.\n\nThere is a lot of unknown territory in our psyche -- we need a place in the world to project our inner unknown. The Bermuda Triangle has become one of these places. The Bermuda Triangle doesn't stand out statistically as much as it stands out in our imaginations. If you want to believe everything is explainable, that's the myth you'll project onto the lost ships. If you want to believe in aliens or Atlantis, then that's the myth you'll project. So long as traumatic events continue to happen and ships keep disappearing, we're going to keep seeing all of our myths."
      }
    ],
    "overview": "The Bermuda Triangle is where all the little disturbances in our imagination converge into something huge — a modern incarnation of the ancient place beyond the known where the wildest stories happen. From Greek sea monsters to military mysteries, it functions less as a geographic anomaly than as a repository for every unproven but not disproven possibility. The myth persists not because the statistics support it, but because we need a place in the world onto which we can project our inner unknown."
  },
  "holy-grail": {
    "sections": [
      {
        "heading": "The Endless Incarnations of the Grail",
        "text": "The Grail myths aren't consistent with one another. One version is that Joseph of Arimathea hosted the last supper, caught Jesus' blood in its cup, then carried it to Glastonbury. Another version is that Peter carried it from Israel to Rome and sent it to Spain for safety. Another is that the Templars found or were given the Grail upon their arrival in Jerusalem. Meanwhile, the conflation of the Grail from Arthurian legend with the Holy Cup was a later development. Some stories say the Grail was Cathar treasure or a vessel used during pagan rites transformed for Christianity. Several scholars associate it with earlier images like the Classical cup of Hebe or Celtic Cauldron of Dagda. Then there are the arguments that it isn't a grail at all, it's a stone -- the philosopher's stone -- which turns the grail into a symbol for enlightenment.\n\nIn Inception, Nolan points out that if you put a safe in a dream, the dreamer will put what's precious in that safe. The Grail works in the same way -- whatever is most precious to us, that's what we see in the Grail. We're obsessed with the Grail because we see our obsessions in that vessel, and we find real wisdom on the quest."
      },
      {
        "heading": "The Inner Quest for the Divine",
        "text": "Crusades are pilgrimages, which are journeys to god. When the crusaders got to Jerusalem, the place where God was supposed to be, and when the Templars took over the temple, I think they didn't find him, and I think they kept looking -- under the temple and across the world. Everyone wants the Grail for different reasons, but one of them was a sincere existential need to find god, to find divine union. This is the same pursuit that drove alchemists towards the philosopher's stone. The outer journey is but a projection of the inner quest.\n\nThe deeper and wider you go, the more you come to recognize that the core common denominator is love -- love heals mind, body and soul as well as crops and even belligerence. Love is the elixir we drink, it's the gate we walk through to find union with self, with cosmos, and even with the divine. In many ways, the Grail stories are in opposition to the testosterone-colored violence and persecution of their day. Parzival climaxes when Fierfitz and Parzival stop fighting. When you stand under the stone at Roslyn where they say you can see the Grail, you've got to realize the Grail is you, and your capacity to heal, create, unify and find wisdom -- through love."
      },
      {
        "heading": "Powers of Creation and Renewal",
        "text": "The Grail is like a condensed conduit for the powers of creation. This energy comes with love and wisdom, it heals individuals and whole lands, brings life, restores sanity, delivers food, is endlessly full of wine and can unite the bearer with god. As a cornucopia, the Grail represents the endless refilling of both Earth and Mother with offspring and new life. The way wine endlessly refills the Grail can be seen in the monthly refilling of the maternal vessel with the life-giving blood of menstruation.\n\nGeoffrey of Monmouth, who wrote the first great work about Arthur, didn't write about the Grail. In the Vita Merlini, however, he wrote about apples that made knights go mad and an elixir that restored their clarity. Perhaps the greatest power of the Grail myths was the way they helped heal Crusade-induced trauma. These are stories that follow the arc of a closed heart that opens and a wasteland that's redeemed -- of warriors who stop fighting and lovers who start loving."
      },
      {
        "heading": "Pagan Roots and Christian Vessels",
        "text": "The most important ritual in Christianity is the Mass, which centers around the cup of wine providing a path to spiritual immortality -- like the Holy Grail. Whether or not there's a literal link, to our imagination, these holy vessels are resonant, mimetic and easily conflatable. One of the popular theories of the Grail is that the tradition emerges from the relationship of Christianity with more ancient mystery religions throughout the Mediterranean. These traditions typically revolve around some kind of death, resurrection and immortality deity, like Dionysus, Mithras, Attis, Adonis, Persephone, Osiris, Inanna.\n\nIn the oldest real megamyth we have, Inanna is brought back from death on a cross with bread and elixir of life contained within the lunar thumbnail. Dionysus is the god of wine, with which we toast the living. Blood, elixirs and vessels are central to many of these cults. So as Christianity displaced the pagan religion, it is believed that many of these mystery traditions came to assimilate the myth in their own ways. Could these cults have contributed to Grail legends? Most of these traditions were wiped out by crusades and inquisitions, and myths tend to get written down when things are ending. Could some of these cults have avoided complete annihilation? This is one of the places where the bottom drops out into mystery."
      },
      {
        "heading": "The Grail as Relic and Connection",
        "text": "A relic is a connection to a source -- to the Buddha, to Mohammad, to Christ -- and that connection is valuable because of their connection with the divine. The Grail is the ultimate relic. Not only is it an object that connects with someone connected with the divine, this is seen as the actual object that makes the connection. The Grail is the source of wine-blood that delivers salvation and immortality. It is the ultimate relic that offers an ultimate connection with the divine.\n\nThe very essence of the Christian religion depends on its literal truth -- that Jesus was real and the son of God. Yet it was the Muslims who had Mohammad's sword and other real relics. This is why some believe that the European interest in relics was in response to their collision with Islam. Core to the Christian tradition is the notion that something perfectly symbolic -- like Christ -- could also be very real. We have older cups that were less significant to fewer people, so if Jesus was a historical figure, which is the consensus among academics, then the literal possibility is entirely plausible."
      }
    ],
    "overview": "The Grail works like Nolan's safe in Inception — whatever is most precious to us, that is what we see in the vessel. Its endless incarnations, from Celtic cauldron to philosopher's stone to the blood of Christ, reflect not confusion but the nature of the symbol itself. The Grail is not one thing. It is a vessel, a stone, a lineage, a technology, and a question — and the question it asks is whether the seeker can hold all of these dimensions at once without reducing them to a single answer."
  },
  "el-dorado": {
    "sections": [
      {
        "heading": "The Capitalist Myth Before Capitalism",
        "text": "Encoded in this mythic predecessor of the capitalist ideal, we get an early glimpse of its shadow. In the story of El Dorado, we see the disregard of others and sacredness for the purpose of wealth. The pursuit of personal fortune, especially in the West, is a living myth. It's a capitalist myth. Before El Dorado, great quests were for truth and holy objects. The story of El Dorado, however, reduced treasure to wealth.\n\nAs Tolkien pointed out, gold gives us what he called dragon sickness, a kind of greed and belligerence that comes to disregard the wellbeing of others. Conquistadors had this sickness. The confusion of El Dorado for a person, city, and civilization is itself telling. In great stories you often see an individual that personifies the health and well-being of a land. If what's holy is money, your pilgrimage is to a wellspring of wealth. And this isn't just to degrade the quest to something secular -- from within their mindset, the pursuit of gold was existentially meaningful."
      },
      {
        "heading": "The Golden Road of the Sun",
        "text": "Heroic conquistadors journeyed across the western ocean to western lands for golden treasure, like Hercules, who crossed the western ocean for golden apples, and Coyote, who swam to the Channel Islands for a golden flower. This is a recurring motif -- the pot of gold at the end of the rainbow, only the rainbow would be better understood as the yellow brick road or the yellow arrows that point the way from anywhere in Europe to its westernmost point in Santiago. The golden road is the road of the sun, which sets in the west, where, culture after culture, imagines treasure.\n\nAll across Europe, golden arrows lead to Santiago. Follow these arrows. And when you reach what you thought was the end of your pilgrimage, follow the sun across the sea, to America, where the streets are paved in gold. Then follow these yellow brick roads until you reach the end of the rainbow. And there, where sun sets on the shoulders of Atlas, you'll find the promised land, El Dorado."
      },
      {
        "heading": "El Dorado Was a Man, Not a City",
        "text": "El Dorado was a man who covered himself from head to toe in gold -- an unforgettable sight that spread through the South American imagination, but by the time it got to the Spanish, El Dorado was a city of gold. The king is the master of all of the gold and all of that power and light and vitality from which existence comes. The health of the king is associated with the health of the land. The sun going down into the water is symbolized by the golden objects going down into the water. These are common rituals for kings -- the reason Arthur's sword must go back into the water upon his death, a motif ancient for Indo-Europeans.\n\nThe Muisca covered the new king with gold dust, crowns, bracelets and precious stones in a kind of coronation ceremony. This treasure was taken on a raft to the middle of Lake Guatavita, where the gold was thrown into the murky depths as an offering to the gods. Despite numerous attempts to fish the gold and jewels from the bottom, few clues to the treasure were found. Here is where El Dorado becomes a myth."
      },
      {
        "heading": "A Hero's Journey of Ego Death",
        "text": "The road to El Dorado is a classic hero's journey. You leave from home as a representative of your culture's status quo, depart for some great adventure crossing some great ocean to some foreign land where everything is completely different. At first you are overwhelmed, but then you learn how things work. But then you fail to find what you thought you would find, which shatters the ego. Disillusionment should set in. And having not gotten what you wanted, you should find what you really need. Or if you are the bad guy in the story, you keep wanting it anyway, at the expense of lives, love, care, and any consideration for others.\n\nUnfortunately, the hero's journey is a journey highlighted by disillusionment and ego death. In the case of the conquistadors, those who went in search for El Dorado all failed, and they all suffered that loss. Along the way, great damage was done. Whatever role the conquistador played, the completion of the journey would be their return home, to deliver whatever they found -- gold or wisdom -- as the new person they'd become. No conquistador returned from the Americas the same person who left."
      }
    ],
    "overview": "El Dorado is the capitalist myth before capitalism — the moment when great quests shifted from truth and holy objects to the pursuit of wealth itself. The golden road is the road of the sun, and the conquistadors who followed it west were walking a path as old as Hercules crossing the ocean for golden apples. But the hero's journey demands disillusionment and ego death, and every conquistador who searched for El Dorado failed, suffered that loss, and returned home a different person."
  },
  "ark-of-the-covenant": {
    "sections": [
      {
        "heading": "The Seat of God on Earth",
        "text": "Like the seat of Apollo at Delphi, the Ark is God's throne on earth -- the seat of god, like the sunboat of Osiris or the cupboat of Helios. And like these solar seats, the golden Ark is a guiding light that leads souls to life beyond their world. As the Ark leads Jews to the Holy Land, the sunboat of Osiris leads souls to a life after death. As the star led to Jesus, the Ark led to Israel. These guiding lights presented hope -- hope for change, hope for a new day. And whether it comes from Christ, Prometheus or Moses, hope is the light, brought from heaven to earth.\n\nThe Ark also looks and sounds a lot like Aker, the seat of Osiris in the innermost chamber of the Egyptian underworld -- the scene where the first divine spark comes into its vessel. This seat is flanked by two chimera and two birds, which together look like Cherubim. Like the sun rising from night, the Ark rose from Egypt and the desert to bring hope and promise a new day."
      },
      {
        "heading": "The Power of Creation and Destruction",
        "text": "The Big Bang is only the most recent myth about some point from which creation came. And for the Jews, this point was in the dead center of their temple, before the Ark -- the seat of the creator at the seat of creation. Lightning, meteors, plagues and the sun are but derivations of its true power, which is all power -- a power not meant for human wants. In the Jewish imagination, creation was from the center, for which reason the tree of Eden, the cross, and the temple were described as in this center. Over the exact center was the foundation stone of our reality, on which was written the name of God.\n\nUzzah was immediately struck dead when he touched the Ark, as though smitten by lightning for his disobedience. The Ark is like the forbidden fruit in Pandora's box. Those who disobey god -- those who look in the box or pursue its knowledge -- are punished. Until the scientific discovery of electricity, until Ben Franklin brought lightning down to earth on the string of a kite, lightning was heavenly, and its presence on earth would have been seen as either miraculous or magical."
      },
      {
        "heading": "Where Myth Meets Memory",
        "text": "The Ark is at the exact precipice between myth and memory when scholars think priests started writing down stories -- this was in response to the Babylonian invasion and exile, which compromised a living, oral tradition. The Ark is said to have been in the possession of the Jews right up until the time they started emphasizing the written tradition. It becomes myth when, according to Maccabees, it was taken to a cave in Jordan to be hidden from the invading Babylonians. Like the Grail, the Ark enters and leaves history, like a metaphor for a god who spoke to us and stopped.\n\nExile from Eden and losing the Ark are stories about separation from home and god. Though they both carry incredibly ancient material, the focus on writing them down seems to have been in response to the Temple's destruction and the Babylonian exile. Whether or not the story of the Ark is historically true, it expresses true historic experience."
      },
      {
        "heading": "A Traveling God for a Traveling People",
        "text": "Gods are associated with locations, but when you're leaving to go somewhere new, God would have to be taken with you. It's not just that the Ark serves as a seat for God, it also served as a transport. When Gilgamesh asks for the secret of eternal life, the clue is that immortality has only been attained by the one who turned his house into a boat, into an ark. And so the Ark of the Covenant is not just the seat of god on earth, it's a moving throne. It is only because the Ark can travel that, according to legend, it has survived. The same can be said of Judaism itself.\n\nWhen Semites moved to Egypt they began worshiping Egyptian gods, in part because deities were understood to be local. But when the Semites leave Egypt with Moses, their god is presented as having a home that moves -- he is a traveling god. From the nomadic tent in which it lived to the churches still shaped like upside-down arks, the Abrahamic home of God is meant to evoke this traveling quality, which seems to be integral to its dispersion and global success.\n\nWe still want what the Ark can give -- knowledge of god and a connection with the divine. The human condition established by Adam and Prometheus is one of estrangement and separation. Like Adam, we experience separation as loneliness. Our isolation is a source of existential dread. And this dread sets up a desire for union, for oneness or wholeness, and this motivation is behind our love for stories about union, which tend to be journeys to some divine source."
      }
    ],
    "overview": "The Ark sits at the exact precipice between myth and memory — the moment when priests began writing down stories in response to the Babylonian exile, preserving a living tradition that was slipping away. Like the golden sunboat of Osiris, it is a guiding light and a traveling throne for a traveling god. The Ark enters and leaves history like a metaphor for a god who spoke to us and stopped, and the desire to recover it is inseparable from the desire for divine union that defines the human condition."
  },
  "nibelung": {
    "sections": [
      {
        "heading": "The Mythologization of History",
        "text": "The Nibelung shows the mythic mixing of history with divine narratives in a way that gives a sense of how this could have been happening behind more ancient myths. Arthur gives us another great example, as a historical figure who became a magnet for mythic material. Arthur's defense of Britain, the Iliad, and Genesis concern the fall of regional powers in the context of collapsing world orders. The same can be said of the Nibelung, which is about the fall of the Burgundians, contingent with the fall of Rome. Attila, the Burgundian nemesis, was the reaper of Rome.\n\nIn the Nibelung, history, myth and metallurgy align around core patterns capable of reflecting more than just historical, mythic or metallurgical meaning. For example, the single weakness of quenched steel becomes the single weakness of a hero's personality becomes the mythic downfall of a historic culture. The pattern of the single weakness then sustains the projection of whatever flaw concerns its audience. Myth is like nuclear fusion -- it requires the combination of multiple cores to create something new."
      },
      {
        "heading": "Men of Steel",
        "text": "The strength of Siegfried's blade comes from plunging it in blood, and his single weakness is the leaf that covered him when he bathed. These details pertain to the tempering of iron, which is strengthened by dipping it in cool water but is weak where held in the process. This is clarified by a myth in the Caucasus, where the man of steel is created in the smithy and is described as steel, only vulnerable where held when dipped. In this story, it's on the surface, and it shows us what's really going on with Siegfried, Achilles and Jason.\n\nFor ages, metallurgy and religion focused on purification. The discovery of steel, however, was the discovery of the strongest, most immortal of metals that came with a bit of corruption. This is what we see in the earliest personifications of men of steel -- not only are they stronger and more invincible than anyone else, they also corrupt the laws of god. The single weakness of Achilles becomes the place on the body where he sacrilegiously injures Hektor. This small corruption of the strongest hero is a mythopoetic expression of steel itself, which is stronger as a result of its corruption -- carbon. Personified, this is the anti-hero."
      },
      {
        "heading": "Swords, Treasures and the Dragon's Gold",
        "text": "Swords are incredible symbols. The first long swords were made of iron, and the first iron was made of meteorites -- so the first sword is a meteor sword, which colors its symbol forever. In that the sword is made of a light from heaven, it's often associated with the divine right of rule. In that the sword is a death bringer made of a fallen light, the fiery sword can represent the fall. The word science comes from a root word that means to cut or divide, highlighting the notion of knowledge as discerning.\n\nSo long as there's treasure in the imagination there will be treasure in myth. As long as we treasure something, even if it's something immaterial like love, it will be symbolized as real treasure. Because we so frequently see treasure corrupt the people who pursue it, we end up with cautionary tales -- from Tolkien's notion of Dragon Sickness to the Ballad of Buster Scruggs. Insofar as wealth is power and power corrupts, wealth corrupts."
      },
      {
        "heading": "The Dream Life of a Culture",
        "text": "Freud thought dreams were driven by wish fulfillment. Jung thought they were part of psychological homeostasis, which seeks balance and wholeness. For him, dreams provide compensatory content that counterbalances daily experience. Myths and dreams draw us in with the promise of wish fulfillment and then drag us through a process of development. Joseph Campbell saw myths as spiritual training -- we get the training from the heroes, who we emulate, and also in the morality of the authorship, which isn't always aligned with the protagonists.\n\nFrom Jung's point of view, the defeat of the dragon was the defeat of the inner tyrant that limited the flow of life's forces. When Siegfried hears the birds and the bees after tasting the blood of the dragon, it's like an inversion of the Eden myth, where the ability to speak with animals is lost as a result of eating the fruit. Psychologically, the defeat of one's inner tyrant or ego permits the restoration of one's relationship with emotion and intuition. Sufi mystics believe we should clean the mirrors of our heart -- empty ourselves of ego so that something greater can come through and be heard."
      }
    ],
    "overview": "In the Nibelung, history, myth and metallurgy align around core patterns capable of reflecting more than just one domain of meaning. The single weakness of quenched steel becomes the single weakness of a hero's personality becomes the mythic downfall of a historic culture. This is myth as nuclear fusion — requiring the combination of multiple cores to create something new. Beneath the epic of Siegfried lies one of the clearest examples of how real history becomes layered with divine narratives, in a way that reveals how this process has been working behind more ancient myths for millennia."
  },
  "robin-hood": {
    "sections": [
      {
        "heading": "Stealing Fire from the Gods",
        "text": "Stealing from the rich to give to the poor is like stealing fire from the gods to give to humans, and what both stories are really about is the restoration of vitality and freedom that's been oppressed by tyranny, order and taxation. Robin robs from the rich and gives to the poor. Prometheus steals fire from the gods to give to humans -- humans Zeus would have taxed to death. This is the timeless story of a trickster-led rebellion against the oppression of vitality by the life-sucking grip of a tyrant's laws.\n\nOn the deepest level, this is the story of a trickster disrupting order to free stifled vitality. So though Robin is healing a kingdom, he looks a lot like the green fertility figures who restore nature. This is a story of freedom versus order, rebellion versus tyranny."
      },
      {
        "heading": "The Prototype for Revolution",
        "text": "Hunting of forbidden game with a bow is an introduction shared by Robin Hood and Katniss, who can tell us a lot about him. Not only do they both lead rebellions against a scheme of taxation, but in the case of the Hunger Games, the taxation is human life, which is a more direct stand-in for human vitality. Robin Hood is the prototype for the story of the American Revolution, and by extension, the American Dream. Like the American Revolution, Robin Hood leads a rebellion on behalf of the overtaxed against a tyrannical monarch of England. Both result in a just government, and where Robin Hood has become conflated with the Magna Carta's origin story, the American Revolution gave birth to modern democracy.\n\nV for Vendetta is a favorite Robin Hood character. Without the bow, we see the same lighthearted romantic revolutionary fighting back against an English tyrant. This is a mythic structure we remember from Prometheus and the birth of Athenian democracy."
      },
      {
        "heading": "The Cauldron of Outlaws",
        "text": "There have been and there will continue to be real Robin Hoods. On one hand, there are very real historic figures who appear in the earliest records of his myth, and on the other, historic people will continue to be integrated. Tolkien pushed back against scholars attempting to reduce Arthur to a single historic figure by suggesting that a good storyteller draws from a cauldron of stories -- an undifferentiated mixture of sources. It's less about making sense of what specific source ended up in which specific story and more about what's in the soup and how it's served.\n\nWe keep throwing more and more Robin Hoods in the soup, but we keep selecting around the same criteria. From history to folklore, we're looking for better and better details to tell the story that wants to be told. And the story that wants to be told is one of a pure-hearted rebel against a hard-hearted king -- the vitality of a trickster versus the vampirism of a tyrant. While the story has gotten further from any single historic origin, it's gotten closer and closer to its archetypal truth."
      },
      {
        "heading": "The Moon Against the Sun",
        "text": "When the law is not just, outlaws become heroes. When laws oppress, from literal slavery to vampiric taxation, to break that law becomes heroic. Robin Hood does two things characteristic of all true heroes: not only does he bring truth and fairness to the world, he does so at extreme risk against a greater force. His opposition to tyranny is no less than a David and Goliath matchup between an individual and the power of the state.\n\nThe conflict of sun and moon is a conflict defined by the sun's tyrannical dominance and the moon's mysterious ways. Where the solar king is linear, power-driven and direct, Robin is associated with music, wine, romance and the forest. He takes no offense when losing a fight to Little John as a king would. What we're seeing is a counterbalance to an overly solar, masculine and power-driven psyche with the levity of Robin's trickster heart, with the dark mystery of the forest and an understanding of those people oppressed towards the darker spaces."
      }
    ],
    "overview": "Stealing from the rich to give to the poor is like stealing fire from the gods to give to humans — both stories are about the restoration of vitality oppressed by tyranny. Robin Hood is the prototype for the story of revolution, from the Magna Carta to the American Dream to V for Vendetta. Where the solar king is linear, power-driven and direct, Robin is the moon — associated with music, wine, romance and the mystery of the forest. The conflict of sun and moon, order and freedom, is as timeless as the myth itself."
  },
  "amazons": {
    "sections": [
      {
        "heading": "Feminine Ferocity Focused",
        "text": "Attila's army was defined by the advantages of archers on horseback, and there's nothing that could stop a woman from learning this skill. A group of women on horseback with bows would be devastatingly dangerous on any ancient battlefield. Diana or Artemis, like the Amazons, wields the bow. The bow represents aiming focus. Where the Dionysian Maenads enact the destructive force of feminine fury, their scariest quality is unthinking belligerence. Athena bears the Gorgon on her shield to display her inner mastery of this feminine fury, and Artemis bears a bow to demonstrate the focus of this feminine ferocity into a single penetrating dart.\n\nSome Amazons bear the image of the Gorgon on their shield -- like Athena. This represents the warrior woman's ability to harness her inner Gorgon, which is a nightmarish interpretation of feminine vitality. As with male berserker warriors like Hercules and Ajax, those woman warriors who can channel their inner rage into a disciplined fighting style are the most fearsome of all. This is the same reason we see the Gorgon on the shield of Zeus, whose Olympian order subdued the Titanic -- it represents the ability to harness that raw part of ourselves with inner discipline and intellect."
      },
      {
        "heading": "Shadows of Athenian Wives",
        "text": "It's not only that women were oppressed in ancient Greece, it's that they saw femininity as something to be oppressed. From Pandora to Eve, there's an association of mother with matter. In Latin, they share the same word -- Mater. From Christianity to the philosophy of Socrates, there is a belief that matter and embodiment is a prison that corrupts consciousness. This hasn't just led to the repression of qualities identified as feminine, it's led to the objectification and oppression of real women. The subduing of bodily sin has been indistinguishable from the suppressing of females and femininity.\n\nAmazons might be seen as perfect shadows for ancient Athenian wives, who did not govern or fight. In contrast with the highly oppressed lifestyles of ancient Greek wives, their images of Athena and Artemis were warriors. In fairytales we have the contrast between wicked witches and fairy godmothers, representing two sides of feminine potential. Where the frenzy of a Maenad represents unbound instinct, the discipline of Amazon archers represents the potential to focus that destructive potency into a single aimed shot."
      },
      {
        "heading": "A Memory of Mating Rituals",
        "text": "There's no doubt that Amazons served as wonder women for ancient Greek men, whose heroes sought them as brides. Heroes and Amazons fall in love with one another on the battlefield once one has bested the other in a very close struggle. On one level this might be a memory of a very real mating ritual in which Indo-European war bands set out in search of women. On another level, lovers continue to look for their match, and love is never free of power. The fight between male and female warriors becomes a poetic expression of love and lust.\n\nWomen were treated so unequally in ancient Athens that a peer-to-peer relationship was unthinkable enough for men to only know peer-to-peer romance as existing between men. In a society like that, the male wish for a peer might look like a fantasy tale in which warrior women were found on an adventure. Recent discoveries have shown that many ancient Amazonian names are Abkhazian, Ubek and Ossetian. To this day, these people tell stories of Narts, and among these Narts is a figure named Amazan, a woman warrior who leads a band of women who live in the forest."
      },
      {
        "heading": "From the Amazons to Wonder Woman",
        "text": "Amazon myths are a conglomeration of several things. They represent a memory of what may have been a more matriarchal period in human history. Their battles with men may capture memories of an ancient mating ritual. They are certainly shadow figures for oppressed Athenian wives and fantasy figures for Athenian men. Beneath all of this, they may be a real historical group of fighting women that doesn't deserve but might actually appreciate their emergence as poetic representatives of repressed ferocity and feminine focus.\n\nFemale action heroes are not masculinized women -- women can fight, with their bodies and minds, which finds expression in the poetic stories of Diana and the Amazons. When women fight, they use feminine power, related to their sexuality as much as their motherhood. And when women fight, it tends to be for feminine motivations, from exacting revenge on the unjust treatment of women to the defense of their nests. William Marston was a psychologist and writer who believed in love and women at a time defined by men at war. In one of the most meaningful scenes in recent memory, we see Diana emerge from the trenches to stare down the full fury of the Nazi army, and in that moment we see the rising of repressed feminine vitality against the very worst of our world's hypermasculine toxicity."
      }
    ],
    "overview": "The Amazons are simultaneously a memory of what may have been a more matriarchal past, shadow figures for oppressed Athenian wives, and fantasy figures for men who could only imagine peer-to-peer romance in the form of warrior women found on an adventure. Beneath these layers, they may represent a real historical group of fighting women — archers on horseback whose focused ferocity, from Diana to Wonder Woman, continues to rise against the very worst of hypermasculine toxicity."
  },
  "atlantis": {
    "sections": [
      {
        "heading": "Civilizations Before the Flood",
        "text": "Atlantis is fascinating because of the way it relates to the bigger picture of prehistoric civilizations and the way it ties into world history. It really has to do with ancient seafaring cultures, which may have been more evolved than their on-land counterparts. The oldest cities were fishing cities. Atlantis could be seen as a culture from a mythological time before the flood, vanished from a greater event.\n\nThere are a lot of cultures who tell stories like Atlantis. In the same way Atlantis vanished, so did Eden in the Bible and the Sumerian Eden, Dilmun, which was a seafaring culture like the Atlanteans. Thera was also lost to the sea. If there was an early civilization that was flooded, then the coastal cities would have been lost like Atlantis. It is likely that the myth of Atlantis was inspired by several real and mythical examples."
      },
      {
        "heading": "The Strait Where Empires Grow",
        "text": "Atlantis could be very real -- in fact, multiple Atlantises could be real. It could even be that Plato was combining several. Plato locates Atlantis where the Mediterranean opens into the Atlantic. Throughout history, cities have become very powerful and rich controlling such straits. The most famous examples would be Troy and Constantinople. Troy and Constantinople got wildly rich by controlling the strait between the Mediterranean and Black Sea. It's hard to imagine that a culture wouldn't have grown up and gotten rich where the Mediterranean and Atlantic connect, especially when you consider how much trade was going on between the North Atlantic and the Mediterranean.\n\nThe fall of the Minoans started just after the eruption of Thera and continued until just after the fall of Troy. It's possible that the Minoans participated in a larger alliance of seafaring cultures that included a significant port city in the Atlantic, and it's possible a series of natural and human disasters led to the gradual decline of that network. From my point of view, the Minoans are not the Atlanteans, but given a few of Plato's descriptions, it seems likely that they influenced his story."
      },
      {
        "heading": "A Blank Screen for Projection",
        "text": "The search for Atlantis is like a quest for the Grail -- a myth unto itself. From Disney to Hasbro, DC and Marvel, stories of the search for Atlantis or other underwater civilizations are common. There are a lot of supernatural theories, and you've got to locate them somewhere. The Atlantean mystery creates a blank screen for endless projection. The idea of advanced technology opens into the alien myth, as does their existence beneath the water, which would provide the atmospheric pressure required for aliens on bigger planets. So there's enough plausibility and mystery mixed together to sustain almost anything.\n\nAtlantis is a metaphor for many things. It depends on who's looking at it. If you want to see your belief that a culture was perfect before its fall, or want to see a Sodom and Gomorrah story, it's in there as well. Atlantis metaphorically represents the possibility of a fall following hubris, for an individual or a collective. It's a kind of end-of-the-world story at the beginning, which can be taken as a metaphor for the cycles of time."
      }
    ],
    "overview": "Atlantis is fascinating because of the way it ties into the bigger picture of prehistoric civilizations and what came before the flood. It could be very real — multiple Atlantises could be real — positioned where the Mediterranean opens to the Atlantic, the kind of strait where empires have always grown rich. But its most enduring power is as a blank screen for projection: whatever you want to believe about lost civilizations, advanced technology, or the hubris that precedes a fall, Atlantis will hold it."
  },
  "dragons": {
    "sections": [
      {
        "heading": "Energy Beings and Shape Shifters",
        "text": "When you look dead on at a serpent, it's a point. When you pull it tight, it's a line, but it can also be a wave, circle, or any other shape. Serpents and the dragons with which they're associated are shape shifters, but shapes aren't just in our world, they're in our minds. The mastery of form represented by the serpent isn't just a mastery of the world and its patterns, it's a capacity to understand how the patterns in our world relate to the patterns in our consciousness.\n\nThe dragon is energy that takes form, from rivers and flowing lava to chakras and rainbows. When we see serpent after serpent with mother after mother, we see example after example of a certain philosophy -- that we are not just born from our mothers, we are also like dragons, beings of energy taking form. Everything is -- all matter is energy, taking form. The Buddha teaches us that a flower is not earth, water, light or seed -- it's what happens when they take form together."
      },
      {
        "heading": "Rivers, Storms and the Demonization of Vitality",
        "text": "Our understanding of the dragon came from rivers -- the Nile and Yellow River were explicitly dragons for the first Chinese and Egyptian civilizations. Dragons govern everything like rivers govern the life within them. Conquerors demonize their enemies, so when rivers were conquered, the dragons that represented them became seen as demons. Because China's river valley civilizations were never conquered by outsiders, they still valorize their dragons.\n\nHowever, the other great river civilizations were defeated in the Iron Age, by greater weapons. As the river valleys were subdued, stories emerged of dragons defeated by heroes. The conquering emperors of China took a different approach -- they claimed to be the dragons and usurped their icons. The same can be said of Uther Pendragon, father of Arthur, who, by stealing the dragon's image, conflated it with tyranny. The dragon itself is not a tyrant. It is the flowing river, the flowing lava, the rainbow of freedom. Tyranny is when the river is conquered, when the mountain becomes a symbol of hoarding, and the rainbow becomes a mere call for gold."
      },
      {
        "heading": "Maiden and Serpent, Slayer and the Slain",
        "text": "The maiden and serpent are consorts throughout world mythology. From Eden to Tonga, the serpent is experienced as a seducer, which reveals the obvious association of the serpent with the male organ. When damsels are distressed by the dragon, femininity is distressed by the masculine. Her symbolic rescue and union with the hero is a balance-restoring myth. When this story occurs as the dream of a single dreamer, the dreamer is freeing his own femininity from his own masculine imbalance.\n\nTo slay a dragon is to vanquish what they represent. Sometimes we see them as hoarders, sometimes as tyrants, but they are also energy beings with magic and knowledge. To kill a dragon is often presented as the killing of fantasy, of magic, and life force itself. In the story of St. George we see the wishful fantasy of evil defeated and the devil subdued, which soothed a very scared and traumatized medieval soul. The defeat of the devil is also the defeat of paganism and non-Christian religions, and the dragon represents the ultimate source of non-Christian knowledge and power."
      },
      {
        "heading": "Fire, Knowledge and the Dragon Within",
        "text": "Fire is what makes humans unique from animals, but the dragon is the animal that produces fire from within. This is because it is an energy being -- what it brings is vitality, through rain, fire or the currents of rivers and seas, rainbows and lightning. It's all vitality taking form, over which, as a shape shifter, the serpent is master. And the forms aren't just in the world -- as Plato describes, the forms are also ideas. So as the master of form, the dragon is the master of ideas and the shape-shifting of our consciousness that enables them.\n\nWhen Siegfried became invincible by bathing in dragon's blood, but retained a weak spot where a leaf had remained on his body, this is like the weak spot of Achilles and the weak spot of metal when quenched. Dragon bones refer to the coal used to heat iron. The Placebo effect is very real, but it only works when the imagination expects to be healed. Dragons heal by healing the imagination. Dragons are killed to kill the imagination. There are no more powerful creatures in world mythology than dragons, and it's true everywhere."
      },
      {
        "heading": "Older Than Our Species",
        "text": "Snakes have been in our nightmares since before we were humans. By the time the first migrants were leaving Africa, our relationship with snakes, rivers, lightning and rainbows was already ancient. Imagination is older than humans -- so are its fears and associations -- and the association of snakes with death is as old as it gets. The question is when we began to make connections between the serpent and what shares its shape.\n\nIf there is a common origin to the dragon, it is not a region of the world, it's a region of the psyche. There are rivers and rainbows and spines and snakes and lightning bolts everywhere, and everywhere, they have roughly the same shape, and everywhere, there were poets and dreamers who saw this. Resolved conversations end. Answered questions are put to bed. Recurring myths are centered around undying concerns. As long as we're interested in the relationship of energy with matter and imagination with existence, the dragon will not lose its power."
      }
    ],
    "overview": "The dragon is energy that takes form — from rivers and flowing lava to chakras and rainbows. When serpent after serpent appears with mother after mother across world mythology, we see the same philosophy expressed: that all matter is energy taking form, and the master of form is the dragon. Where river valleys were never conquered, as in China, dragons are still honored. Where they were subdued, the dragon was demonized. But the dragon itself is not a tyrant — it is the flowing river, the lightning bolt, the rainbow of freedom."
  },
  "alexander-the-great": {
    "sections": [
      {
        "heading": "The Lynchpin of Western History",
        "text": "Alexander is the lynchpin of Western History. Without Alexander, there is no transition from the golden age of Athens to millennia of Greco-Roman Empire. His victories ensured the centrality of Greek culture and thought to Western history. In just thirteen years, he conquered Greece, Persia, Israel, Egypt and India, spreading Greek culture across the known world. He was a hero-king who charged into battle to make the world in his image.\n\nAlexander was the mark against which Caesar and the Roman emperors measured themselves. He was an example for Roman conquerors just like his empire was an example for Rome. When Caesar allied with Cleopatra, the tomb of Alexander came under the patronage of Rome, and Caesar, who imitated Alexander, would have seen the Roman acquisition of his divine body as a right to rule and evidence that his own conquest had been a continuation of the great legacy Alexander left behind."
      },
      {
        "heading": "The Conspiracy of Divine Blood",
        "text": "Arthur, Hercules, Christ, Alexander — according to myth, they were all conceived by a great father who came to their mother before she was known by her husband. It is a major motif from myth that shows up in the story of Alexander. His mother Olympias claimed he was the son of Zeus, for which reason he went to the oracle of Amun-Ra in Egypt, who was associated with Zeus by Alexander and the Greeks. Not only was he greeted as the son of God when he arrived, he also became a god when they elevated him to Pharaoh of Egypt.\n\nAccording to the Ptolemies, the true father of Alexander was the exiled pharaoh of Egypt, Nectanebo II, who would have presented himself as a god to Olympias and who is depicted in art as a dragon, which aligns with a story of Philip's in which he found her sleeping with a snake. If these stories are true, the source of Alexander's divine blood is the same as his eventual recognition as God — Egypt and the line of pharaohs. The Pharaoh was known by the Jews as the great dragon. Not only did Alexander become a pharaoh, but according to the Ptolemies his true father was Nectanebo II, which could have to do with the dragon sometimes appearing on his banners."
      },
      {
        "heading": "Egypt's Liberator",
        "text": "The Egyptians have a history of preferring Greek partnership to Persian — a common enemy of Athens and Egypt for centuries, who had partnered together on defense. Though the Persians ruled as pharaohs of Egypt, when Alexander arrived with the army of Athens, he was received as their protector. Like Persian conquerors before him, Alexander became pharaoh of Egypt, but where these were recognized as invaders, Alexander was received as a liberator.\n\nA legend arose that he was actually the son of the last free Egyptian pharaoh, Nectanebo, which aligned his mother's statement that he was the son of God. According to the legend, Alexander was a true Horus, a true son of the former pharaoh returned to seek vengeance on his father's betrayal. This is the myth of Osiris and Horus and Isis. Osiris is exiled by an invader. A sorceress queen then bears his son, who defeats the invading enemies of his father and becomes the rightful ruler of Egypt."
      },
      {
        "heading": "Achilles Reborn",
        "text": "Achilles was Alexander's Superman. Like pharaohs identifying with Horus when they go to war, he identified as the adored prototype for the role he wanted to play. New kings wear old crowns, and the mythic shoes into which Alexander wanted to step were those of Achilles, the warrior king. His was a repetition of a Trojan war in the east, against an enemy that offended all of Greece.\n\nAs the founder of Religious Studies, Mircea Eliade would say, New Year's ceremonies are recreations that retell the story of creation. Alexander's conquest was itself a recreation, a mythic repetition of the old war, carried out by a man who saw himself as the old hero reborn."
      },
      {
        "heading": "The Lost Tomb",
        "text": "The Vatican's authority over the Christian world has to do with the belief that it was built on St. Peter's tomb. Similarly, Alexandria's leadership of the Alexandrian world had to do with the presence of Alexander's tomb. If we start where we are born and end where we are buried, the tomb of a great leader is representative of where they left off, and the point from which the story continues.\n\nAlexander was not just a historic figure. Because he was also remembered as a god, he was not just remembered, he was worshiped. So when Rome converted to Christianity and began persecuting pagans, his worshipers and temple were in jeopardy. Christians were minorities in Alexandria until 330 AD, and by 390, all signs of paganism were to be destroyed across Rome. Alexander's tomb could have suffered the same fate as so many other pagan monuments. In some cases, however, pagan sites were converted into Christian churches, which could have been the case with the magnificent tomb of Alexander. If it was repurposed for Christianity in the late fourth century, it is believed it could have been repurposed as the tomb of St. Mark. Centuries later, when the city's leadership was Muslim, two pilgrims from Venice are said to have stolen the body. When they returned, work began on what became St. Mark's Basilica. That they were both mummified makes it even harder to determine the truth."
      }
    ],
    "overview": "Alexander is the lynchpin of Western history — without him, there is no transition from the golden age of Athens to millennia of Greco-Roman empire. He saw himself as Achilles reborn, waging a mythic repetition of the Trojan War, and was received in Egypt as the true son of Ra, a liberator whose arrival fulfilled the myth of Horus returning to reclaim his father's throne. His lost tomb, like his legacy, sits at the intersection of worship and erasure, pagan splendor and Christian suppression."
  },
  "cleopatra": {
    "sections": [
      {
        "heading": "Isis Incarnate",
        "text": "To understand Cleopatra, we have to understand the goddess with whom she identified — Isis, who, as a Greek, she recognized as Aphrodite, and who, as a Roman, Caesar knew as Venus, the consort of Mars. In the central narrative of ancient Egypt, Osiris is just a corpse. Isis is the star — Venus actually. And like an ancient superhero, she rescues her abducted lover and leads the conspiracy to save Egypt. She is the queen mother and protectress of Egypt and her family, a role to which she brings the full force of femininity.\n\nIsis is a myth of feminine power, and we have been deprived of it. The persecution of witches is indivisible from the reduction of Isis in our collective conversation. Master of the mysteries, she is brilliant, powerful and nurturing, sexual and dignified. So too, was Cleopatra. Everyone else chose to be Horus. She chose to be Isis. She was not a female leader who modeled herself after men. She was a woman who drew power from her femininity. Imagine a woman as a head of state actually using her femininity. That was Isis. That was Cleopatra."
      },
      {
        "heading": "The Carpet, the Wand, and the Wings of Isis",
        "text": "When Cleopatra appeared to Caesar in a carpet, she appeared as the fabric of reality with which Isis was associated. In Latin, we see this connection in the word mater, which means both mother and matter, related to the word matrix. The matrix of reality is the maternal fabric of reality. Everything in our reality is born from that matter of mothers — this is the maternal matrix of matter. This is the carpet in which Cleopatra appears. She is not just offering herself, she is offering the wings of Isis — arms in which the world's greatest leader might truly rest. And he did.\n\nLike the fairy that awakens Pinocchio with a spark from her magic wand, the first spark of Osiris' resurrection is delivered by a wooden phallus invented by Isis. So when Cleopatra is credited for inventing the vibrator, everyone in Egypt saw Isis. This recurring motif of the wand and life-spark concerns the mystery of life itself, a secret kept by Isis in the quiet of her cosmic womb, the source of all life."
      },
      {
        "heading": "Venus and Mars in the Flesh",
        "text": "Caesar referred to himself as the son of Mars, the Roman god of war, and Cleopatra identified as Isis-Aphrodite — Venus, for the Romans. In myth, Mars' lover is Venus. Historically, it is as though the myth came to life in the romance of Cleopatra and Caesar, Venus and Mars incarnate, love and power in the flesh. The greatest power couple in history would have to be Caesar and Cleopatra, in whom the conqueror met his match. But where he conquered with blades, she ruled with femininity.\n\nWhen Cleopatra appeared to Marc Antony as Aphrodite, it was not a departure from her role as Isis, who, for the Greeks, was associated with their goddess of love. Alexander's conquest had led to an era of globalization that emphasized connections between gods from different regions. In Alexandrian Egypt, Isis was seen as Aphrodite. Her appearance to Antony in this form was both targeted seduction and, for her, part of her magic."
      },
      {
        "heading": "A Life Modeled on Myth",
        "text": "Cleopatra was modeling her personality and life after a myth long before her life was mythologized by painters and poets — and it shows. Her life was like a movie, which is why there are so many movies about her life. Like Isis, her goal was to bear a divine child that would lead a new world order, which is exactly what would have happened had she been able to clear a path for her son with Caesar, Caesarion. Had she succeeded, her people would not have been subdued by an invading force. Instead, Egypt would have been a partner in Rome.\n\nWe always see ourselves in every retelling of an old myth, and so we are always updating myths as mirrors of ourselves. We have had a different Cleopatra at different times in history. Sometimes she is a corrupting Eve, or Pandora, and sometimes she is an ultimate icon for feminine empowerment. By now, she is as much myth as she ever was history."
      },
      {
        "heading": "The Most Repressed Role Model",
        "text": "She is one of the best and most repressed role models in the history of human femininity. And it is because she is one of the most complete and empowered female role models in history that she is the most repressed. Every time you tell the story of Cleopatra, you remind the world that women can be powerful. If one woman could do it, others could as well. You are putting forward a role model and an option. It is hope for women and danger for men.\n\nThere has been a propaganda campaign against Cleopatra that is the same we have seen against Isis, witches, and Mary Magdalene — and it has to do with the way we see sexuality. Christians are always looking to retell the myth of Eve and to keep women in their places. So the story of Cleopatra gets turned into a story of Eve, because she is not in the place that the patriarchy would make for a woman. It is rare to have a single individual like Cleopatra who really transforms the trajectory of history, and she does it as one of the most complete and empowered women of all time."
      }
    ],
    "overview": "Cleopatra was not a female leader who modeled herself after men — she was a woman who drew power from her femininity, identifying as Isis incarnate in a world that would spend the next two millennia trying to suppress exactly that archetype. Her life was modeled on myth before it was mythologized by painters and poets, and her romance with Caesar was Venus and Mars in the flesh. She remains one of the best and most repressed role models in the history of human femininity."
  },
  "fourth-pyramid": {
    "sections": [
      {
        "heading": "The Pyramid as Ladder to Heaven",
        "text": "When the pharaoh dies, he becomes Osiris, son of the sun god who personified the djed pillar, a tree or ladder to heaven. To build a pyramid was to build Osiris' ladder to heaven — the pharaoh's ladder to Ra. The rise of the pyramids coincided with a rising emphasis on Re, as seen in the name of Djedef-Re. We translate it as \"Enduring like Re,\" but djed does not just mean enduring — it refers to the djed pillar climbed by Osiris to reach Re. So when the pharaoh dies and becomes Osiris, what does he actually climb to reach the sun? A pyramid. The pyramid is a djed pillar, and Djedefre built one.\n\n\"I am he of the Djed pillar,\" says Osiris, as he enters the underworld — says the dead pharaoh, as he takes on the role of Osiris. The djed pillar is Osiris' ladder to heaven and forerunner of the pyramid. Like holy mountains and treetops, the root metaphor of a pyramid comes from the fact that it rises to the heavens. Eden, Zeus and the Ten Commandments — all on mountaintops. Pyramids inherit the mythological qualities of these holy mountains, where above meets below."
      },
      {
        "heading": "The Son of Ra",
        "text": "Djedefre was the first pharaoh to declare himself the son of Ra, which the pharaohs continued for thousands of years until even their conqueror, Alexander the Great, was received as Ra's Son. In the same way a divine monarch of Europe derives authority from a Christian god, a pharaoh derives authority from the sun god Ra, who governs the living day and guides our souls through night and death. As the lord of daily and annual rhythms, the sun presents an image of governance, leadership and stability.\n\nThe sun does not just govern the day; it journeys through night and promises a new sunrise. This is what we see in the Pyramid Texts: the journey of pharaohs, in the form of Osiris, from sunset to sunrise, from death to rebirth. In this journey we do not just see the resurrection of an individual — we see the annual return of Nile floods and the life they bring, we see the cyclical defeat of occupying invaders, and we see the eternal renewal of Egypt itself."
      },
      {
        "heading": "Built on the Mountain",
        "text": "Pyramids build on the symbolism of holy mountains. So when Djedefre literally built his pyramid on a mountain, he did not just save time; he also assimilated the meaning that was already associated with the local high point — like building a church from a pagan temple, he repurposed what was already there. No example is more clear than a mountain made into a pyramid: one holy high point becoming another. From Abu Rawash, one can look down on Giza. Since Djedefre built on a mountain, his pyramidion was twenty meters higher than that of Giza.\n\nAs the Egyptians later shifted away from pyramids, they began making tombs in mountains. This is for the same reason the fourth pyramid was built on a mountain — because the core symbolism was inspired by the mountain. The shape of the pyramid represents the hierarchical power structure of Ra governing the cosmos and the pharaoh governing Egypt. In the same way the sun at its height rules over creation, the pharaoh at his or her height rules over Egypt."
      },
      {
        "heading": "Pride, Fall, and the Cosmic Layout",
        "text": "There is the historical mystery about where all the stone went, and then there is the mythic narrative that comes through. This is the story of a hubristic rise and humbling fall: the story of a pharaoh who declares himself the son of god while building a ladder to heaven, which, like the Tower of Babel, came down. Through the eyes of the Jews, we see the fall of the Tower of Babylon and the fall of Eden, where the attempts of Eve and Satan to elevate themselves to divine status were met by exile and destruction.\n\nIf the pyramid complex at Giza is anything like other monuments and holy cities from around the world, each pharaoh was participating in a multigenerational plan. The layout of Giza would match the layout of the great Mexican pyramids if we can recognize the dark, distant pyramid as relating to storms. Distant from the great pyramid of the sun in Mexico City, built atop a higher mountain, is the temple of the moon, dedicated to the storm god. Similarly, the fourth pyramid was built atop a higher mountain at a bit of a distance, and it was not made to shine like the sun — it was covered in dark materials. The horned serpent in Djedefre's name connects to storm symbolism found around the world, from ancient China to Mexico."
      }
    ],
    "overview": "The fourth pyramid at Abu Rawash is the story of a pharaoh who declared himself the first Son of Ra while building a ladder to heaven — and whose monument, like the Tower of Babel, came down. Djedefre built on a mountain, assimilating the holy symbolism already there, and his pyramidion stood twenty meters higher than Giza. Covered in dark materials where others shone like the sun, the fourth pyramid suggests a cosmic layout connecting sun and storm, mirroring patterns found from Mexico to China."
  },
  "illuminati": {
    "sections": [
      {
        "heading": "The Anatomy of Conspiracy",
        "text": "Conspiracy theories concern the conspiring of a small group around secret plans. This is not about the standard efforts of companies and governments to make money and expand power — conspiracy theories are about hidden powers. In the 2020s, it has become increasingly important to address our susceptibility to conspiracy theories and how big lies work. Why are bigger lies more convincing? Part of the reason is because they force us to find a way of thinking in which they might be true. This is enabled by the erosion of trust in \"facts\" by scientists who have auctioned their authority. The subsequent recognition that the truth of a motivation is more reliable than facts has led us to prioritize narrative.\n\nEvery PR firm, politician and storyteller is in the business of convincing. This is not the same as lying, but most of us know agendas to be developed and sold separately. What is said behind closed doors is not in commercials. This is where we get terms like Greenwashing and virtue signaling. The inability to know what is really going on leaves room for speculation, and within this room for speculation, everything is possible — including the notion that it is all connected."
      },
      {
        "heading": "The Inner Child and the All-Seeing Eye",
        "text": "Conspiracy theories present the world as more predictable and managed than the alternative, which plays off our childhood psyche. The first all-seeing eyes are those of our parents, who limit our freedom to keep us safe. This is nurturing for a child but oppressive to adults. Our inner child feels both comforted and stifled by the notion of a ruling elite. So whether you want something secure or something to rebel against, conspiracy theories fit the bill.\n\nThe eye of the Illuminati, like the eyes of the mother, makes us feel seen. On the other hand, to be watched is to be controlled. Some parts of us want there to be an Illuminati out there seeing us and watching us like Santa and Mom, affirming our existence. On the other hand, we do not want Mom or Hal or the Illuminati looking over our shoulder, controlling what we do. Ancient humans knew that an unseen group of predators could be tracking them at any moment, which set up an instinct to always be wary of unknown predators. This is how the fear of wolves becomes a fear of secret societies."
      },
      {
        "heading": "The Myth's Flexibility",
        "text": "The myth of the Illuminati is so successful because of its flexibility. Whatever your belief system is, you can find it in the Illuminati conversation. Are they a caring group who want to bring peace and enlightenment? Are they a secret cabal of tyrants? Is the world full of dupes? Whatever you want to believe, you can find it. Tolkien recognized that storytellers tend to ladle their narratives from a cauldron of stories — myths, folklore, religion and gossip, memories and dreams. The Illuminati myth is more grounded in the abstract concept of a ruling elite than a specific secret society.\n\nThe abstract notion of a secret elite is like a center of gravity that draws in historic and fictional examples that converge in the form of a myth. Once you are running with the essential mythology of a global elite, it is just a matter of time before every relatable image, figure and example becomes integrated. The all-seeing eye is a recurring symbol of omniscience. One could argue that it recurs because of some single society diffusing through time, secretly, or it could be because an eye on a mountain is simply a great metaphor for omniscience."
      },
      {
        "heading": "Patterns, Tricks, and Tunnel Vision",
        "text": "Humans are abstract geniuses who do not just see patterns everywhere, but even across the senses. We call cheese sharp, music soft, a touch sweet. Poetry and metaphor emerge when we synthesize recurring patterns. But we see what we are looking for and we are looking for confirmation. We spiral into delusion when we want confirmation enough to, consciously or unconsciously, ignore facts.\n\nMagicians present partial truths to trick our belief. Conspiracy theories are like tricks. The more truth, the more convincing — like the aerial images of Karlsruhe and Washington, D.C. If you research what they look like, you can see the pattern quite clearly. The theory that it is because of the Illuminati, on the other hand, you cannot verify. But if one thing is true, many people tend to believe the other. Wayward conspiracy theorists and troubled gamblers are comparable: both maintain a sort of tunnel vision around their own beliefs and expectations, typically against the odds, despite their large bets."
      },
      {
        "heading": "The Irony of Enlightenment",
        "text": "The belief in a logical and coherent universe is more ancient than the Tao or Logos. But it was Newton who showed the math. This breakthrough, more than anything, gave birth to the Enlightenment. The real reason we adopted Enlightenment values is because the Newtonian paradigm was more convincing than the state or church — especially after Copernicus. When the Illuminati was formed, such covens were the rage, and Freemasonry was the gold standard.\n\nThe stated agenda of the Illuminati had everything to do with grounding the world in science and fact — that minds are lost in their pursuit is terribly ironic. We end up aligning around resonant narratives and psychologies more than facts, which we have come to believe are secondary to motive. This is exactly what the Illuminati was against, insofar as their stated agenda had everything to do with creating a more secular world grounded in science and fact."
      }
    ],
    "overview": "Conspiracy theories present the world as more predictable and managed than the alternative, playing off our inner child's need for all-seeing parents. The Illuminati myth succeeds because of its extraordinary flexibility — whatever you want to believe, you can find it in the conversation. Beneath the paranoia lies a deep irony: the historical Illuminati was founded to ground the world in science and fact, and that minds are lost in pursuit of their myth is the most terribly ironic outcome of all."
  },
  "israels-lost-tribes": {
    "sections": [
      {
        "heading": "History as Holy Myth",
        "text": "The journey of Jews through history is the arch narrative of their religious tradition, which is to say, their history is their myth and their myth is their history. Unlike other traditions that see mythic time as before history, for the Jews, God's plan turns history into an expression of mythic time. This creates a built-in expectation that historians will validate their cultural memories, and it turns that work into something that can look like a religious quest to prove that their myth is true.\n\nHistorical accuracy is an essential part of the religion. The Jewish understanding of history as a living out of God's plan gives religious significance to the historical validation of their mythic memories. So in the case of African Jews, DNA evidence becomes proof that their myth is historical, that they are part of the story, and that they, too, are chosen people. Before it was found, we thought Troy was just a myth. Could this be happening with the Lost Tribes of Israel?"
      },
      {
        "heading": "The Trauma of Separation",
        "text": "For any Jew not in Israel, they know their family left, at some point, for some reason. This personal memory and experience of separation becomes colored by religious narratives that cast such departures as tragedy while calling for return. We see it in the exile from Eden and desire to return. We see it in the Babylonian exile. We see it in the story of lost tribes. And we see the traumatic displacement from home become core to Jewish histories yet again when they were exiled from Spain, and again when they were taken to concentration camps.\n\nThis deep trauma of separation and the desire to return is more than historical. As we see in the story of Adam and Eve, it is a repetition of their experience of separation from God. To be in Eden was to be with God. To be in Israel before the temple was destroyed was to be where God was. To be forced from the Garden was to be forced from God, which was to be alone in the world. To be a lost tribe is not just to participate in Jewish history; it is to participate in the divine journey of God's chosen people, which, for all Jews, provides a meaningful and divine context for all the struggles and suffering through which they have gone."
      },
      {
        "heading": "The Lemba and the Evidence",
        "text": "Trade routes tend to outline coasts and follow trade winds. The extension of trade to the African coast from the Arabian Peninsula was favored by both, which is why the migration route of the Lemba has become a superhighway for global trade. All we have to do is get over the delusional myth that ancient humans were not highly interconnected, and we will see that their journey is not beyond reason.\n\nThe story of the lost tribes is a mythical narrative believed to be real, and so we look for a convergence of mythic and literal evidence. Do they fit the story, and do the facts line up? Finding Sena in Yemen weaves facts into the narrative, from the boat and consistency of clan names to its intermediary position between Israel and Africa and the way it serves the story itself. DNA evidence is a hard fact, and when it aligns with the oral history of the Lemba and mythic memories of the Hebrews, and when deeper analysis shows so many similarities between their traditions, the question becomes hard to ignore."
      },
      {
        "heading": "The Sabbath River and the Other Side",
        "text": "When it is said that the ten tribes exist on the other side of the river which stops flowing on the Sabbath, the last day of creation, the meaning may be that the ten tribes exist on the other side of creation. God created the world in six days and rested on the Sabbath. The last day of the Roman week was also dedicated to the father god, Saturn, from whom we get the scythe-wielding figure that we know as Death. The rest of the Sabbath is like the rest we are talking about when we lay someone down to rest.\n\nSo when we see the association of the lost tribes with the Sabbath, and with a dry, still, lifeless river, we recognize the suggestion that these tribes are truly gone — maybe killed, maybe assimilated. This is a more poetic way of saying they are dead. To be on the other side of the Sabbath, on the other side of Saturn, the other side of the last day of creation, is to be beyond the realm of death."
      },
      {
        "heading": "The Law of Return",
        "text": "Jews whose families have long since left Israel can project their own story onto that of the lost tribes — estranged and with forgotten links to the home world, still an essential part of the community with a standing invitation to return, which is literally provided by the state of Israel. With Israel's Law of Return, the question of whether or not the African Jews are from a lost tribe becomes very important. If they are, they are entitled to a state-sponsored visit and right to return. This would mean the entire group, if elevated to Lost Tribe Status by the chief rabbi, could immigrate to Israel.\n\nIt is a strong link between religious and political matters. The prophets connect the returning of all Jews to Jerusalem with the coming of the Messiah, so it becomes a very important part of their faith. No tribes, no return, no Messiah. The lost tribes myth is a myth for Jews who cannot trace their lineage all the way back to Israel. It is a story that contains the desire to return and the desire to invite and the desire to make something new when that returning happens."
      }
    ],
    "overview": "The journey of Jews through history is the arch narrative of their religious tradition — their history is their myth and their myth is their history. The story of the lost tribes carries the deep trauma of separation from home and from God, from Eden to the Babylonian exile to the concentration camps. When DNA evidence aligns with the oral history of African Jews like the Lemba, the question of whether myth can also be history becomes impossible to ignore."
  },
  "curse-of-king-tut": {
    "sections": [
      {
        "heading": "The Myth That Wove Egypt Together",
        "text": "For millennia, the strength of the Egyptian state was contingent with the convincing coherence of its myth, which wove Egyptian life into a single tapestry. The Osiris myth modeled the journey of pharaohs, who modeled the journey of sun, season, crop, regime and the lives of Egyptian people, animals and plants — to say the least. Not only was the discovery of King Tut's tomb and treasure one of the greatest discoveries in modern archaeology, King Tut also played one of the most interesting roles in Egyptian history. His father was Akhenaten, who radically transformed the Egyptian religion into a kind of monotheism, which his son was forced to undo by the traditional priesthood."
      },
      {
        "heading": "The Birth of the Curse",
        "text": "There were definitely Egyptian curses concerning grave robbery, as seen on walls of pre-Pyramidal tombs in Giza. Shakespeare did the same thing. If you do not want people messing with your grave, put a curse on your tomb, whether you believe in it or not. That having been said, it seems such references were not required by performers who made shows of unwrapping mummies and popularized such notions of a curse well before the discovery of Tut.\n\nNot only did the high-profile financier of the dig, an English noble, die a mysterious death, it was also written about and described as a curse by Sir Arthur Conan Doyle, the author of Sherlock Holmes. On the back of a huge discovery, mysterious death and the contributions of a famed writer, the curse became a runaway hit. Despite various efforts to debunk the story, it was as big a hit as anything the author wrote, and now, after countless movies and spinoffs, the myth seems to be going nowhere."
      },
      {
        "heading": "Egyptomania and the Keyhole",
        "text": "Throughout the Victorian world, people were holding unwrapping parties in which they removed relics from the bandages of mummies. It was all the rage. When Tut was found, the Egyptomania exploded, and the curses — we all know the power of a good horror story. We might not like what we see, but we really want to look. Something about the tiny keyhole through which his treasures were first seen feels like a perfect metaphor. Egypt was far away — spatially, temporally, philosophically and mythically — our view was but through a keyhole.\n\nThe curse gave the archaeologists a juicy story without having to relent on giving press access. This did not just reduce their disappointment; it excited them more and their audiences even more still. The average life expectancy of those who were supposedly affected by the curse was actually longer than the average Englishman of the day — that does not sound so bad. And the mysterious death of the financier has been explained by a mosquito bite. So there may not have been a curse bringing down these archaeologists. That having been said, we do not want it gone from our movies."
      }
    ],
    "overview": "The discovery of King Tut's tomb was one of the greatest finds in modern archaeology, and the curse that followed was one of its greatest myths. Born from the mysterious death of a high-profile financier, amplified by the author of Sherlock Holmes, and sustained by Egyptomania, the curse became a runaway phenomenon. Beneath the spectacle lies a deeper story: a boy king forced to undo his father Akhenaten's radical transformation of Egyptian religion, and a civilization whose strength depended on the convincing coherence of its myth."
  },
  "megaliths": {
    "sections": [
      {
        "heading": "The Journey of the Sun",
        "text": "We see our own journey in the journey of the sun — from the projection of death on sunset to birth or rebirth on sunrise. What walks on four legs in the morning, two at midday, and three in the afternoon? This is the riddle of the Sphinx, and it points to the essence of solar symbolism. First and foremost, we see our journey in the sun's. We see our birth in sunrise, after which we crawl on all fours, and we see death in the sunset, before which we walk with a cane.\n\nThe Summer and Winter Solstice are the turning points of the year. At the Winter Solstice, the days transition from getting colder, darker, drier and more dead to warmer, wetter, brighter and more alive. And it is not just the resurrection of nature we associate with this solar return — this is also the core metaphor for the resurrection of an individual, which is why Easter is celebrated at sunrise. For Neolithic humans, the winter solstice was not just the first light of a new year. It was also the beckoning of new light in all journeys, including a loved one's journey through death."
      },
      {
        "heading": "Participation Against Estrangement",
        "text": "There is a big leap you have to take to understand megaliths, and it is not that hard, but you have to take it. Megaliths are about participation — participation with nature, participation with the cosmos and with other humans. By aligning the individual with the rituals of the monument, the individual became aligned socially, professionally and spiritually, with each other and their world.\n\nFrom Adam and Satan to a modern shooter, the pain they feel is estrangement — separation from the divine and from one another. That is why we go to music festivals and parties and churches — to be with, to be in participation — with each other and our world. Aligning rituals with monuments aligned with the heavens and earth created an existential experience of alignment between the individual and their reality, which is perhaps the most important experience for a human. When people participate in ritual together, they do not feel alone, and loneliness is one of the great curses of humanity, which can turn into hate and violence if not resolved."
      },
      {
        "heading": "Crossing the Threshold",
        "text": "Entering a megalithic temple was like crossing the threshold between day and dream. The shift into darkness and chanting with ritual objects and symbolic imagery was accompanied by a shift in consciousness from daily life to participation in mythic time. To enter an ancient temple or the ritual caves that came before them was to enter a womb, the source and center of all creation. And that is how it felt — to be in the source and center of meaning.\n\nEntering a dark temple is a full sensory experience. Your eyes will have to adjust to the darkness within seconds. There are only little flickering lights of candles illuminating the space. Next thing you see are life-sized images of saints who stare directly at you. It smells of incense, the temperature drops. Your entire body is forced to immediately adapt. And then there is deep and rhythmic chanting piercing through your body. That hits every sense."
      },
      {
        "heading": "Monuments of Humility and Brilliance",
        "text": "Slaves did not build these things. They were built by communities who wanted to align with their cosmos for spiritual and practical reasons. Celebrations at these monuments would be hard to distinguish from parties. There was even fun involved, maybe love, maybe sex, and certainly celebration. In a pre-literate society, the paper on which they wrote was nature itself. Instead of putting ink to paper, they put stone to earth.\n\nThese monuments should be humbling, first and foremost. They are the death of arrogance. Anyone who thinks they can explain them fully runs up against something impossible they have to leave out. How were stones moved, how were they cut and placed, and how in the hell do you get the level of mass participation required to build them? Because ancient humans did not have the tools we have, we tend to think they were not as smart as we are, but there is no evidence of this. In fact, writing reduced many of our brain's capacities. So when we look back at ancient humans and their monuments, it is important to not dismiss ancient brilliance."
      },
      {
        "heading": "Setting Tea Times with the Cosmos",
        "text": "Many megalithic monuments are solar calendars, some are lunar calendars, some track the movements of Venus and some track the journey of earth through its seasons. Calendar, however, is a reductive term. They were not just keeping time. They were participating in it. If you know when teatime is, you can have tea with everyone — emphasis on, with everyone. Modern lovers of astrology may want to know what is going on up there so they know how it is influencing them down here, but what alignment with the heavens is really about is just alignment — it is about setting tea times with the cosmos.\n\nMegaliths are like time machines — on one hand, they were machines used for the measurement of time, and on another, they traveled to the future and take us to the past. In the first well-documented epic quest for immortality, Gilgamesh landed on the conclusion that his immortality would be preserved in a stone monument. To participate in the building of an enduring monument is to transcend the limited range of time in which the individual lives."
      }
    ],
    "overview": "Megaliths are about participation — with nature, with the cosmos, and with one another. These monuments were not just calendars; they were machines for aligning the individual with the rhythms of earth and sky, creating an existential experience of belonging in a species haunted by estrangement. Built by communities, not slaves, they are the death of arrogance — monuments of humility and brilliance that remind us ancient humans were no less intelligent than we are, and that they wrote on the earth itself because they had no paper."
  },
  "pope-joan": {
    "sections": [
      {
        "heading": "The Patriarch's Worst Nightmare",
        "text": "Can you imagine a worse nightmare for patriarchy than a matriarch on its throne? Beneath the story of a scandalous affair and its defiance of church law is a more profound challenge to patriarchy itself. And it is not just divine patriarchy. Pope Joan is a reminder for paternal kings and husbands that mothers control creation. A new image of a pope giving birth would be as subversive today as it was in the time of Pope Joan. It is like the graffiti of a punk artist saying, oh, so you think a patriarch has the monopoly on divinity and creation all by himself? He cannot even do this. Women literally have the authority to create life.\n\nPope Joan offers a particularly pointed example of the eternal power struggle between men and women. This story is older than our species and it continues to this day — in every government, in every business, in every relationship and every psyche. Straight, gay, bi, trans, he, her, they, them — there is not a person to whom the inner and outer power struggle of femininity and masculinity does not matter."
      },
      {
        "heading": "Eve on the Papal Throne",
        "text": "Pope Joan is a perfect shadow figure for a medieval Christian worldview that presented Mary, a virgin, as the ideal woman. Where Mary conceives without intercourse or lust, Pope Joan is just Eve — a disobedient seductress who hides her sin from the divine patriarchy. This is not just a story of feared femininity; it is a paranoia about its ability to secretively climb the ladder. Would the whole church have become filled with witches in hiding?\n\nThe demonization of Pope Joan is a repetition of hatred for Eve, and what that hatred represents is an anger at having fallen. This is the fall of spirit into matter. Matter is not just seen as a prison that corrupts the soul; it is also the word for Mother. As matter and body are seen as corrupting prisons of falling consciousness, the mother becomes a representative of the fall and a personification of corruption with a seductive body. For the same reasons, Pope Joan became associated with the Whore of Babylon."
      },
      {
        "heading": "Better Than the Men at Their Own Game",
        "text": "This is the story of a world in which women have to be as a man to succeed, and in these stories — some fictional, some real, some ongoing — it is not enough for a woman to be as good as the men. She has to run circles around them to even be noticed. At the same time, this is the story of how powerful a person can be in a male-dominated world if they just integrate a little feminine. She may out-male the men at their own games, but she is also a woman, and she has qualities they have not engaged. As a more whole person, she runs circles around her peers.\n\nOn the surface, Joan out-mans the men as a leader and scholar who the men all recognize as an ultimate male patriarch. Beneath the surface, however, she is a perfect Eve — not only does she disobey the divine patriarchy for sinful sex with a presumably innocent man, she becomes a personification of exactly what the Christian consciousness is trying to oppress, repress and purify."
      },
      {
        "heading": "The Repressed Returns",
        "text": "Pope Joan is a personification of exactly what the church represses, and her birth in the Pope's clothing represents that which has been repressed finally forcing its way to the surface. Such a disruption, however, is only an inciting incident — an inciting incident that reformers experienced as a call to adventure, a call to change. Reform always follows disruption, in the self and in the world, and this disruption tends to take the form of a subversive act by a shadow figure that personifies exactly what her culture represses, oppresses and needs.\n\nThere will always be reformers, and they will always preserve stories that criticize the status quo. If the status quo had truly changed, if the Church had fully reformed, the story might no longer be on our minds. Until and unless there is real change, the reformers of our day will renew the cries of their predecessors. Wastelands are defined by the vitality they marginalize and repress. By now, our marginalization of the feminine is inseparable from the threats of climate change and nuclear extinction. But though the west has been defined by its oppression of femininity, our times are defined by its rise."
      }
    ],
    "overview": "Pope Joan is a story older than its alleged historical moment — the eternal power struggle between masculine and feminine expressed as the ultimate infiltration. Can you imagine a worse nightmare for patriarchy than a matriarch on its throne? Beneath the scandal lies a more profound challenge: a reminder that mothers control creation, that women can outperform men at their own games, and that whatever a culture represses will eventually force its way to the surface."
  },
  "great-flood": {
    "sections": [
      {
        "heading": "The Great Wiping Clean",
        "text": "Flood myths can be found all over the world, and they typically separate mythic time from real time — it is the great wiping clean of the time before time. Because the earliest cities were dependent on flooding rivers, floods did not just bring danger, they brought fertility to the fields. While the annual floods brought annual renewal, the great flood brought the renewal of an entire epoch, like a collective baptism.\n\nFrom the films of Roland Emmerich to Revelations, Apocalypse stories represent the projection of our own mortality onto that of our species. This is a natural thought, so it is a natural myth — from the Great Conflagration of the Stoics to the asteroid in Armageddon. But where death and resurrection provide metaphors for the renewal of an individual, Apocalypse is about the renewal of humanity."
      },
      {
        "heading": "Many Floods, One Myth",
        "text": "When you look at the horizon, it comes to a point — the same happens with the mythic imagination. The distant memory of multiple major floods likely converged to form these myths: the melting of glaciers, the river floods of ancient cities, perhaps a flood in the Black Sea. And floods are traumatizing. Myths then serve these memories while responding to the trauma and delivering wisdom.\n\nReal events can definitely become myths and we should always look for the potential histories beneath the surface. That having been said, flattening myths to a single historic event is often misguided. The flood in Hebrew mythology is believed to have been influenced by the Sumerian flood myth, which is likely to have been influenced by the civilization's annual floods and potentially that of the Black Sea. It is most common for historical memories to become embellished with mythic motifs over time — especially with oral narratives, which are not fixed in writing."
      },
      {
        "heading": "Fear, Change, and the Unknown",
        "text": "The fear of the end of the world is a projection of the end of the self, which we all fear. People do not just fear the end of the world; they fear change and displacement. Catastrophes always come with major change — that means entering the unknown. Myths help us to imagine the unknown, which makes it less scary.\n\nThe Old Testament god was known for his wrath. And like other divine patriarchs, he carries qualities of a storm god, who expresses his anger in the form of a storm. Real people survived real floods and have had real experiences like Noah's. Today's events will most certainly become mythologized. By now we have already seen the nuclear bomb and major recent wars in our culture's most popular stories. Humanity's biggest catastrophes will continue to inspire our biggest myths — from Hiroshima to the global warming which may actually bring the first worldwide flood experienced by humans."
      }
    ],
    "overview": "Flood myths separate mythic time from real time — the great wiping clean of the time before time. Because the earliest cities depended on flooding rivers, floods brought not just danger but fertility, and where annual floods brought annual renewal, the great flood brought the renewal of an entire epoch. The distant memory of multiple real floods likely converged to form these myths, and they persist because they carry our deepest anxiety: the projection of our own mortality onto that of our species."
  },
  "nostradamus": {
    "sections": [
      {
        "heading": "The Most Famous Prophet",
        "text": "If Merlin is the most famous wizard, Nostradamus is the most famous prophet. In the last five hundred years, there has been hardly a disaster, tyrant or pandemic not seen in his quatrains. From John the Revelator to the Oracle of Delphi, no prophet is more famous today than Nostradamus. His prophecies — especially those to which we gravitate — tend to focus on disaster. Disastrous deaths, disastrous leaders, disastrous pandemics and wars. Society would like to avert disaster, and so prophecies catch our ears.\n\nWhenever something catastrophic happens in the world, the name Nostradamus always falls in media reports. People are looking to validate their beliefs. Those who want to believe in prophecy and what that means to them will see Nostradamus hit the mark. Those who want to believe there is no such thing will find fault. Both can be projected on the range of possible interpretations."
      },
      {
        "heading": "Patterns in Time",
        "text": "When Tolkien was pressed to admit that Lord of the Rings was about World War I, he replied that the audience's closeness to World War I is what enabled them to see what he recognized as recurring narratives. Nostradamus seems to have similarly accessed perennial patterns through the comparison of historic repetitions with the time in which he lived. His observations of the present suddenly sound strongly like the past events of which he had read: epochs of religious discord, revolutions, ostracisms and civil wars seem catapulted into his time. He realizes that the future of his country looks like the destroyed past.\n\nCivilizations thrive on good predictions — from the anticipation of seasons to global warming and the forecast of earnings. This is what meteorologists are after, and astrologers. Both are trying to turn patterns in the sky into earthly predictions."
      },
      {
        "heading": "The Logic of Oracles",
        "text": "Astrology is to Tarot as Relativity is to Quantum Mechanics. Where astrology is all about the regularity of stars, Tarot is about god's dice. Delphic prophecies, on the other hand, look more like interpreted dreams. What they all share in common is metaphor, on which every oracle depends. Reading the stars is about interpreting the movements of the macrocosm as movements in the microcosm. As above so below — as without so within.\n\nAncient civilizations tended to represent their vision of the heavens in the construction of their cities and the configuration of their courts. On earth as it is in heaven. World religions and mythologies repeatedly present a vision of the individual as a piece or recreation of the creator or cosmos. And from this perspective, one might ask if there is entanglement between the shifting of inner and outer constellations, of macro and microcosmos."
      },
      {
        "heading": "Trance, Code, and the Surreal",
        "text": "By writing poetry in a trancelike state, Nostradamus was a predecessor of the Surrealists and David Lynch, who seek access beyond their conscious mind. Neuroscientific studies on mystics — especially Tibetans — have shown that altered states of consciousness can open access to thoughts and insights that would be otherwise inaccessible.\n\nNostradamus would not have been the first to encode a message in his poetry — in the metaphors of his imagery or the math of his meter. Both encode meaning in the Tarot, in Alchemical Recipes and Astrological interpretations. Poetry and meter bring math to language, which is often seen in sacred texts. From the quatrains of Nostradamus to the Talmud and Rig Veda, mystics look for codes. When looking for hidden meanings and codes, a misprint or misplacement — even of a comma or single letter — can make all the difference."
      },
      {
        "heading": "Prophecy and the Future",
        "text": "Anticipating what is going to happen is a survival skill — literally and emotionally. Whether it is anticipating a predator or a war, a harvest or a romantic connection, we anticipate to avoid suffering and pursue happiness. Our desire to avoid suffering and pursue happiness, however, can motivate us to believe in prophecies that might not be as justified as we want to believe. Convincing ourselves we know the future gives us a sense of control — justified or not.\n\nProphecy may not be provable or even probable, but it is not scientifically disqualified either. There are some interesting qualities of time, entanglement and M-Theory that raise questions about the participation of our future in the present. In the last few years, major shows like Westworld and Devs have featured the idea of predicting the future with algorithms. Jung was wary of this. The problem is that while the probabilities predicted by Quantum Mechanics are incredibly accurate, variation and anomaly is part of the prediction. The question becomes whether it is irresponsible, if not tyrannical, to impose a statistical prediction on the individual level."
      }
    ],
    "overview": "Nostradamus is to prophecy what Merlin is to wizardry — the most famous practitioner of a tradition far older than himself. Writing poetry in a trancelike state, he accessed perennial patterns through the comparison of historic repetitions, recognizing that the future of his country looked like its destroyed past. His quatrains persist because they operate on metaphor, the language of every oracle, and because the desire to anticipate disaster is a survival instinct as old as humanity."
  },
  "witches": {
    "sections": [
      {
        "heading": "Goddesses Fallen into Witches",
        "text": "As patriarchs rose, goddesses fell, and as they did, they turned into witches. Isis and Inanna were heroines, but when Inanna became Ishtar, the heroine became an enemy. Gaia was beloved, but in Greek mythology her human incarnation, Pandora, like Eve, is to blame for all suffering. This represents a shift in our relationship with the feminine and nature that turned women into witches and Eden into a fallen world.\n\nThe word \"witch\" comes from the same root as \"wit,\" which means clever. Prometheus was clever. The clever one, in myth, is a revolutionary, and the State, like Zeus in the story of Prometheus, has a tendency to want to put down the clever ones. So the silencing of witches is the silencing of rebellious cleverness, and in the case of the European witches, this cleverness had to do with the knowledge and wisdom of Europe that Christianity worked to completely snuff out.\n\nWhen Rome converted to Christianity, it demonized paganism, which became a catch-all for any belief system the new order opposed. The conflation of feminine and pagan enmity gives us the witch. Pagan gods became Christian demons and pagans became devil worshippers. Suppressed during the Roman period, the bloody conflict between Christian truth and paganism repeated in the Medieval era, and once Christendom encompassed Europe, much of what was seen as witchcraft was simply pagan and foreign."
      },
      {
        "heading": "The Patriarchal Fear of Feminine Power",
        "text": "The mythical story of the witch is deeply intertwined with masculine envy of the mother's power of creation. The power of creation comes from the wombs of nature, not the mechanisms of human effort. Fundamentally, men do not have the power to create, which means they live alongside a partner-gender with a supreme divine power that they cannot even begin to match. Fear and inferiority complexes start to create narratives that demonize and minimize this power in women.\n\nWomen are often experienced by men as more psychologically advanced, meaning they are more capable of manipulating them. Whether they do or not, the capacity is recognized, feared and reacted against. Thus we see narratives that demonize the feminine capacity to enchant. We all fear enchantment when it comes to love, and from a masculine perspective, negative romantic enchantments that ended in suffering are remembered in the mythic record by those in power. In a man's world, the one to blame will always be the woman.\n\nThe other major experience of overwhelming feminine power is that of the mother from the perspective of the child. Thus we see wonderful fairy godmothers and terrible wicked witches throughout our folklore. These are not just representations of our various ways of relating to femininity and the power of nature, they are also representations of our various ways of experiencing the mother. The mother has absolutely overwhelming power over the child, who is completely dependent on the mother, like a human is on the earth. In a world controlled by men, all of these masculine fears, insecurities and resentments of nature, creation, mothers, lovers and women come together in the image of the witch."
      },
      {
        "heading": "Man vs. Nature, Man vs. Witch",
        "text": "Patriarchy does not just oppress women; it suppresses those qualities with which it associates femininity, which are typically some combination of nature, body, emotion and pleasure. The man's world and consciousness is built on the subdual of these things, which it projects onto the witch. The demonization of one becomes the demonization of the other, and this does not just mean the mistreatment of women, it means the mistreatment of all that is associated with femininity within each man. This is what toxic masculinity looks like.\n\nThe annihilation of witches is inseparable from the rise of emphasis on human manipulation of the material world. Man vs. Witch is actually a Man vs. Nature story. The witch represents the forces of nature and creation that the Enlightenment paradigm wanted to repress. Their vision of the world was a vision of dead matter interacting in purely mechanical ways. There is no magic in this system, which means there was no room for witches in this paradigm.\n\nBuilt into the Classical and Christian stories about the origins of knowledge and humanity is an association of the feminine with materiality. This is why \"mater\" relates to both mother and matter. The material world is the mother's world, and like earth, the mother possesses the power of creation. Where patriarchy reduces matter to dead stuff, bodies become seen as dead stuff. The material world with which mothers are associated shifts from being seen as alive with the power of creation to being seen as a lifeless machine. To reduce matter to bodies comes with the reduction of women to bodies."
      },
      {
        "heading": "The Devil, the Witch, and the Fallen World",
        "text": "The reason witches are associated with the devil is because the Devil has come to be associated with the powers of nature, which is understood in a Christian consciousness as Fallen. Nature is constantly corrupting the soul, which is symbolized by the seductions of Pandora and Eve, who draw masculine consciousness into the fallen material world. This fallen world is the domain of devils as much as it is the domain of women. From this perspective, the womb is not a great power of creation; it is the portal through which souls fall. The seduction of the devil and the seduction of the woman are one.\n\nOnce we recognize the association of the woman with the mortal and material, we understand why witches are so frequently beautiful or aged. They are beautiful to represent the seductive nature of the material world. They are aged to represent the dreaded reality of aging that comes from entering the body and its mortal material world. In the aged witch we see the transference of our own anxieties around aging and death."
      },
      {
        "heading": "Brooms, Flight, and Modern Reclamation",
        "text": "The great Slavic witch, Baba Yaga, flies through the sky in a bucket and covers her tracks with a broom. In myth, when women are hurt, silenced and disempowered, they tell their stories where they can, in blankets and in clay. As they do, the domain to which they are relegated becomes their center of power. We see the symbols of Baba Yaga, her totems of power, the pail and broom, as domestic objects. But for a witch, for a storyteller, we can fly on these things. In the dead of night, where no one else sees, the details of children's stories give form to our future.\n\nThe witch is a mythic battleground for our relationship with magic, femininity and nature. The enemy of the witch is her demonization, but today her momentum is empowerment. As the shadow of toxic masculinity, she turns us around, and as a beacon of all that has been repressed with the feminine, she leads the way.\n\nWhat is the real witch's balm? How can they really heal us? Their very demonization is an expression of our cultural imbalance and the toxicity that comes with such an imbalance towards the masculine, which is away from nature, away from body, away from emotion and pleasure. By now, we can see a future of emotionless uploaded consciousness in robots on dead planets far away from our earth. Witches are balm for this traumatic fantasy and its real world consequences."
      }
    ],
    "overview": "As patriarchs rose, goddesses fell, and as they did, they turned into witches. The word witch comes from the same root as wit — cleverness — and the silencing of witches is the silencing of rebellious knowledge that Christianity worked to snuff out across Europe. Man versus witch is actually man versus nature, and the annihilation of witches is inseparable from the rise of a paradigm that reduces the living world to dead matter. The witch is balm for this reduction, and her momentum today is empowerment."
  },
  "ghosts": {
    "sections": [
      {
        "heading": "Soul and Breath, Body and Clay",
        "text": "Most cultures describe the awakening of first humans as an integration of fire, breath or divine essence with a clay or dough-like body. This symbolic distinction of soul and body predates the mind-body dualism of Descartes and Socrates by a large margin, as does the overlap of words for breath, air and spirit. Pneuma, for example, in Greek.\n\nWhen you see someone moving and then just stop dead, it is like something is gone, they are gone. This is so basic I am not sure dogs do not believe in ghosts; in fact, many ancient cultures thought they could see them."
      },
      {
        "heading": "The Greatest Confirmation We Seek",
        "text": "Death is the greatest of human concerns, and seeing a ghost would be the ultimate confirmation that life does not just end, not for you and not for your loved ones, some of whom may already be gone. To the extent we want evidence that life does not just end, we want stories of ghosts. And if there is an afterlife, and there are ghosts, they would probably be everywhere.\n\nThe beliefs of different cultures in the soul and afterlife are modeled in their myths, often in the form of ghosts, shades or spirits. The various beliefs about the afterlife then inflect the disposition of their ghosts. In Greece, Herakles' shade is found in Hades while another part of his being went to Olympus. In China, to be a ghost means you are too attached to move on, too attached to your appetites, for which reason you are punished with a tiny mouth. These are called \"hungry ghosts.\""
      },
      {
        "heading": "Cultural Lenses on the Paranormal",
        "text": "The different beliefs cultures take towards ghosts tend to emerge from their deepest worldviews, which are informed by religion, science and more. Catholics, for example, are far more receptive to ghosts than Lutherans. In Germany, free thinking, superstition and metaphor were attacked by Catholic inquisitions and Protestant literalism. England suffered none of these, and their history centers around global trade of both goods and ideas. That England is more receptive to the possibility of ghosts than Germans should come as no surprise.\n\nModern science does not disqualify the possibility of ghosts. Enlightenment science did, and the Western consciousness responsible for the Enlightenment still struggles with modern physics. This is not as true in India or Japan, where they do not suffer the same Enlightenment hangover or the Western predispositions that led to delusional dismissiveness and reductive thinking."
      },
      {
        "heading": "Confronting Death's True Face",
        "text": "Thinking about ghosts is thinking about death, which most of us choose not to do on a daily basis. The confronting of a ghost is a confrontation with death, and not just because the ghost is dead and might kill us, but because the very being of a ghost forces an existential confrontation with death. The fact that we make ghosts scary and tell scary stories about them is like putting a Halloween mask on a face of true horror.\n\nSome ghost phenomena can be explained by science, but other scientific explanations depend on assumptions and reductive either-or logic. The bigger question is: if science can explain a phenomenon, does that mean it cannot be a soul? Science can model and map the movement of neurochemistry in the brain and associate it with mental activity, but it cannot translate into the language of subjective experience. The same may be true with ghosts. We may be able to see weird energetic phenomena, but that does not mean we can dismiss the possibility of a subjective experience pertaining to that energy. Science, left to its own devices, will deny subjective consciousness in our own brains."
      }
    ],
    "overview": "Seeing a ghost would be the ultimate confirmation that life does not just end — not for you, not for your loved ones. The desire for this evidence is universal, which is why ghost stories appear in every culture, shaped by the deepest beliefs of each. From the Greek shade of Herakles split between Hades and Olympus to the Chinese hungry ghost punished for attachment, every culture's ghosts reveal what that culture most fears and hopes about death, consciousness, and the possibility that something survives the body."
  },
  "frankenstein": {
    "sections": [
      {
        "heading": "The Modern Prometheus",
        "text": "Sensorium Dei means that we are the sensory organs of the divine. Scientists who shared this perspective were not just trying to decode a secular universe. They wanted to know the mind of God. Emboldened by the discovery of electricity, Calculus and the Copernican revolution, scientists asked questions where before there were limits. They wanted to unlock the mystery of life.\n\nPrometheus, the bringer of technology, strains against boundaries as bondage. There are scientists and there are inventors. There are clerks and entrepreneurs, priests and shamans. Priestly scientists are like clerks who maintain the orthodox. But innovators, like Prometheus and Frankenstein, like shamans and entrepreneurs, break boundaries to go their own way. Frankenstein, the modern-day Prometheus, wrestles limitation itself. The fire he brings is not just the conscious vitality that animates his creatures, it is the technologies that enable revolution against the status quo."
      },
      {
        "heading": "Playing God and Crossing Boundaries",
        "text": "Wernher von Braun said the rocket would open the gates of heaven by freeing us from our chains. All innovation is against the bondage of some status quo: labor and disease, life on this planet. This is why Prometheus, the innovator, is always wrestling with chains. Technologies, from weapons to cures, rebel against the possible. But by rebelling against mortality, the human condition itself, Frankenstein crossed the ultimate boundary.\n\nWhat constitutes playing God? Dissecting the body was once seen as off limits. Stem cells have been seen as off limits. Both, however, have saved lives. Some see a challenge to the natural order in the coronavirus vaccine; some see a technology saving souls. Where we all seem to stop and hold our breath, however, is when we are messing with mortality itself, when we try to stop death entirely and when we create life on our own. Frankenstein dared both."
      },
      {
        "heading": "The Monster and the Name",
        "text": "Frankenstein is not the name of the monster; it is the name of his creator, Victor Frankenstein, Doctor Frankenstein. But are we supposed to make this leap? To recognize the creation in the image of its creator? Or should our recognition of the monster as Frankenstein set us up to see Frankenstein as the monster?\n\nAdam can be translated as red clay, which is no more a name than \"Monster.\" The Golem did not have a name either; it was animated by God's word. Such animation by a name is about the relationship of name with soul, or essence. To question the monster's name is to question the monster's soul. Vampires, mummies and Frankenstein's monster are all awakened corpses. Each asks its questions of body and lifeforce."
      },
      {
        "heading": "A Lineage of Promethean Creators",
        "text": "Frankenstein highlights a lineage of Promethean figures who challenge the natural order, from the necromancy of Dr. Faustus to the alchemical creation of a Golem, the metallurgical creation of Sosruquo and the pharmaceutical creation of Mr. Hyde. These creators refocus the revelations of science on a revolution against nature, if not the divine.\n\nThe story of Frankenstein is not just told and retold. The figure has updated and informed our stories of playing God, of creator and creation, of consciousness and body, which we continue to see in Ultron, Ex Machina, Data from Star Trek, or David from Ridley Scott's Prometheus. We are in the middle of a digital revolution that is seeing the convergence of AI, robotics, mind mapping and virtual reality, all of which have opened Pandora's box to the potential of a new Frankenstein."
      },
      {
        "heading": "We Are Already Post-Technology",
        "text": "We are already a post-technology species. Our brain grew when our stomach shrunk when we discovered cooking. No fire, no humans. Does the blind man end at his hand or his cane? How about his pacemaker? How about our smartphones? How reliant are our lives on power, internet, genetically modified foods, vaccines? And if we can recognize we are at least somewhat artificial, why should we resist something artificial becoming somewhat biological?\n\nThe question of whether or not we will replicate a human should be broken into three levels. First, will humans be able to learn all the scientific principles that make us human? The next question is whether we will be able to master and manipulate the physical principles that make us human. And then there is the much bigger question: is there something beyond the natural or scientific that makes us human? This is where it becomes a question about the soul and free will."
      }
    ],
    "overview": "Frankenstein is the modern Prometheus — the innovator who wrestles limitation itself, whose fire is not just the spark of life but the technologies that enable revolution against the status quo. Mary Shelley's creation asks the question that every subsequent story of playing God has inherited: is there something beyond the natural or scientific that makes us human? From the Golem to Ex Machina, the boundary Frankenstein crossed — creating life, defying mortality — remains the one that makes us all hold our breath."
  },
  "zombies": {
    "sections": [
      {
        "heading": "Haitian Origins and the Enslaved Soul",
        "text": "On one level, we can see a historical entry of the current zombie mythology through the enslavement of Africans in Haiti, where there is a local belief in zombies and from which our stories of zombies first emerged. In the Haitian Vodou tradition, the soul is believed to consist of two parts: the ti bon ange, which carries free will and personality, and the gros bon ange, which operates the body and its needs. A Vodou master steals the victim's soul, and that is how he controls the zombie. The zombie is the perfect slave.\n\nThis structure is not present in the mind-body dualism that dominated Western Christian consciousness. The ghost in the machine is the spirit that moves the body and the personality it brings. As long as the energy that animates the body and the free-thinking personality are not recognized as distinct, we cannot imagine an animated body without a mind. We see precursors trying to help us think this way in the form of the Golem of Prague, which is animated but does not have a soul. The zombie, emerging from the Haitian tradition, is capable of animation without the presence of personality or free will.\n\nThe Zombie emerged from overlapping shadows of slavery and the scientific reduction of humanity to bodies of dead matter with no free will. In the zombie we see the objectification of humans become spirit-killing enslavement that results in mass uprisings. And so they appear as a warning, if not a threat: objectify others at your own risk."
      },
      {
        "heading": "Dead Matter and the Nightmare of No Free Will",
        "text": "The zombie is a dead body with no free will and a conformist need to consume. For centuries, this is the description to which scientists have been reducing all of us: bodies of dead matter with no free will and a drive to consume to which we conform. From the birth of Greek philosophy through the Enlightenment, the direction of science was towards the recognition of matter as dead stuff with no free will, which led to the reduction of our bodies to dead matter that conforms to conditions. This belief system is represented in the zombie, which reveals its nightmarish nature.\n\nZombies reflect an image of humanity with no free will, that our bodies are made of dead matter but enslaved by their need to consume. That they have emerged from several sources to so poetically represent these concerns is a reflection of how wary we are of our own consumerism, conformity and belief in dead matter. In the last century, scientists have learned that our bodies, like the earth, are not just dead matter, that matter is not enslaved to causality."
      },
      {
        "heading": "Mirrors of Conformity",
        "text": "The zombie is used to show us where and how we conform. When we see them on the streets in work clothes or school uniforms, we are seeing the modes of life through which we can act like zombies. Are employees encouraged to think for themselves? Are students given agency to choose what they learn? Can we fall into routine through a relationship? Can we give our minds over to politics, or religion? Zombies show up to help us see where we are at risk of not thinking for ourselves. They teach us not to become puppets.\n\nMonsters are mirrors for our own shadow, the part of ourselves we repress. We repress how much we conform and how little we think. We do not want to admit we are conformists. We do not want to believe that consciousness is an illusion. So these fears take form, and the form they take is the zombie: a mirror for our own repressed conformity. The zombie is a mirror for our enslavement. A zombie wearing a tie or school uniform is a mirror for our own experience of life and school. In Revelations, it is said that when we see the face of the beast, we will rebel from it. When we see ourselves in the zombie, we cannot abide."
      },
      {
        "heading": "The Few Against the Many",
        "text": "In most zombie stories today, we follow a few brave survivors who face an overwhelming horde, which leads us to identify with that elite one percent at odds with the masses. But who are the zombie hordes? Are we just thinking about a literal zombie apocalypse, or do we project our fear of overpopulation onto populations we other, shadow and demonize? Upper classes have always associated themselves with a higher caste and often with the head or crown, and they have often seen the masses as the body. The zombie conflict is one of the head against the body, the many against the few.\n\nWhere vampires tend to be associated with a powerful elite, zombies represent the enslaved masses, which overthrow their world and its government, represented by the eating of brains, the part of us with control and consciousness. Where vampires lack a soul, zombies lack free will. And while the craving of vampires has a sexual energy, the zombie's is a brain-killing hunger."
      },
      {
        "heading": "The Demonization of Vodou",
        "text": "When most of us think of Vodou, we think of voodoo dolls and witch doctors, which leads to the demonization of a real religion and the people who practice it. A zombie is simultaneously a Haitian monster and victim of Vodou, and in both forms, it serves to scare us further away from even wanting to understand its practitioners or traditions. What becomes curious is how many Black American Christians might take interest in Vodou, an American-born Black tradition that draws from African roots, if it were not so demonized. And at the same time, how the demonization of this Black tradition serves to reinforce racism. In either case, keeping Vodou so demonized is a way to keep it subdued throughout the North American hemisphere.\n\nThe zombie is fundamentally about enslavement, which is, unfortunately, an ongoing global experience with a boundaryless history. Once the severe African experience of enslavement gave rise to a global awareness of the figure, it became infused by all the global examples of comparable figures. Recognizing the connection between enslavement and hypnosis, films like Get Out and Us present a vision of the world as puppeted and hypnotized by public narratives. The stories through which we are hypnotized result in shadows, which get locked away."
      }
    ],
    "overview": "The zombie emerged from overlapping shadows of Haitian slavery and the scientific reduction of humanity to bodies of dead matter with no free will. In the Vodou tradition, the zombie is the perfect slave — a body animated without personality, will, or agency. In the modern imagination, they mirror our own conformity, our enslavement to consumption, and the nightmare possibility that consciousness is an illusion. The zombie appears as a warning: objectify others at your own risk."
  },
  "bigfoot-and-yeti": {
    "sections": [
      {
        "heading": "Our Animal Selves in the Mirror",
        "text": "Humans used to look in the mirror and see something like Big Foot, and so when we see Big Foot, we see our ancient selves, our animal selves. Wherever the stories and legends emerge, whatever their specifics, where they come from in us is our never-ending relationship with our animal nature, sometimes repressed, sometimes engaged, and always in contrast to what we are now: civilized.\n\nWe evolved from animals, but we want to believe we are civilized. This tension plays out in the stories of wild hairy men and our belief, or denial, of their existence. Figures like Big Foot or the Yeti do not just recur around the world and across our mythic landscape; we also dream and make movies about them. They are in our mind. Not so long ago, we were more animal than human, we still have these tendencies, and in the same way we repress our animal instincts to be civilized, civilization denies the existence of Big Foot."
      },
      {
        "heading": "The World's Oldest Sidekick",
        "text": "The archetypal essence of Big Foot and comparable figures is at least as old as the world's first epic, Gilgamesh, whose best friend and sidekick fit the core description: a wild, hairy man who lived in the forest. In this ancient source, we do not just find a stagnant creature, we find a character arc. Enkidu, the best friend and sidekick, becomes civilized. This shows us what Big Foot is in our minds: a pre-civilized animal-person.\n\nGoing back to the first epic, we see wild hairy men in the forest, and the ancient source reveals an arc for this character: to become civilized. On one level, it is about defining civilized consciousness by contrasting it with our animal nature. On another level, it is used to teach us not to believe in anything abnormal or undiscovered. From the Tibetan stories of the Himalayan Yeti to the North American Big Foot, from the epics of India that describe monkey people to hunters in the Caucasus who learn not to track the hairy mountain dwellers, we find stories about these comparable figures around the world."
      },
      {
        "heading": "The Myth of Knowing Everything",
        "text": "Essential to the Big Foot myth is that it is a myth, that anyone who believes it is crazy. And beneath this myth is another myth: that we know everything, that we have been everywhere, that there is no unknown. Big Foot hunters are drawn to the unexplored in search of the unknown, to forests and mountains, where still today we find new species. The Okapi, for example, was only just discovered, and as far as Big Foot hunters are concerned, it is not half as intelligent or capable of evasion.\n\nOne of the core qualities of the recurring Big Foot myth is that, from Tibet to North America, it is the indigenous people and the people in the country who believe it is true, not the civilized people in normal society. When we ask if a mythic creature is real, the question is a bit misframed. It is real in our imagination, and the reason it is real in our imagination is because something inside has found a way to co-exist with something outside."
      },
      {
        "heading": "Denial, Projection, and the Inner Animal",
        "text": "Denial of Big Foot is fuelled by the repression of our inner animal. Fascination with Big Foot is a fascination with our inner animal. And love of Big Foot is a love of our inner animal, which aligns with our understanding of what it was to be one with Eden and God before the fall. This is where we get images of Big Foot as possessing the mystical powers of Adam, our pre-fallen ancestor.\n\nMythologically, we do not just see animals as less civilized, we also see them as more connected. And so, in the myth of Big Foot, we do not just see an uncivilized monster, we also see a connected being, who in some cases has mystical powers. These powers are like those of Adam before the fall, lost to civilization. The mythic demonization of our animal nature separates us from the consciousness our animal nature is capable of, which is its most mystical nature, its most telepathic nature, its most spiritually powerful nature.\n\nBy now, what Big Foot is in our minds is a mixture of bear stories and hairy humans, our own shadows and repressed animal consciousnesses, our relationship with the myth of knowing everything. Myths help us understand our reality. On a social level, the myth of Big Foot teaches us to be normal and doubt the unknown. On a psychological level, it teaches us to repress and distinguish ourselves from our animal nature. On a cosmological level, it teaches us that our role in existence is not to be embedded in creation, but to observe it consciously."
      }
    ],
    "overview": "Humans used to look in the mirror and see something like Bigfoot — and so when we encounter these stories, we encounter our own ancient, animal selves. The tension between our evolutionary past and our civilized present plays out in stories of wild hairy figures found around the world, from Gilgamesh's Enkidu to the Himalayan Yeti. The denial of Bigfoot is fueled by the repression of our inner animal, and the fascination is fueled by its return — the possibility that what we lost when we became civilized has not entirely disappeared."
  },
  "sea-monsters": {
    "sections": [
      {
        "heading": "Water, Waves, and the Way of Union",
        "text": "Life comes and goes with water, which behaves very differently than things. While two things cannot be in the same place at the same time, waves can, which is why quests for enlightenment and union are often quests for elixirs. When we see waves in the world we see the capacity for union.\n\nA drop of water is one with the ocean. A grain of sand is apart from the desert. Waves and water do not behave like things on land. To cross or dive under the waves is not just a journey into the unknown; it is into a world that can teach us the way of resonance, of likeness, of union. These are the ways of dream, metaphor and myth. The drop becomes the sea in mystical poetry about union. A single coned speaker plays a single wave, in which we hear every instrument. To be at sea, or underwater, is to be in another world."
      },
      {
        "heading": "Ambassadors of the Unknown",
        "text": "We fear the disasters that come from the ocean, and in an effort to make them predictable, we personify the ocean's will. Typically, a sailor already has some notion of sea monsters, which are ready projections when things go awry. These monsters are ambassadors of the unknown. For someone this might mean a demon, or it might mean a god. We want to believe in an other, which must come from an other place. Before the focus on aliens, we saw otherness in the sea.\n\nMyths are often born when the real world gives us a mirror for what might otherwise remain in our dreams. The more we want to believe in our dreams, the more likely we are to find them. When a clergyman sees a leviathan, it confirms the reality of the world they want to live in. The natural material world is always in co-creation with our mythic imagination. When some inner configuration finds its mirror in the outer world, when it finds a totem for its projection, that is when myths are born."
      },
      {
        "heading": "From Cetus to the Kraken",
        "text": "The earliest sea monster was the sea itself, all the storms and monsters it can bring. Very early in human history, we start to see this mythologized in the form of Cetus, the constellation of the great fish, which appears in the myths of Osiris, Perseus and Jonah. Leviathan has become synonymous with sea monster. It comes from the Bible and is comparable to the monsters slain by Zeus and Marduk when they built their world. These monsters were often conglomerate creatures, serpents, crocodiles, whales and squid, which represents their unbound nature. To defeat the sea monster is to forge order from chaos.\n\nArchiteuthis, the giant squid, is a myth-making machine, a mirror for our fears of the monstrous unknown. A good myth comes about when something literal and real triggers something imaginal and profound. When a pattern important to the psyche finds a mirror in the real world, myths happen, and still do. Scylla, the sea monster Homer describes in the Odyssey, is very likely the giant squid."
      },
      {
        "heading": "The Night Sea Journey",
        "text": "Our origins were nurtured by water of womb and sea. This is mythologized in the form of sunken cities and the ancient claim we evolved from fish. We see ocean life as older, and when we see water as vitality and origin, we see the Hebrew Tehom and the Egyptian Nu, oceans of chaos and creation. The ocean is a place of transformation. When a character is swallowed by the sea at sunset and returns with sunrise, they return reborn, as though from a womb.\n\nWhen a hero is swallowed by a monster into the sea, it is often associated with the sunset. The return, conversely, is seen in the sunrise. It is at the bottom of the ocean, in the middle of the night, that fire must be stolen. From Hercules to Pinocchio, the fire they encounter in the belly of the whale is what turns the night sea journey into an ascent towards day."
      }
    ],
    "overview": "Life comes and goes with water, which behaves differently than things on land — waves can occupy the same space, which is why quests for union are often quests for elixirs. Sea monsters are ambassadors of the unknown, personifications of the ocean's will born when the real world mirrors what lives in our dreams. From Scylla to the Kraken, from Cetus to Leviathan, the defeat of the sea monster is the forging of order from chaos — and the ocean remains the place where our oldest myths are most alive."
  },
  "mothman": {
    "sections": [
      {
        "heading": "Trauma, Memory, and Mythic Layering",
        "text": "Mothman is one of those myths based on a major traumatic event that involved 46 deaths and multiple reports of paranormal activity. This is the stuff that becomes hard for a culture to forget. And like most historical memories, it has become layered with mythic content.\n\nThere is something interesting about the way this particular story avoids the recognizable mythic trappings that lead others to dismissal. There is something about how secular it feels as an event, paranormal but secular. The Mothman is not easily identifiable as anything that has already been dismissed: aliens, demons, reptilian illuminati. The lack of identifiable detail enables people to project their own possibilities into the narrative, which range from quantum speculations about the timelessness of soul to mundane dismissals of statistical anomalies."
      },
      {
        "heading": "American Folklore as Melting Pot",
        "text": "American folklore is a melting pot of traditions brought over from Europe and Africa, sometimes even Asia, to a crucible that was already cooking with native narratives and ancient memories. This American imagination was then responsible for the transmutation of our democratic, capitalistic, scientific and technological revolutions into mythopoeic dreams.\n\nNative American folklore expresses a particularly shamanic quality in its recurring focus on the spirit world. That tricksters are more common than heroes is resonant with the prominence of shamanism over priesthoods and more orthodox religions. The Christian belief in the Fall leaves a back door for so-called primitive cultures to be seen by Christians as less fallen and more in touch with pre-scientific powers. At the same time, the Christian perception of the unconverted could lead to the conflation of shamans as witch doctors, if not devils. Both predispositions set up a projection of supernatural powers onto Native Americans."
      },
      {
        "heading": "The Curse of Chief Cornstalk",
        "text": "As the story goes, Chief Colesqua, also known as Chief Cornstalk of the Shawnee nation, pursued peace with Europeans until he and his son were shot dead. The story is that, as he died, he cursed his assailants and their entire culture. His remains were then moved, multiple times, to Point Pleasant, which is believed to have been haunted by the Mothman. The curse of a dying foe is an old motif that is taken very seriously, for the same reason prophecies depend on living entrails. The notion is that something between life and death can communicate truth, if not power, from one to another.\n\nThe curse would not be so scary if the so-called White Man did not actually know that what they had done was wrong, that a curse or retribution was right. And so, when something really happened, it would have been hard for anyone not to see a connection."
      },
      {
        "heading": "Cold War Paranoia and Winged Beings",
        "text": "We see through our lens that is ourselves. Paranoia leads to projection, and the 1960s were a time of paranoia. The Nazi use of state propaganda and the American use of a nuclear bomb were not yet distant memories. Cold War espionage was very real and intense. New scientific breakthroughs were only beginning to be understood. As the rise of secularism left a hole in the existential spirits of populations, they transferred their projections from religious figures, like angels and demons, to the more scientifically oriented aliens and paranormal research.\n\nBirds represent an ability to traverse multiple domains, especially water birds that can dive below waves as well as fly above them. This has led to their association with the soul, which can hopefully travel between worlds. The Mothman, similarly, is seen as a being that straddles realities. The moth, like a butterfly, has transformed from a more primitive form. This relates to the belief of some that Mothmen are what we see when we look at our future incarnations. Interesting that it is not a butterfly but a moth, whose association with night can be conflated with an association with death. Both are symbolic of resurrection, but where the butterfly resurrects into day, the moth remains in night."
      },
      {
        "heading": "Where Myths Are Born",
        "text": "The weird stuff in myth is always projected onto locations beyond reach or rarely visited. Myths that spring up around mountains, seas, bottomless lakes and other unknown zones are typically more laden with the paranormal. In the same way it is easier to believe in ghosts when you are alone in a dark unknown place, darker, less known and less populated areas tend to be more able to sustain paranormal stories. The Appalachians seem to be an epicenter of urban legends and folklore in the United States.\n\nMyths are the biggest stories most deeply engaged by the most people for the longest time. Myths are vessels made for wisdom, vehicles made for its carriage across distances and across time. Myths, like dreams, are the translation of mental activity into sensory experience. Too many people want to flatten myths into allegories, as though they can be reduced to a single inspiration. Myths emerge where patterns converge. In myth, something's pattern drags in the meaning of everything else with that pattern. And through pattern, myth mixes the human with nature, with animals, with the heavens."
      }
    ],
    "overview": "Mothman is one of those myths that avoids the recognizable trappings leading others to dismissal — not quite alien, not quite demon, not quite anything already categorized. Born from a real traumatic event involving forty-six deaths and layered with Cold War paranoia, Native American curses, and Appalachian folklore, it exists in a space where the secular and the paranormal refuse to separate. The lack of identifiable detail is precisely what makes the myth so durable — it lets everyone project their own possibilities into the narrative."
  },
  "attila": {
    "sections": [
      {
        "heading": "The Scourge of God and Shadow of Empire",
        "text": "Attila was the key figure in bringing down the Roman Empire, and he is a crucial nemesis in the epic cycle of Nibelung, which climaxes around the death of Attila and the loss of treasure to the Rhine. The longer and harder you hold something down, the more violently it will surface. This happened to the Romans in the form of Hun and Visigoth raids. Both were symptomatic of the same oppression, but where the Visigoths seem more like rebels seeking rights, the Huns seem more like terrorists seeking revenge.\n\nGiven all the shooters and terrorists in our world, this is something we should all be thinking about. Oppression leads to terrorism and rebellion. The question is whether we should be focused on Attila as the destroyer of civilization or as its shadow incarnate."
      },
      {
        "heading": "The Mounted Archer and the Fear of the Unknown",
        "text": "The real advantage of the Huns was their mounted archer, a motif that goes back to the centaur, which was likely inspired by the Huns' Indo-European ancestors. If the stories are to be believed, they were so fluid on their horses, it might as well have been part of their body. Their swift maneuvering also reduced the efficacy of opposing archers. Have you ever seen a sports match where one team is just faster than the others? That was the Huns, running plays and running circles around their enemies.\n\nWe always fear what we do not understand, especially when it can sneak up on you so quickly and wants you dead. Not only were the Huns somewhat foreign and beyond understanding; their mobility on horses and their prowess as archers must have had everyone everywhere on edge. This was a people that left wakes of carnage and intentionally spread fear, a people that cut themselves to mourn and faced battle fearlessly. Because anything someone cannot do or understand becomes quickly associated with magic, the Hun arrows of mounted archers, which could sneak up and kill you at a distance, would have been seen as almost magical."
      },
      {
        "heading": "Lost Graves, Lost Swords, and the Fantasy of Return",
        "text": "Arthur and Attila, great leaders of their people, were lost upon death. According to the Arthurian tradition, he was taken to the isle of apples, Avalon, from which the King will return. On one level, the lack of a grave or body permits the fantasy of return or resurrection among their followers. Great kings are typically buried with great treasure, for which reason the lost grave of a king becomes a myth of lost treasure.\n\nWhether or not Attila is buried in a river, it is especially interesting that his sword would be, as the return of a king's magical sword to water is an ancient Indo-European motif seen in Arthur and Batraz. This is why we find swords in rivers. The Sword of Mars is not unlike the sword of Siegfried, Charlemagne or Arthur, all of which represented great might. It was given to Attila by a shepherd who found it in the grass. Symbolically, this may be a memory of the shepherd as the ancient patron of the pastoral Indo-Europeans and a recognition of the sword as a harvester of souls."
      },
      {
        "heading": "The Devouring Father and Mythic Memory",
        "text": "Attila, Atli, Etzel: these are likely just the translations of his name, \"little father,\" into different languages and dialects. His name shares a prefix with Atlas, an Indo-European war-leader of the Titans. Insofar as the Romans sided with Olympus, you might say that the Titans, and all the raw drives they represented, finally won.\n\nThe scene of Attila eating his children in the Nibelung, intentional or not, aligns him with the mythic figure of the devouring father, most famously Cronus, who ate his children to resist their power and retain his own. The devouring of the son is the ultimate expression of the patriarchal tyrant that hoards power. In the Eddas, Atli's death is caused by his wife, which is true to history; but motifs that can be identified with older myths are introduced. We first think of Medea, a witch of the Caucasus who, like Gudrun, killed the children she bore to her husband. And like Gudrun, who sent the hair of a wolf, Medea's witchcraft, learned from Hekate, was associated with the wolf. This is an old Indo-European association of the mother and dog that can be seen in Satanaya as well as the wolf who suckled Romulus and Remus."
      }
    ],
    "overview": "Attila was the shadow of empire incarnate — the figure who brought down Rome, representing what happens when oppression is held down long enough to surface as terror. His story converges with the Nibelung cycle, lost treasure in a river, and the ancient Indo-European motif of a king's sword returning to water. Whether we focus on Attila as the destroyer of civilization or as its shadow is a question that remains urgent in a world still producing the conditions that create such figures."
  },
  "tunguska": {
    "sections": [
      {
        "heading": "The Mystery That Won't Settle",
        "text": "Luckily, the meteor did not explode over an urban area; it was remote. That having been said, it was also the case that locals were so affected and superstitious about it that talking about it was not encouraged. The level of consensus required to really move on has not been reached, 110 years later. And we have not changed. We are still drawn to the unexplained with every possibility we want to explore.\n\nTruth be told, the lack of a crater can be explained by a meteor's explosion in the atmosphere. It is even possible that an exploding meteorite could have caused such destruction. The real mystery is the strength of its shockwave, which should not have been generated by an exploding meteor, even a big one."
      },
      {
        "heading": "Tesla, UFOs, and the Open Bet",
        "text": "The story brings in Tesla, a mythic figure on his own. The theory is that Tunguska was produced by the death ray he claims to have been working on at the time. According to his account, he accelerated particles from the ionosphere with the help of a Tesla coil. This is a guy who invented the remote control and what seems like half of the world's technology while claiming to be in conversation with Martians. I find I never know what to believe when it comes to this guy, but I do know that he would have had a hard time creating the vacuum tube he should have needed to accelerate particles from the ionosphere. Then again, who am I to question Tesla?\n\nIf you cannot explain something completely, all bets are off. And when you are talking about a ball of fire from the sky, UFOs are going to be an obvious explanation. Some might point to the discovery of meteorite shards, but if our fighter jets use camouflage and drop flares, why would we not think UFOs drop meteorites when they have to self-destruct to preserve the prime directive? Most scientific reductions are worlds away from the scientifically possible."
      },
      {
        "heading": "The Realest Fear",
        "text": "There have been many recorded examples of meteorites that explode when hitting thicker layers of the atmosphere, which is the story of what happened at Tunguska. There are also accounts throughout history of fireballs and strange phenomena in the sky.\n\nThe realest fear is that this is what it looks like when a very big meteor luckily explodes just before impact. If a meteor this big had hit the earth, the damage would have been overwhelming. And we all know extinction events like this can occur."
      }
    ],
    "overview": "Tunguska is the mystery that will not settle. Over a century later, the level of consensus required to move on has not been reached — and the event carries our realest fear, that this is what it looks like when a very large meteor barely misses devastating impact. The absence of a crater, the strength of the shockwave, and the remoteness of the site have left just enough unexplained to sustain every theory from Tesla's death ray to UFOs, because when something cannot be completely explained, all bets are off."
  }
}