[
  {
    "id": "eranos",
    "name": "Eranos",
    "subtitle": "Annual Conferences on Mythology, Religion & Psychology",
    "location": "Ascona, Switzerland",
    "lat": 46.1574,
    "lng": 8.7731,
    "founded": "1933",
    "founder": "Olga Froebe-Kapteyn",
    "color": "#c9a961",
    "description": "Eranos was born in 1933 when Olga Froebe-Kapteyn opened her estate on the shores of Lago Maggiore for an annual gathering of scholars working at the frontiers of mythology, religion, psychology, and philosophy. The name, from the Greek eranos — a banquet to which each guest brings a dish — captured the spirit perfectly: each thinker brought their own discipline, and the feast was interdisciplinary.\n\nOver the following decades the conferences drew an extraordinary constellation of minds. C.G. Jung was a founding presence; Mircea Eliade brought the history of religions; Joseph Campbell attended and later carried the flame to America; Heinrich Zimmer contributed Indology; Henry Corbin opened the world of Islamic mystical philosophy; Gershom Scholem decoded Jewish mysticism; and James Hillman reimagined depth psychology as archetypal psychology.\n\nThe intellectual harvest of Eranos became inseparable from the Bollingen Series, the publishing project funded by Paul Mellon's Bollingen Foundation. Many of the most important works of 20th-century mythological scholarship — Jung's Collected Works, Campbell's Hero with a Thousand Faces, Eliade's Cosmos and History, Zimmer's Philosophies of India — were either born at Eranos or shaped by its conversations, then published under the Bollingen imprint by Pantheon and Princeton University Press.",
    "keyFigures": [
      { "name": "C.G. Jung", "role": "Analytical Psychology, founding participant" },
      { "name": "Mircea Eliade", "role": "History of Religions" },
      { "name": "Joseph Campbell", "role": "Comparative Mythology" },
      { "name": "Heinrich Zimmer", "role": "Indology & Indian Art" },
      { "name": "Karl Kerenyi", "role": "Greek Mythology" },
      { "name": "Erich Neumann", "role": "Depth Psychology" },
      { "name": "James Hillman", "role": "Archetypal Psychology" },
      { "name": "Henry Corbin", "role": "Islamic Mystical Philosophy" },
      { "name": "Gershom Scholem", "role": "Jewish Mysticism & Kabbalah" },
      { "name": "Adolf Portmann", "role": "Zoology & Natural Philosophy" },
      { "name": "D.T. Suzuki", "role": "Zen Buddhism" },
      { "name": "Paul Tillich", "role": "Theology & Philosophy of Religion" }
    ],
    "connectedCollections": ["bollingen"],
    "streetView": { "heading": 200, "pitch": 5, "fov": 90 }
  },
  {
    "id": "milesian-school",
    "name": "The Milesian School",
    "subtitle": "Birthplace of Western Philosophy & Natural Science",
    "location": "Miletus, Turkey",
    "lat": 37.5308,
    "lng": 27.2783,
    "founded": "~6th century BCE",
    "founder": "Thales of Miletus",
    "color": "#8b9dc3",
    "description": "In the 6th century BCE, something unprecedented happened on the coast of Ionia. The thinkers of Miletus — a prosperous Greek trading city on what is now the Turkish Aegean — began asking a question that would change human thought forever: what is the world made of, and can we explain it without recourse to the gods?\n\nThis was the revolution from mythos to logos — from mythological explanation to rational inquiry. Thales proposed that water was the fundamental substance (arche) underlying all things. His student Anaximander went further, arguing that the first principle was the apeiron, the boundless or infinite — an abstraction beyond any visible element. Anaximenes refined this to air, proposing that rarefaction and condensation could transform one substance into many.\n\nNearby, in Ephesus some 50 kilometers to the north, Heraclitus developed his doctrine of perpetual flux and the Logos — the rational principle governing change. And Leucippus, associated with both Miletus and Abdera, laid the foundations of atomic theory, proposing that all matter consists of indivisible particles moving through void.\n\nTogether, these Ionian thinkers inaugurated the Western philosophical and scientific traditions. They were the first to seek naturalistic explanations for phenomena that every previous culture had attributed to divine will.",
    "keyFigures": [
      { "name": "Thales of Miletus", "role": "First philosopher — water as arche" },
      { "name": "Anaximander", "role": "The apeiron (boundless/infinite)" },
      { "name": "Anaximenes", "role": "Air as arche" },
      { "name": "Leucippus", "role": "Atomic theory (Miletus/Abdera)" },
      { "name": "Heraclitus", "role": "Flux & the Logos (based in Ephesus, ~50km north)" }
    ],
    "connectedCollections": [],
    "streetView": { "heading": 180, "pitch": 0, "fov": 90 }
  },
  {
    "id": "esalen",
    "name": "Esalen Institute",
    "subtitle": "The Human Potential Movement",
    "location": "Big Sur, California",
    "lat": 36.1310,
    "lng": -121.6044,
    "founded": "1962",
    "founder": "Michael Murphy & Dick Price",
    "color": "#c47a5a",
    "description": "Perched on the cliffs of Big Sur where the Santa Lucia Mountains plunge into the Pacific, Esalen Institute became the epicenter of the human potential movement when Michael Murphy and Dick Price founded it in 1962. Built around natural hot springs long sacred to the Esselen people, the institute offered a radical premise: that human beings possess vast untapped capacities for growth, creativity, and awareness.\n\nEsalen became the meeting ground for East and West, science and spirit, body and mind. Abraham Maslow developed his hierarchy of needs and ideas about self-actualization there. Fritz Perls brought Gestalt therapy. Alan Watts transmitted Zen and Taoism to Western audiences. Aldous Huxley explored the perennial philosophy and the doors of perception. Joseph Campbell lectured on myth. Stanislav Grof pioneered transpersonal psychology. Gregory Bateson brought systems thinking and cybernetics. Ida Rolf developed structural integration.\n\nThrough the 1960s and beyond, Esalen hosted an extraordinary stream of thinkers, healers, and teachers who collectively redefined the boundaries of psychology, spirituality, and somatic practice in the West.",
    "keyFigures": [
      { "name": "Abraham Maslow", "role": "Humanistic Psychology, self-actualization" },
      { "name": "Fritz Perls", "role": "Gestalt Therapy" },
      { "name": "Aldous Huxley", "role": "Perennial Philosophy, psychedelics" },
      { "name": "Alan Watts", "role": "Zen Buddhism, Eastern Philosophy" },
      { "name": "Joseph Campbell", "role": "Comparative Mythology" },
      { "name": "Stanislav Grof", "role": "Transpersonal Psychology" },
      { "name": "Gregory Bateson", "role": "Systems Theory, Cybernetics" },
      { "name": "Ida Rolf", "role": "Structural Integration (Rolfing)" },
      { "name": "George Leonard", "role": "Human Potential, Aikido" },
      { "name": "Gabrielle Roth", "role": "5Rhythms, Ecstatic Dance" },
      { "name": "Jack Kornfield", "role": "Vipassana, Western Buddhism" },
      { "name": "Ram Dass", "role": "Spiritual teacher (Be Here Now)" },
      { "name": "Terence McKenna", "role": "Ethnobotany, Psychedelic Philosophy" },
      { "name": "Joan Halifax", "role": "Zen Buddhism, Anthropology" }
    ],
    "connectedCollections": [],
    "streetView": { "heading": 270, "pitch": 5, "fov": 90 }
  },
  {
    "id": "theosophists-ojai",
    "name": "Theosophists at Ojai",
    "subtitle": "Theosophy, Krishnamurti & the Krotona Colony",
    "location": "Ojai, California",
    "lat": 34.4480,
    "lng": -119.2429,
    "founded": "~1920s",
    "founder": "Theosophical Society (Krotona Colony, 1926)",
    "color": "#a89060",
    "description": "The Ojai Valley in Southern California became one of the great nodes of esoteric thought in the 20th century, drawing together Theosophists, Krishnamurti's radical philosophical inquiry, and a continuous stream of seekers and teachers.\n\nThe story begins with Theosophy itself — the movement founded in 1875 by Helena Blavatsky and Henry Steel Olcott in New York, which synthesized Eastern and Western esoteric traditions into a framework of spiritual evolution, karma, and hidden masters. Annie Besant and Charles Leadbeater carried Theosophy forward, and it was they who in 1909 identified the young Jiddu Krishnamurti as the coming World Teacher.\n\nKrishnamurti settled in Ojai in 1922, and it was there that he underwent a profound spiritual experience. Though he would eventually dissolve the Order of the Star and reject all organized spiritual authority — declaring 'Truth is a pathless land' — he continued to live and teach in Ojai for the rest of his life, drawing visitors from around the world.\n\nThe Krotona Institute of Theosophy relocated to Ojai in 1926, establishing a colony that remains active today in the area now associated with the Topa Institute. Rudolf Steiner had earlier split from the Theosophical Society to found Anthroposophy, but the Ojai community maintained the original Theosophical vision. Manly P. Hall, author of The Secret Teachings of All Ages, and Alice Bailey, who developed the Arcane School, were also shaped by the Theosophical current that ran through Southern California.",
    "keyFigures": [
      { "name": "Helena Blavatsky", "role": "Founder of Theosophy (1875)" },
      { "name": "Annie Besant", "role": "President of the Theosophical Society" },
      { "name": "Charles Leadbeater", "role": "Clairvoyant, Theosophical author" },
      { "name": "Jiddu Krishnamurti", "role": "Philosopher, rejected World Teacher role" },
      { "name": "Rudolf Steiner", "role": "Founded Anthroposophy (split from Theosophy)" },
      { "name": "Henry Steel Olcott", "role": "Co-founder of Theosophical Society" },
      { "name": "Manly P. Hall", "role": "Author, The Secret Teachings of All Ages" },
      { "name": "Alice Bailey", "role": "Arcane School, esoteric philosophy" }
    ],
    "connectedCollections": [],
    "streetView": { "heading": 0, "pitch": 5, "fov": 90 }
  }
]
