{
  "id": "olympian",
  "name": "The Olympians",
  "description": "The twelve principal deities of the Greek pantheon, seated on Mount Olympus. Seven are linked to the classical planets — those entries carry the full planetary correspondences from the Chronosphaera system. The others await their turn.",
  "deities": [
    {
      "id": "zeus",
      "name": "Zeus",
      "title": "King of the Gods",
      "group": "olympian",
      "planet": "Jupiter",
      "description": "Chief Olympian, god of the sky and thunder. Son of Cronus and Rhea, he was hidden in a cave on Crete as an infant while his father swallowed a stone in his place. When he came of age he forced Cronus to disgorge his siblings, then led the Olympians in a ten-year war against the Titans — the Titanomachy — and won. He divided the cosmos among his brothers: Poseidon took the sea, Hades the underworld, and Zeus the sky. He wields the thunderbolt forged by the Cyclopes and is symbolized by the eagle. On the Parthenon's east pediment, his birth of Athena from his own head crowned the temple's sculptural program. His affairs with mortals and goddesses produced much of Greek mythology: Heracles, Perseus, Helen, Dionysus, the Muses. Every oath sworn in Greece invoked his name.",
      "animals": ["Eagle", "Bull"],
      "colors": ["Royal purple", "Sky blue"],
      "metals": ["Tin"],
      "vegetation": ["Oak"],
      "weapons": ["Thunderbolt"],
      "consorts": ["Hera (Juno)"],
      "birthCreation": "Son of Cronus and Rhea. Rhea hid him in a cave on Crete and gave Cronus a stone wrapped in swaddling clothes to swallow instead. Raised by the nymph Amalthea and the Kouretes, who clashed their shields to cover his cries.",
      "dayTime": "Thursday (Jovis dies)",
      "holidays": "Ludi Romani; Olympic Games held in his honor at Olympia every four years"
    },
    {
      "id": "hera",
      "name": "Hera",
      "title": "Queen of the Gods",
      "group": "olympian",
      "description": "Wife and sister of Zeus, protector of marriage, women, and childbirth. She was swallowed by Cronus at birth and freed when Zeus overthrew the Titans. Her marriage to Zeus was the foundational union of Olympus — and its most turbulent. She pursued his lovers and their children with relentless fury: she drove Heracles mad, persecuted Io across continents, and delayed the birth of Apollo and Artemis. Yet she also represented the sanctity of the household and the continuity of the polis. On the Parthenon's east frieze she sits among the assembled Olympians with a dignity the myths rarely allowed her. Her great sanctuaries were at Argos and Samos, where her cult may predate Zeus's own.",
      "animals": ["Peacock", "Cow", "Cuckoo"],
      "weapons": ["Royal scepter", "Diadem", "Pomegranate"],
      "consorts": ["Zeus"],
      "birthCreation": "Daughter of Cronus and Rhea, swallowed at birth and later freed when Zeus forced Cronus to disgorge his children."
    },
    {
      "id": "poseidon",
      "name": "Poseidon",
      "title": "God of the Sea",
      "group": "olympian",
      "description": "Earth-shaker, lord of the sea, horses, and earthquakes. When the three brothers divided the cosmos after defeating the Titans, Poseidon drew the ocean. He competed with Athena for patronage of Athens — he struck the Acropolis rock with his trident and produced a salt spring; she planted an olive tree. The citizens chose the tree. The west pediment of the Parthenon immortalized this contest. Poseidon's rage shaped the Odyssey: he hounded Odysseus across the Mediterranean for blinding his son Polyphemus. He created the horse by striking the earth, fathered the winged horse Pegasus through Medusa, and built the walls of Troy — then destroyed them when the king refused to pay.",
      "animals": ["Horse", "Dolphin", "Bull"],
      "weapons": ["Trident"],
      "consorts": ["Amphitrite"],
      "birthCreation": "Son of Cronus and Rhea, swallowed by his father and freed by Zeus."
    },
    {
      "id": "athena",
      "name": "Athena",
      "title": "Goddess of Wisdom and Strategic War",
      "group": "olympian",
      "description": "Virgin goddess of wisdom, craft, and strategic warfare — the mind at war rather than the body. She sprang fully armed from the head of Zeus after he swallowed her pregnant mother Metis, goddess of cunning counsel. Athens was her city: she won it by gifting the olive tree, and the Parthenon was her temple. Phidias's chryselephantine statue stood twelve meters tall inside, gold and ivory, holding Nike in one hand. She guided Odysseus home, helped Perseus kill Medusa, and taught humanity weaving, shipbuilding, and the bridle for horses. Where Ares represented the chaos of battle, Athena represented the discipline that wins it. Her owl sees in the dark. Her shield bore the head of Medusa — the Aegis — and whoever saw it turned to stone.",
      "animals": ["Owl", "Serpent"],
      "vegetation": ["Olive tree"],
      "weapons": ["Aegis (shield with Medusa's head)", "Spear"],
      "birthCreation": "Sprang fully armed from the head of Zeus after he swallowed her mother Metis, goddess of cunning counsel."
    },
    {
      "id": "apollo",
      "name": "Apollo",
      "title": "God of Light, Music, and Prophecy",
      "group": "olympian",
      "planet": "Sun",
      "description": "God of sunlight, music, poetry, prophecy, plague, and healing — the most Greek of the gods, embodying the ideal of kalokagathia: beauty and excellence as one thing. Son of Zeus and the Titaness Leto, he was born on the floating island of Delos because Hera forbade any land from giving Leto shelter. He killed the Python at Delphi and claimed its oracle, which became the most authoritative voice in the ancient world. The Pythia spoke his prophecies from volcanic vapors. He drove the sun's chariot in later tradition, absorbing the role of the Titan Helios. He invented the lyre, led the Muses, and flayed the satyr Marsyas alive for challenging him in music. His loves were often tragic: Daphne turned into a laurel tree to escape him; Hyacinthus was killed by a discus. Every sun deity across cultures connects to gold — 'sweat of the sun' to the Inca, symbol of divine radiance in Egypt, Greece, Rome.",
      "animals": ["Raven", "Swan", "Dolphin"],
      "colors": ["Gold"],
      "metals": ["Gold"],
      "vegetation": ["Laurel", "Hyacinth"],
      "weapons": ["Silver bow", "Lyre"],
      "consorts": ["Daphne (fled)", "Coronis", "Hyacinthus"],
      "birthCreation": "Son of Zeus and the Titaness Leto, born on the floating island of Delos. Twin brother of Artemis. His mother wandered the earth finding no refuge until Delos, which was not rooted to the seabed, agreed to receive her.",
      "dayTime": "Sunday — associated with Helios and the solar chariot",
      "holidays": "Pythian Games at Delphi; Thargelia"
    },
    {
      "id": "artemis",
      "name": "Artemis",
      "title": "Goddess of the Hunt and the Moon",
      "group": "olympian",
      "planet": "Moon",
      "description": "Virgin huntress, protector of wild places, young animals, and women in childbirth. Twin sister of Apollo, born moments before him on Delos, and she immediately helped deliver her brother — becoming a midwife goddess at birth. She roamed the forests with a band of nymphs who had sworn virginity; Actaeon stumbled upon her bathing and she turned him into a stag, and his own hounds tore him apart. She is Selene's Olympian counterpart — the moon as hunter rather than lover. Her great temple at Ephesus was one of the Seven Wonders of the Ancient World. Silver is the moon's metal across every tradition: mirror of the sun's light in darkness. Her sanctuaries on the slopes of the Acropolis predated the Parthenon itself. She asked Zeus for eternal virginity at age three — the youngest goddess to know exactly what she wanted.",
      "animals": ["Deer", "Bear", "Hunting dogs"],
      "colors": ["Silver", "White"],
      "metals": ["Silver"],
      "vegetation": ["Cypress", "Amaranth"],
      "weapons": ["Silver bow", "Arrows", "Hunting spears"],
      "consorts": [],
      "birthCreation": "Daughter of Zeus and Leto, twin sister of Apollo. Born on Delos, she immediately helped deliver her brother.",
      "dayTime": "Monday — associated with Selene and the lunar cycle",
      "holidays": "Brauronia; Festival of Artemis at Ephesus"
    },
    {
      "id": "ares",
      "name": "Ares",
      "title": "God of War",
      "group": "olympian",
      "planet": "Mars",
      "description": "The fiery god of war, courage, and slaughter. Son of Zeus and Hera, he is raw violence in battle — not the strategist (that is Athena) but the brutal force, the blood-rage, the screaming charge. He fathered Phobos (Fear) and Deimos (Panic), who rode with him into battle. Even Zeus disliked him — 'most hateful of all gods,' Homer has Zeus say. The other Olympians avoided him. But Aphrodite did not: their affair, discovered by her husband Hephaestus who trapped them in a golden net for all the gods to see, is one of the great comic scenes of mythology. His color is red. His metal is iron — endurance, resilience, the transformative power of forging weapons and armor. His rocky outcrop below the Acropolis became the Areopagus, the court of murder trials. Athens acknowledged war's necessity but preferred Athena's version of it.",
      "animals": ["Wolf", "Vulture", "Serpent"],
      "colors": ["Red"],
      "metals": ["Iron"],
      "weapons": ["Spear", "Shield", "War chariot"],
      "consorts": ["Aphrodite (Venus)"],
      "birthCreation": "Son of Zeus and Hera. In some accounts, conceived by Hera alone through a magical flower — mirroring Hephaestus's birth.",
      "dayTime": "Tuesday (Martis dies)",
      "holidays": "Armilustrium (October weapon purification); Quinquatria"
    },
    {
      "id": "aphrodite",
      "name": "Aphrodite",
      "title": "Goddess of Love and Beauty",
      "group": "olympian",
      "planet": "Venus",
      "description": "Goddess of love, beauty, desire, and fertility — born from sea foam at Cyprus after Cronus castrated Uranus and his blood fell into the water. She emerged fully formed, riding a scallop shell to shore, and the grass grew beneath her feet. She embodies attraction, charm, and the creative spark of love. Married to Hephaestus, the lame smith, she loved Ares, the god of war — the most beautiful with the most violent, the most delicate with the most brutal. Her girdle (the cestus) made whoever wore it irresistible. She won the Judgment of Paris by promising Helen of Troy, setting in motion the Trojan War. As the planet Venus she appears twice: as the morning star she heralds dawn and brings renewal; as the evening star she brings desire, seduction, and the passionate nature of love. Copper is her sacred metal across every tradition — sacred to beauty, vitality, and divine feminine power. Her worship spans Inanna, Ishtar, Astarte, and Freya.",
      "animals": ["Dolphins", "Swans", "Doves"],
      "colors": ["Red", "Sea-green"],
      "metals": ["Copper", "Gold"],
      "vegetation": ["Myrtle", "Roses", "Apples", "Pomegranates"],
      "weapons": ["Mirror", "Apple of Discord", "Girdle (cestus)"],
      "consorts": ["Hephaestus (husband)", "Ares (lover)", "Anchises (mortal — father of Aeneas)", "Adonis"],
      "birthCreation": "Born from the foam of the sea after Cronus castrated Uranus and his severed parts fell into the water off Cyprus. She emerged on a shell and the Horae dressed her.",
      "dayTime": "Friday (Veneris dies) — Venus rules both dawn and dusk as morning and evening star",
      "holidays": "Aphrodisia festival; Veneralia (April 1)"
    },
    {
      "id": "hephaestus",
      "name": "Hephaestus",
      "title": "God of the Forge",
      "group": "olympian",
      "description": "Divine craftsman, god of fire, metalworking, and sculpture. The only ugly god on Olympus, and the only one who worked. Lame from birth — or from being thrown from Olympus by Zeus (or Hera, depending on the telling) — he fell for a full day and landed on Lemnos, where the sea-nymphs Thetis and Eurynome raised him. In that undersea cave he learned his craft. He built the palaces of Olympus, forged Zeus's thunderbolts, Athena's aegis, Achilles' armor, Hermes' winged sandals, and the golden net that caught Aphrodite and Ares in bed. His forge was inside Mount Etna (or Lemnos), where the Cyclopes worked his bellows. Married to Aphrodite — the most beautiful goddess given to the ugliest god — as Zeus's reward for freeing Hera from a golden throne Hephaestus had built as a trap. He made beauty from fire and metal. His temple overlooking the Athenian Agora is one of the best-preserved Greek temples in the world.",
      "animals": ["Donkey", "Crane"],
      "metals": ["All metals — iron, bronze, gold, silver, adamantine"],
      "weapons": ["Hammer", "Tongs", "Anvil"],
      "consorts": ["Aphrodite"],
      "birthCreation": "Son of Hera alone (or of Zeus and Hera). Thrown from Olympus as an infant, he fell for an entire day and landed on Lemnos. Raised by Thetis and Eurynome in an undersea cave."
    },
    {
      "id": "hermes",
      "name": "Hermes",
      "title": "Messenger of the Gods",
      "group": "olympian",
      "planet": "Mercury",
      "description": "Fleet-footed messenger, god of travel, commerce, thieves, and the boundary between worlds. Son of Zeus and the nymph Maia, he was born at dawn in a cave on Mount Cyllene and by noon had invented the lyre from a tortoise shell and stolen Apollo's sacred cattle. When caught, he charmed his way out of punishment. Zeus made him the gods' messenger — the only Olympian who moved freely between Olympus, the mortal world, and the underworld. As psychopomp he guided the dead to Hades. His herms — stone pillars with his head and phallus — guarded every Athenian crossroad and doorway. Every Mercury figure across cultures is a bridge: between gods and mortals, between conscious and unconscious, between living and dead, between written and spoken. The trickster quality — quick-witted, shape-shifting, boundary-crossing — connects Hermes to Odin, Tezcatlipoca, and Thoth. The liquid metal mercury (quicksilver) symbolizes his nature: fluid, transformative, impossible to hold.",
      "animals": ["Hare", "Tortoise", "Rooster"],
      "colors": ["Yellow"],
      "metals": ["Mercury (Quicksilver)"],
      "weapons": ["Caduceus", "Winged Sandals", "Winged Helmet"],
      "consorts": ["Aphrodite (together they produced Hermaphroditus)", "Penelope (in some traditions)"],
      "birthCreation": "Son of Zeus and the nymph Maia. Born at dawn in a cave on Mount Cyllene; by noon he had invented the lyre and stolen Apollo's cattle.",
      "dayTime": "Wednesday (Mercredi — Woden's day in Germanic, connecting Hermes to Odin)",
      "holidays": "Hermaea — athletic contests in his honor"
    },
    {
      "id": "demeter",
      "name": "Demeter",
      "title": "Goddess of the Harvest",
      "group": "olympian",
      "description": "Grain mother, goddess of agriculture, fertility, and the cycle of life and death. When Hades abducted her daughter Persephone and dragged her to the underworld, Demeter's grief stopped all growth on earth. She wandered disguised as an old woman and came to Eleusis, where she revealed herself and demanded a temple. Zeus was forced to intervene: Persephone would return each spring but spend the winter months below. This myth — the mother's loss, the daughter's descent, the annual return — became the core of the Eleusinian Mysteries, the most sacred rites in the ancient world, celebrated for nearly two thousand years. Initiates were promised something about death that left them unafraid. No one who underwent the Mysteries ever revealed what happened inside. She appears among the seated gods on the Parthenon's east frieze, embodying the earth's abundance and the price of its withdrawal.",
      "animals": ["Serpent", "Pig", "Gecko"],
      "vegetation": ["Wheat", "Barley", "Poppy", "Mint"],
      "weapons": ["Torch (she searched for Persephone by torchlight)", "Sheaf of grain", "Scepter"],
      "consorts": ["Zeus", "Poseidon", "Iasion"],
      "birthCreation": "Daughter of Cronus and Rhea. Swallowed at birth, freed when Zeus forced Cronus to disgorge.",
      "holidays": "Eleusinian Mysteries; Thesmophoria (women-only fertility rite)"
    },
    {
      "id": "dionysus",
      "name": "Dionysus",
      "title": "God of Wine, Ecstasy, and Theater",
      "group": "olympian",
      "description": "God of wine, ritual madness, fertility, and theater — the twice-born, the liberator, the god who dissolves the boundary between self and other. Son of Zeus and the mortal Semele, who was tricked by Hera into asking Zeus to appear in his true form. He did, and Semele burned. Zeus sewed the unborn Dionysus into his own thigh and carried him to term — making the child born once of woman and once of god. He traveled the world teaching viticulture, accompanied by satyrs and maenads. Those who denied his divinity were driven mad: Pentheus of Thebes was torn apart by his own mother. His cult involved ecstatic rites, wine, masks, and the dissolution of ordinary identity. From these rites came Greek tragedy — the art form that allowed an audience to become someone else. His theater on the south slope of the Acropolis was the birthplace of Aeschylus, Sophocles, and Euripides. The last god admitted to Olympus, he had to earn his seat. He reclines languorously on the Parthenon's east pediment — the only Olympian at ease.",
      "animals": ["Leopard", "Goat", "Serpent", "Bull"],
      "vegetation": ["Grapevine", "Ivy", "Fig"],
      "weapons": ["Thyrsus (fennel staff tipped with a pine cone)"],
      "consorts": ["Ariadne (abandoned by Theseus on Naxos, rescued by Dionysus)"],
      "birthCreation": "Son of Zeus and the mortal Semele. Born twice: once from Semele's burning body, once from Zeus's thigh.",
      "holidays": "Dionysia — the festival that gave birth to Greek tragedy; Anthesteria (spring wine-opening)"
    },
    {
      "id": "kronos",
      "name": "Kronos",
      "title": "Titan of Time and the Harvest",
      "group": "titan",
      "planet": "Saturn",
      "description": "Lord of the Golden Age, father of the Olympians, youngest of the twelve Titans. His father Uranus (Sky) hated his children and imprisoned them inside Gaia (Earth). She gave Kronos an adamantine sickle and he castrated his father, separating sky from earth and freeing his siblings. He ruled during the Golden Age — the only era when humanity lived without labor, law, or death. But he was told a child would overthrow him as he had overthrown Uranus, so he swallowed each of his children at birth: Hestia, Demeter, Hera, Hades, Poseidon. His wife Rhea hid the sixth child, Zeus, and gave Kronos a stone. Zeus grew, returned, forced Kronos to disgorge the stone and the five swallowed gods, and led the war that imprisoned the Titans in Tartarus. In Roman form as Saturn, his festival the Saturnalia inverted all social order — masters served slaves, courts closed, gifts were exchanged, and for a few days the Golden Age returned. His metal is lead. His symbol is the sickle. Death is the ultimate tyranny, Father Time — and each generation tries to escape his devouring.",
      "vegetation": ["Grain", "Wheat"],
      "metals": ["Lead"],
      "weapons": ["Adamantine sickle — the same one he used to castrate Uranus"],
      "consorts": ["Rhea (Ops)"],
      "birthCreation": "Son of Uranus (Sky) and Gaia (Earth). Youngest of the twelve Titans. He castrated his father with a sickle forged by his mother.",
      "dayTime": "Saturday (Saturni dies — Saturn's day)",
      "holidays": "Saturnalia — week of revelry and role reversal; December 17–23"
    },
    {
      "id": "helios",
      "name": "Helios",
      "title": "The Sun",
      "group": "titan",
      "planet": "Sun",
      "description": "Titan who personifies daylight itself. Each morning he rises from the river Oceanus in the east, drives a golden chariot drawn by four fiery horses — Pyrois, Aeos, Aethon, and Phlegon — across the sky, and descends into the west. He sees all things that happen by day and is invoked as a witness to oaths. His son Phaethon begged to drive the chariot and lost control, scorching the earth and creating the deserts of Africa. Zeus struck Phaethon down with a thunderbolt to save the world; his sisters wept amber tears. On the Parthenon's east pediment, Helios's horses rise from the sea at the left edge while Selene's sink at the right — dawn and dusk framing the birth of Athena at the center. His island was Rhodes, where the Colossus — one of the Seven Wonders — stood in his image. Gold is his metal across every tradition: the sun's sweat (Inca), the divine radiance (Egypt), the alchemical end point. Later tradition merged him with Apollo, but they were originally distinct: Helios is the sun; Apollo is what the sun means.",
      "animals": ["Four fiery horses (chariot)", "Rooster"],
      "colors": ["Gold", "White"],
      "metals": ["Gold"],
      "weapons": ["Radiant crown", "Golden chariot"],
      "consorts": ["Perse (Oceanid)", "Clytie (turned into a heliotrope)"],
      "birthCreation": "Son of the Titan Hyperion and the Titaness Theia. Brother of Selene (Moon) and Eos (Dawn).",
      "dayTime": "Sunday — the day of the sun in nearly every Western language",
      "holidays": "Daily rituals at sunrise; the Colossus of Rhodes was built in his honor"
    },
    {
      "id": "selene",
      "name": "Selene",
      "title": "The Moon",
      "group": "titan",
      "planet": "Moon",
      "description": "Titaness of the moon. She drives a silver chariot drawn by two white horses (or oxen) across the night sky, the counterpart to her brother Helios's solar journey. Her great myth is the love of Endymion: she saw the mortal shepherd sleeping on Mount Latmos and fell in love. She asked Zeus to grant him eternal sleep so she could visit him each night forever. He sleeps and she visits — an image of the moon bending toward the earth. By him she bore fifty daughters, sometimes identified with the fifty lunar months of the Olympiad. On the Parthenon's west pediment, her sinking chariot marks the coming of night as Helios rises on the east, framing the divine scene between them. Silver is her metal across every tradition — the mirror of the sun's light in darkness. The moon's cycles mark months, seasons, and the rhythms of agriculture and the body. Later merged with Artemis, but they were originally distinct: Selene is the moon; Artemis is what the moon means.",
      "animals": ["White horses (chariot)", "Bull"],
      "colors": ["Silver", "White"],
      "metals": ["Silver"],
      "weapons": ["Crescent moon diadem"],
      "consorts": ["Endymion (eternal sleep)", "Zeus (who fathered Pandia)"],
      "birthCreation": "Daughter of Titans Hyperion and Theia. Sister of Helios (Sun) and Eos (Dawn).",
      "dayTime": "Monday (Moon-day) — nighttime and lunar cycles",
      "holidays": "Honored on full moons; Pandia festival in Athens"
    },
    {
      "id": "hestia",
      "name": "Hestia",
      "title": "Goddess of the Hearth",
      "group": "other",
      "description": "Eldest of the Olympians and the quietest. First-born of Cronus and Rhea, first swallowed, last disgorged — she bookends the generation. Both Poseidon and Apollo wanted to marry her; she refused both, swore eternal virginity on Zeus's head, and he granted her the honor of receiving the first and last offering at every sacrifice. Her fire burned at the center of every Greek household and in the Prytaneion of every city — the public hearth that represented the city's life. When Dionysus came to claim a seat among the Twelve, Hestia gave up hers without argument and chose the hearth instead. No temples of her own, no statues, no dramatic myths — she is the fire that makes the house a home. The quietest and most essential act of all.",
      "birthCreation": "First-born of Cronus and Rhea. First swallowed, last disgorged. She chose virginity over two divine suitors and received the first offering at every sacrifice."
    },
    {
      "id": "persephone",
      "name": "Persephone",
      "title": "Queen of the Underworld",
      "group": "other",
      "description": "Daughter of Demeter and Zeus, abducted by Hades while gathering flowers in a meadow. The earth opened and the lord of the dead took her below. Her mother's grief stopped all growth on earth — no seed germinated, no tree bore fruit, humanity began to starve. Zeus was forced to send Hermes to retrieve her, but Persephone had eaten six pomegranate seeds in the underworld, binding her there for six months each year. Her annual descent brings winter; her return brings spring. This cycle — loss, descent, return — was the core of the Eleusinian Mysteries, the most sacred and secret rites of the ancient world, celebrated for nearly two thousand years just miles from the Parthenon. Initiates emerged transformed, unafraid of death. No one ever revealed what happened inside. Persephone is both the maiden (Kore) gathering flowers and the dread queen of the dead — the same person, holding both.",
      "vegetation": ["Pomegranate", "Narcissus (the flower that lured her)", "Grain"],
      "consorts": ["Hades"],
      "birthCreation": "Daughter of Zeus and Demeter. Taken to the underworld by Hades while picking flowers.",
      "holidays": "Eleusinian Mysteries; Thesmophoria"
    },
    {
      "id": "prometheus",
      "name": "Prometheus",
      "title": "Bringer of Fire",
      "group": "titan",
      "description": "Titan whose name means 'forethought.' When Zeus withheld fire from humanity, Prometheus stole it from the gods' hearth (or from Hephaestus's forge) and carried it to earth hidden in a fennel stalk. For this he was chained to a rock in the Caucasus — Mount Elbrus, in some tellings — where an eagle ate his liver each day and it grew back each night, endlessly. He also tricked Zeus in the division of sacrificial meat, giving humans the good portions hidden in an ox stomach while wrapping bones in glistening fat for the gods — which is why Greeks burned bones and fat on altars. In some versions he shaped humanity from clay and Athena breathed life into them. He was eventually freed by Heracles, who shot the eagle. His defiance of divine authority for the sake of human civilization made him the patron of arts, technology, and rebellion — Aeschylus wrote the Prometheus Bound, Mary Shelley subtitled Frankenstein 'The Modern Prometheus,' and every story of forbidden knowledge echoes his.",
      "animals": ["Eagle (his punishment and liberation)"],
      "weapons": ["Fennel stalk (carried the stolen fire)"],
      "birthCreation": "Son of the Titan Iapetus and the Oceanid Clymene. Brother of Atlas (who holds the sky), Menoetius, and Epimetheus ('afterthought,' who accepted Pandora)."
    }
  ]
}
