{
  "id": "persian",
  "name": "Heroes of the Shahnameh",
  "description": "The Shahnameh — the Book of Kings — is the Persian national epic, composed by the poet Ferdowsi over thirty years (977–1010 CE) in a deliberate act of cultural preservation. After the Arab conquest of Iran in the 7th century, the Persian language, history, and pre-Islamic identity faced erasure. Ferdowsi wrote 50,000 couplets — the longest poem by a single author in any language — using almost no Arabic loanwords, forging a monument in pure Persian that kept the old stories alive. The Shahnameh spans the mythic, heroic, and historical ages of Iran: from the first king Keyumars, who taught humans to wear animal skins; through the age of heroes dominated by the champion Rostam; to the historical fall of the Sasanian Empire to the Arab invasion. Its figures are not gods in the Olympian sense — they are kings, champions, sorcerers, and ordinary people caught in cycles of glory, betrayal, fate, and grief. The emotional register is closer to the Iliad than to Genesis: these are stories about what happens when extraordinary people collide with forces larger than themselves. The Shahnameh's central question is the question of Iran itself: can a civilization survive the destruction of its political order if its stories endure? Ferdowsi's answer, delivered in the final lines of the epic, is yes — but only if someone bothers to write them down.",
  "deities": [
    {
      "id": "rostam",
      "name": "Rostam",
      "title": "The Champion of Iran",
      "group": "heroes",
      "description": "Rostam is the supreme hero of Persian mythology, the champion whose strength, loyalty, and tragedy define the Shahnameh's heroic age. His birth itself required supernatural intervention — his mother Rudabeh's labor was so difficult that the Simorgh, the divine bird who had raised his father Zal, appeared and taught the midwife the caesarean technique to deliver him (the Persian term for caesarean, 'rostamzad,' carries his name). He grew to the size of a year-old child in a single day and to full manhood in a matter of years. His companion was Rakhsh, a rose-colored stallion of impossible endurance and intelligence — a horse who chose Rostam, not the other way around, by refusing to let any other warrior mount him. Rostam's greatest trial is the Haft Khan — the Seven Labors — undertaken to rescue King Kavus from captivity in Mazandaran, the land of demons. He kills a lion while sleeping (Rakhsh fights it off), crosses a waterless desert, slays a dragon, overcomes a sorceress, captures a demon chieftain, battles through a storm of darkness, and finally defeats the White Demon (Div-e Sepid) in his cave, tearing out his liver. These seven trials map almost perfectly onto the hero's journey structure — departure, initiation through escalating ordeals, the final confrontation in the underworld. But Rostam's deepest story is the tragedy of his son. In the tale of Rostam and Sohrab, the two meet on the battlefield without recognizing each other. Sohrab suspects the mighty warrior he faces is his father and tries to confirm it, but Rostam — following a complex web of deception and pride — denies his identity. They fight, and Rostam delivers the fatal wound. Only then, as Sohrab lies dying, does he reveal the armband his mother gave him as proof of his parentage. Rostam recognizes it and collapses in grief. It is one of the most devastating scenes in world literature — a father who destroys the thing he loves most because he cannot see clearly enough through the fog of war and pride. Rostam serves Iran through multiple dynasties, never seeking the throne himself, always the champion rather than the king. His eventual death comes through treachery: his half-brother Shaghad lures him into a pit of concealed lances. Even dying, Rostam strings his bow one final time and shoots Shaghad through the tree he hides behind, pinning him to its trunk. The champion dies, but his last act is justice.",
      "animals": ["Rakhsh (his rose-colored stallion)", "lion (defeated in the first labor)"],
      "colors": ["tiger-skin (his armor)", "rose-gold (Rakhsh's coat)"],
      "weapons": ["mace (gorz)", "lasso (kamand)", "bow and arrow", "sword"],
      "consorts": ["Tahmineh (mother of Sohrab)"]
    },
    {
      "id": "simorgh",
      "name": "Simorgh",
      "title": "The Divine Bird of Wisdom",
      "group": "divine-beings",
      "description": "The Simorgh is the most potent mythological creature in Persian tradition — a vast, ancient bird who nests atop the mythical tree Gaokerena (or the Tree of All Seeds) that stands in the middle of the cosmic sea Vourukasha. In the Shahnameh, when the albino prince Zal is abandoned on a mountainside by his father Sam — who considers his white hair a mark of demonic taint — the Simorgh takes the infant and raises him in her nest alongside her own chicks. She nurtures him through childhood, and when Sam finally repents and seeks his son, the Simorgh returns Zal to the human world but gives him one of her feathers: if he ever faces mortal danger or impossible grief, he should burn the feather and she will come. This feather becomes the single most important talisman in the Shahnameh. It is burned to summon the Simorgh to aid Rudabeh's impossible labor when Rostam is born. It appears again in moments of absolute extremity. The Simorgh functions as the ultimate mentor figure — the supernatural aid who does not fight your battles but gives you the knowledge to survive them. She does not intervene in the political world of kings and wars; she intervenes in the biological and spiritual emergencies that no human skill can address. In Attar's Conference of the Birds (12th century), the Simorgh takes on an additional dimension: thirty birds (si morgh in Persian) undertake a perilous journey through seven valleys to find the Simorgh, only to discover that they are the Simorgh — the divine is the collective, not an external authority. This double meaning — the individual divine protector of the Shahnameh and the collective self-realization of the Sufi tradition — makes the Simorgh one of the most philosophically layered symbols in any mythology. The Avestan form, Saena Meregh, appears in the Bundahishn as a creature so vast that when she lands on the Tree of All Seeds, she scatters the seeds of every plant on earth into the wind and the cosmic rain carries them across creation.",
      "animals": ["peacock (part of her composite form)", "falcon", "dog (some depictions)"],
      "colors": ["iridescent copper", "gold", "vermilion", "all colors (she encompasses all birds)"],
      "element": "air/wisdom"
    },
    {
      "id": "zahhak",
      "name": "Zahhak",
      "title": "The Serpent-Shouldered Tyrant",
      "group": "villains",
      "description": "Zahhak (Avestan: Azi Dahaka) is the central villain of the Shahnameh's mythic age — an Arabian prince whose ambition opened him to corruption by Ahriman (Angra Mainyu), the spirit of destruction. Ahriman appeared to Zahhak first as a cook who introduced him to the eating of meat (until then unknown), winning his gratitude. Then Ahriman asked only to kiss Zahhak's shoulders as a reward. From the place where his lips touched, two black serpents grew — and they could not be cut off, because they grew back immediately. The serpents demanded to be fed human brains, and so Zahhak's reign of terror began: each day, two young people were killed so their brains could feed the snakes on the tyrant's shoulders. He overthrew the just king Jamshid and ruled Iran for a thousand years of horror. The psychological precision of this origin story is remarkable. The corruption does not begin with violence — it begins with appetite. Ahriman teaches Zahhak to consume what he shouldn't, and the escalation from that first indulgence to a daily human sacrifice follows with the logic of addiction. The serpents are not external parasites; they grow from Zahhak's own body, from the place where he accepted the devil's kiss. The evil is not something done to him — it is something he agreed to. His overthrow comes through Kaveh the blacksmith, an ordinary man who has lost seventeen of his eighteen sons to the serpent-feeding. Kaveh raises his leather apron as a banner (it becomes the Derafsh Kaviani, the royal standard of Iran), rallies the people, and leads them to the prince Fereydun, who defeats Zahhak. But Zahhak cannot be killed — he is chained beneath Mount Damavand, where he writhes until the end of time. In the Zoroastrian eschatological tradition, he will break free at the Frashokereti (the final renovation) and be destroyed at last. The mountain itself is a dormant stratovolcano; Iranians traditionally said the tremors were Zahhak stirring in his chains.",
      "animals": ["serpents (growing from his shoulders)", "dragon (his Avestan form Azi Dahaka is three-headed)"],
      "colors": ["black", "blood-red"],
      "weapons": ["serpents that demand human brains", "a thousand-year reign of fear"]
    },
    {
      "id": "kaveh",
      "name": "Kaveh",
      "title": "The Blacksmith Who Rose",
      "group": "heroes",
      "description": "Kaveh is the most politically charged figure in the Shahnameh — an ordinary blacksmith from Isfahan who becomes the catalyst for revolution against Zahhak's thousand-year tyranny. He is not a prince, not a warrior, not a figure with divine parentage. He is a craftsman who has watched seventeen of his eighteen sons be taken and killed to feed the serpents on Zahhak's shoulders. When the order comes for his last son, Kaveh does what no one in the kingdom has done in a millennium: he refuses. He goes to Zahhak's court, stands before the tyrant, and demands justice. When the court document is presented for his signature — a declaration that Zahhak is a just ruler — Kaveh tears it apart and walks out. He takes his leather blacksmith's apron (the pishband), raises it on a spear, and marches through the streets calling the people to rise. They follow him. The apron becomes the Derafsh Kaviani, the royal standard of Iran, which was later adorned with jewels and carried into battle by every subsequent dynasty through the Sasanian Empire. Kaveh leads the uprising to the prince Fereydun, who has been hidden in the mountains, and together they march on Zahhak's palace. The fact that this is a blacksmith — a man who works with fire and metal, who shapes raw material into tools — is not incidental. In a tradition where Khshathra Vairya (Desirable Dominion) governs metals and embodies just authority, the blacksmith is the figure closest to the sacred mechanics of righteous power. Kaveh does not want to be king. He wants his son to live. The revolution begins not with ideology but with a parent's grief and an artisan's refusal to accept one more loss. Every subsequent Iranian revolution — including the constitutional revolution of 1906 and the 1979 revolution — has invoked Kaveh's name. The image of the leather apron raised against tyranny is the oldest continuously used symbol of popular resistance in human history.",
      "colors": ["iron-black", "leather brown", "fire-gold"],
      "weapons": ["leather apron (Derafsh Kaviani)", "blacksmith's hammer", "the refusal to sign"]
    },
    {
      "id": "jamshid",
      "name": "Jamshid",
      "title": "The King of the Golden Age",
      "group": "kings",
      "description": "Jamshid (Avestan: Yima Khshaeta, 'Yima the Radiant') is the great king of the mythic age whose story is a parable about the relationship between genius, pride, and catastrophe. He ruled Iran for seven hundred years and during that time introduced virtually everything: the spinning of thread, the weaving of cloth, the mining of gems, the smelting of iron, the building of ships, the art of medicine, the division of society into four classes (priests, warriors, farmers, artisans), and the celebration of Nowruz — the spring equinox festival that remains the Persian New Year. Under his rule there was no disease, no death, no aging, no envy. It was the golden age incarnate. Then Jamshid looked at everything he had built and made the mistake: he declared that this perfection was his own doing, that his power came from himself rather than from the divine farr (khvarenah, the royal glory bestowed by Ahura Mazda). The moment he said it, the farr left him — visible, immediate, irrevocable. His authority evaporated. His allies deserted him. Zahhak, the serpent-tyrant, invaded from Arabia and took his throne. Jamshid fled and hid for a hundred years before Zahhak's men found him and sawed him in half. The Jam-e Jam — the Cup of Jamshid — is a legendary chalice said to reflect the entire world, showing all of creation in its depths. In Sufi poetry (particularly Hafez), the Cup of Jamshid becomes a metaphor for divine knowledge and for wine as a vehicle of ecstatic truth. The Avestan Yima also receives the Vara — a sacred enclosure where he preserves the seed of every creature against a prophesied harsh winter (remarkably parallel to Noah's Ark). The Shahnameh version emphasizes the political parable: competence is not the same as virtue, and the moment a ruler believes his achievements belong to him rather than to the forces working through him, the golden age ends.",
      "animals": ["ram (associated with royal glory)"],
      "colors": ["gold", "radiant white", "gem-tones"],
      "weapons": ["Jam-e Jam (the world-reflecting cup)", "the royal farr (divine glory)"],
      "holidays": "Nowruz (traditionally founded by Jamshid)"
    },
    {
      "id": "fereydun",
      "name": "Fereydun",
      "title": "The Just Avenger",
      "group": "kings",
      "description": "Fereydun (Avestan: Thraetaona) is the prince who defeats Zahhak and restores justice to Iran — the revolutionary king whose story completes what Kaveh's uprising begins. His birth is surrounded by omens and concealment: his father Abtin was killed by Zahhak's agents, and his mother Faranak hid the infant in the Alborz mountains, where he was nursed by a miraculous cow called Barmayeh (or Purmayeh) whose milk was rich enough to raise a future king. When Kaveh's revolution delivers the people to Fereydun's mountain refuge, the young prince takes up his grandfather's ox-headed mace — the gurz-e gavsar, a weapon shaped like a bull's head that becomes the signature weapon of Iranian kingship. He rides to Zahhak's palace with Kaveh and an army of the people. There is no prolonged siege. Fereydun strikes Zahhak with the mace, but an angel (or in some versions a wise figure) warns him not to kill the tyrant — if Zahhak's blood touches the earth, monsters will pour from the wound. Instead, Fereydun chains Zahhak beneath Mount Damavand, binding him with supernatural bonds. The volcano holds him still. Fereydun then rules justly but makes a fateful decision: he divides his kingdom among his three sons. Salm receives the West (Rome), Tur receives the East (Turan, Central Asia), and Iraj receives Iran — the heartland. The elder brothers, envious, murder Iraj. This fratricide becomes the origin of the eternal enmity between Iran and Turan that drives the entire heroic age of the Shahnameh. The story warns that even a just king who ends tyranny can plant the seed of the next cycle of violence through the simple act of inheritance. Justice does not guarantee that your children will be just.",
      "animals": ["cow Barmayeh (his nurse)", "bull (his mace's shape)"],
      "colors": ["royal purple", "steel grey"],
      "weapons": ["gurz-e gavsar (ox-headed mace)", "chains that bind Zahhak"],
      "consorts": ["Shahrnaz and Arnavaz (rescued from Zahhak's palace)"]
    },
    {
      "id": "zal",
      "name": "Zal",
      "title": "The White-Haired Prince",
      "group": "heroes",
      "description": "Zal is one of the most psychologically complex figures in the Shahnameh — the abandoned child who becomes the father of Iran's greatest hero. Born to the warrior Sam with pure white hair, he was rejected by his father as a demonic omen and exposed on a mountainside to die. The Simorgh, the divine bird, found the infant and carried him to her nest atop Mount Damavand, raising him alongside her own chicks. When Sam, tormented by guilt and a prophetic dream, finally seeks his son, the Simorgh returns Zal to the human world. But the Simorgh's parting gift — one of her feathers, to be burned in extremity — makes Zal permanently linked to the divine. He carries the mark of two worlds: the human world that rejected him and the celestial world that raised him. Zal's great love story is his passion for Rudabeh, princess of Kabul and descendant of Zahhak. This lineage makes the match politically explosive — the granddaughter of the serpent-tyrant wed to the champion of Iran's royal house. Sam opposes it. The court opposes it. But Zal and Rudabeh's love persists. The famous scene of their meeting — Rudabeh letting down her long hair from a balcony for Zal to climb — echoes across world literature (it predates the Rapunzel tale by centuries). Their union produces Rostam, the champion whose birth requires the Simorgh's intervention. Zal's white hair is never explained within the story. It is simply a mark of difference — a visible sign that this person does not belong to the category he was born into. The father who abandons him is not evil; Sam is described as genuinely grief-stricken. But the grief of the abandoner does not undo the abandonment. Zal's story is about what happens to someone raised outside their own culture who must then reenter it and function — carrying wisdom the culture cannot produce from within itself.",
      "animals": ["Simorgh (foster mother)"],
      "colors": ["white (his hair)", "silver", "sky blue"],
      "weapons": ["bow and arrow", "the Simorgh's feather"],
      "consorts": ["Rudabeh (princess of Kabul)"]
    },
    {
      "id": "sohrab",
      "name": "Sohrab",
      "title": "The Doomed Son",
      "group": "heroes",
      "description": "Sohrab is the son of Rostam and Tahmineh, raised in Turan (Central Asia) without ever meeting his father, who became the vehicle of one of the most devastating tragedies in world literature. Tahmineh, a Turanian princess, had a single night with Rostam during his travels and bore Sohrab in secret. She told the boy about his legendary father, and as Sohrab grew into a warrior of extraordinary power — matching and possibly exceeding his father's strength — he became obsessed with finding Rostam and reuniting with him. But the Turanian king Afrasiyab saw an opportunity: if he could direct Sohrab's fury against Iran without Rostam recognizing his son, the champion might be killed. On the battlefield, Sohrab faces an aging warrior whose strength matches his own. He suspects this is Rostam and asks. But Rostam — through a combination of strategic deception, pride, and the fog of war — denies his identity. They fight three rounds. In the final engagement, Rostam mortally wounds Sohrab with a dagger. As the boy lies dying, he reveals the armband his mother gave him — the one Rostam left with Tahmineh as a token for their unborn child. Rostam recognizes it and the full horror breaks over him. He tears his own armor, claws his face, and begs for a healing salve from King Kavus, who refuses (or delays fatally, depending on the version). Sohrab dies in his father's arms, calling him father for the first and last time. Matthew Arnold's English poem 'Sohrab and Rustum' (1853) brought this story to the Western world, but the Persian original has a rawness and moral complexity that no adaptation has fully captured. The story does not blame Rostam cleanly. It does not blame anyone cleanly. It shows how systems of war, pride, and hidden identity produce catastrophe even among people who love each other.",
      "animals": ["horse (a warrior from childhood)"],
      "colors": ["blood-red", "Turanian blue"],
      "weapons": ["sword", "mace", "the armband that proves his lineage"],
      "consorts": []
    },
    {
      "id": "rudabeh",
      "name": "Rudabeh",
      "title": "The Princess of Kabul",
      "group": "queens",
      "description": "Rudabeh is the princess of Kabul, the great love of Zal, and the mother of Rostam — a woman whose lineage carries the most dangerous blood in the Shahnameh. She is a descendant of Zahhak, the serpent-tyrant, and her marriage to Zal (son of the house of Sam, champions of Iran) represents a union that the entire political establishment considers an abomination. The bloodline of Iran's greatest villain joined to the bloodline of Iran's greatest heroes. Every advisor warns against it. Every astrologer predicts disaster. And yet the union produces Rostam — the most powerful champion the tradition has ever known. Rudabeh's famous scene is her appearance on the roof of her palace when Zal comes to see her: she lets down her long black hair from the parapet so he can climb to her — a gesture of extraordinary boldness and vulnerability. Zal tells her not to damage her hair and uses a lasso instead, but the image persists: a woman offering her own body as the bridge between two people separated by walls and politics. Rudabeh's role in the Shahnameh's deeper architecture is as a figure who demonstrates that lineage is not destiny. The granddaughter of Zahhak does not produce another tyrant — she produces the defender of the realm. The 'contaminated' bloodline, combined with the 'heroic' bloodline, creates something stronger than either alone. This is the Shahnameh's quiet argument against ethnic and familial purity: the greatest strength comes from the union of opposites, including the union of what the culture considers pure with what it considers polluted. Rudabeh also endures Rostam's birth — a labor so difficult that it nearly kills her and requires the Simorgh's feather to perform the caesarean that delivers the child. She survives. The mother of the champion carries scars the champion never knows about.",
      "colors": ["black (her hair)", "rose", "gold"],
      "weapons": ["her hair (the bridge)", "courage against political prohibition"],
      "consorts": ["Zal (son of Sam)"]
    },
    {
      "id": "tahmineh",
      "name": "Tahmineh",
      "title": "Mother of Sohrab",
      "group": "queens",
      "description": "Tahmineh is the Turanian princess who seeks out Rostam during a single night when the champion stops in the border kingdom of Samangan, and whose choice to keep their son's identity hidden from both father and son sets in motion the most tragic story in the Shahnameh. She comes to Rostam's chamber at night — not summoned, not coerced, but of her own volition — and tells him plainly: she has heard of his fame, she desires him, and she wants to bear his child. Rostam agrees and they spend one night together. When he leaves, he gives her an armband (bazuband) as a token: if the child is a girl, braid it in her hair; if a boy, fasten it on his arm, and by this sign Rostam will know his own child. Tahmineh bears Sohrab and raises him in Turan. She tells the boy his father is Rostam but does not send word to Rostam about the child. The reasons for this silence are debated across centuries of Persian literary criticism. Is she protecting Sohrab from being taken from her? Is she honoring Turanian political allegiance? Is she simply a mother who does not want to lose her son to the court of a man who spent one night with her and left? The Shahnameh does not explain. It presents the silence as fact and lets the reader feel its consequences. When Sohrab rides to war seeking his father and dies on Rostam's blade, Tahmineh receives the news and dies of grief — or in some versions lives on as a figure of permanent mourning, the mother who told her son just enough truth to send him to his death and withheld just enough to prevent recognition on the battlefield. She is not a villain. She is a woman making decisions with incomplete information in a world where every choice carries lethal weight.",
      "colors": ["Turanian blue", "moon-white", "grief-black"],
      "weapons": ["the armband she gave Sohrab (both his birthright and his death certificate)"],
      "consorts": ["Rostam (one night)"]
    },
    {
      "id": "kay-kavus",
      "name": "Kay Kavus",
      "title": "The Reckless King",
      "group": "kings",
      "description": "Kay Kavus is the Shahnameh's portrait of what happens when a king has power without wisdom — a ruler who repeatedly plunges Iran into catastrophe through ambition, vanity, and an inability to listen to counsel. He is not evil like Zahhak; he is worse in some ways, because he is legitimate. He holds the throne rightfully and uses it recklessly. His most famous episode is his attempt to fly to heaven: he straps eagles to a throne, dangles meat above them on spears so they fly upward trying to reach it, and soars into the sky until the eagles tire and the throne crashes to earth in a distant forest. This is not myth played for comedy — it is a precise image of a ruler whose desire to transcend his station uses living creatures as engines and ends in a fall that someone else must clean up. That someone is always Rostam. Kay Kavus is captured by the demons of Mazandaran because he invaded their territory on a whim — Rostam undertakes the Seven Labors to rescue him. Kay Kavus is blinded by a magical assault — Rostam retrieves the cure. Kay Kavus's son Siyavash is driven into exile by the king's jealous wife — and Siyavash's death in Turan triggers the war that consumes the next generation. Most devastatingly, when Rostam begs Kay Kavus for a healing salve to save the dying Sohrab, the king delays or refuses (depending on the version), and the boy dies. Kay Kavus is the Shahnameh's argument that the worst kind of ruler is not the tyrant but the fool — the legitimate authority who cannot stop creating emergencies that heroes must solve at terrible personal cost. He never quite deserves to be overthrown, which is exactly what makes him so destructive.",
      "colors": ["royal blue", "gold (his ambition)", "fallen-grey"],
      "weapons": ["the throne (which he misuses)", "decrees that create disasters"],
      "consorts": ["Sudabeh (his treacherous wife)"]
    },
    {
      "id": "siyavash",
      "name": "Siyavash",
      "title": "The Innocent Prince",
      "group": "heroes",
      "description": "Siyavash is the prince whose beauty, innocence, and death trigger the great war between Iran and Turan that dominates the second half of the Shahnameh. Son of Kay Kavus, raised by Rostam in the provinces, he grows into the most morally pure figure in the epic — a young man who genuinely has no malice, no cunning, and no capacity for the kind of political calculation that survival requires. His stepmother Sudabeh (a direct parallel to the Phaedra/Potiphar's wife archetype) attempts to seduce him. He refuses. She accuses him of assault. Kay Kavus, torn between his wife and his son, orders Siyavash to prove his innocence by riding through fire — a Zoroastrian ordeal of truth. Siyavash rides through the flames and emerges unscathed, his purity proven. But the court is poisoned. Siyavash, alienated from his father and disgusted by the political atmosphere, crosses the border into Turan and takes service with the Turanian king Afrasiyab. Afrasiyab loves him — genuinely — and gives him his daughter Farangis in marriage. Siyavash builds a magnificent city, Siavashgerd, and seems to have found peace. But the Turanian nobles grow suspicious. Afrasiyab's brother Garsivaz poisons the king's mind with lies. Afrasiyab, against his own love and judgment, orders Siyavash's execution. The prince is beheaded, and from his blood a plant grows — a detail that echoes across Persian poetry as the emblem of sacrificed innocence producing beauty. His death shatters the peace between Iran and Turan. His son Kay Khosrow will grow up to avenge him in a war of extermination. The story of Siyavash is the Shahnameh's statement on what purity costs in a world run by politics: the innocent person doesn't survive, but their destruction changes the moral calculus for everyone who participated in it.",
      "animals": ["his black horse (ridden through the fire)"],
      "colors": ["white (purity)", "fire-gold (the ordeal)", "blood-red (his martyrdom)"],
      "weapons": ["none — his weapon is his innocence, which is also what kills him"],
      "consorts": ["Farangis (daughter of Afrasiyab)"]
    },
    {
      "id": "ferdowsi",
      "name": "Ferdowsi",
      "title": "The Poet Who Saved a Civilization",
      "group": "poets",
      "description": "Abu'l-Qasim Ferdowsi (940–1020 CE) is the author of the Shahnameh and — without exaggeration — the single most important figure in the preservation of Persian cultural identity. Born in Tus, Khorasan (northeastern Iran), to a family of dehqans (landholding gentry who were the traditional custodians of pre-Islamic Persian culture), Ferdowsi spent approximately thirty years composing the Shahnameh's 50,000 couplets. He drew on earlier prose compilations of Iranian mythology and history, particularly the Khwaday-namag (Book of Lords), a Sasanian-era chronicle that was itself a compilation of older oral and written traditions. His stated purpose was explicit: to preserve the Persian language and Persian identity through poetry so enduring that no political conquest could erase it. He wrote in almost pure Persian, deliberately avoiding the Arabic loanwords that were flooding the language after three centuries of Islamic rule. The result is a literary monument that functioned — and still functions — as the primary vehicle of Iranian national consciousness. The legendary story of his compensation is bitter: Sultan Mahmud of Ghazni, to whom Ferdowsi dedicated the work, allegedly promised a gold coin for every couplet but paid in silver, or failed to pay adequately. By the time the Sultan's conscience (or advisors) moved him to send proper payment, Ferdowsi had died, and the gold arrived at his house as his funeral procession was leaving. Whether historically accurate or not, the story encodes a truth about the relationship between artists and power: the work that saves a civilization is never adequately valued by the rulers who benefit from it. Ferdowsi's tomb in Tus is now a national monument. His birthday, May 15, is celebrated as Ferdowsi Day across Iran. The Shahnameh is read at weddings, funerals, Nowruz celebrations, and political rallies. A poet kept the nation alive.",
      "colors": ["ink-black", "parchment-gold", "Persian blue"],
      "weapons": ["the Persian language itself", "50,000 couplets", "thirty years of labor"]
    }
  ]
}
