[
  {
    "id": "jesus",
    "name": "Jesus",
    "stages": {
      "golden-age": "Jesus is often depicted as a champion of the oppressed, the enslaved, and the impoverished. His teachings challenge the societal pursuit of wealth and purity, advocating instead for love, compassion, and equality among all individuals, regardless of their social standing. This echoes the mythological representation of steel warriors as those who rise against tyranny and challenge the power structures of the status quo.\n\nJesus Christ embodies the archetype of the revolutionary, akin to the Hittite infant of steel who foreshadowed the transformative Iron Revolution. His teachings challenged the established religious and political orders, mirroring the profound societal impact of both Christianity and the advent of the Iron Age.\n\nMoreover, Jesus frequently defied conventions and broke societal rules, such as healing on the Sabbath. His actions, driven by compassion and free-thinking, emphasized the virtue of challenging the status quo for the greater good. This rebellious quality aligns with the mythological portrayal of steel heroes as agents of change who disrupt oppressive systems.",
      "falling-star": "One can discern parallels between the nativity of Christ and the steel birth narratives of figures such as Sosruquo and Ayyanar, who are said to emerge wherever an arrow lands. Similarly, the Star of Bethlehem, a celestial phenomenon that guided the Magi to the birthplace of Jesus, signifies a 'new light in the sky.' These elements evoke a connection between the divine birth narratives and the miraculous circumstances surrounding Jesus' arrival.\n\nJesus, was born where a light in the sky pointed.\n\nThe falling star that pointed towards the place he arrived in this world repeats the meteor-motif so common with children who change the world—like Christ.",
      "impact-crater": "In both sets of narratives, the fathers are shepherds, and the conceptions are considered immaculate. This echoes the story of Satanaya, whose child was said to be conceived when its father ejaculated onto a rock. These parallels highlight the extraordinary nature of Jesus' birth and position him within a broader mythological framework.\n\nIs there a rock or head stone associated with Christ? One might look to the stone that is rolled away for his resurrection, Yet, central to Christ's narrative is another metaphorical rock. Upon this rock, Christ declares to Peter, he would establish his church, thereby symbolizing the foundation of His legacy. This declaration followed Peter's acknowledgment of Jesus as the Son of God, aligning the image of Christ, the progeny of the shepherd deity, with the rock. The narrative mirrors that of the Nart Sagas, where the Shepherd's child is associated with the rock.\n\nThe pivotal setting for this narrative is Mt. Hebron. Biblically, this is the location where angels descended, mating with human women to birth the Nephilim and consequently leading to the downfall of civilization. These angels also introduced metallurgy, particularly steel. Thus, one can view Mt. Hebron as a remnant, among other things, of the Iron Age revolution, serving as a monument to this epoch. The rock at Christianity's core could be seen as commemorating this Iron Age revolution, symbolizing an uprising against the oppressive order it replaced.\n\nThe contemporary context of this location shifted to the sacrificial offerings of goats to Pan. Situated at the source of the river Jordan, flowing from beneath the mountain, it was perceived by the Mediterranean Pagans as a portal to Hades. It had also become the site of the highest number of goat sacrifices to Pan globally. Consequently, the stone upon which Christ intended to build His church has been interpreted as a revolt against Pan, the goat-legged deity that shaped the image of the devil, his bloody sacrifices, and the pagan world.\n\nMoreover, the name Peter itself signifies 'stone.' Given that Peter was the inaugural pope, Jesus could indeed have foreseen the church's construction upon Peter. However, considering the mythological perspective, these events hold a concrete reality. The cornerstone of Christianity is intricately woven through associations between the stone and the Son of God's image, the shepherd, the convergence of heaven and earth, rebellion against oppression, and Peter – the man symbolized as the stone.\n\nEveryone sees the christ-child motif in this figure: son of a father from the heavens who came to earth and became a savior.",
      "forge": "In Christian mythology, the narrative of Jesus Christ abounds with profound symbolism, including the recurring motif of steel—a material renowned for its transformative properties and enduring strength. Exploring the interplay between steel and key episodes in Christ's life enriches our understanding of the complex tapestry of Christian mythology.\n\nIt is not just Jesus and heroic saviors who walk and talk like meteor steel, we also see it in the fallen angels.",
      "quenching": "The act of baptism in Christian tradition finds resonance with the process of quenching in metallurgy. Quenching involves submerging heated steel into water to harden it, making it durable and resilient. Likewise, baptism symbolizes the spiritual rebirth and purification of an individual, endowing them with spiritual strength and everlasting resilience. The theme of rebirth, immortality, and the emergence of a new self resonates with the mythological archetype of steel warriors and war bands.\n\nBeyond baptism, the Gospel scene where a woman washes Jesus's feet with her tears and anoints them with perfume echoes the same quenching gesture. A woman kneels, uses liquid—tears, oil, water—and attends to the feet of a sacred figure in an intimate, boundary-crossing act of care. The moment resonates with the archetypal posture seen when female figures in myth, such as the mother of Achilles and other nurturing or initiatory women, handle the vulnerable body of a hero through washing, anointing, or immersion. In this light, the Gospel scene reflects the quenching image: a ritual of devotion, humility, and transformation enacted through feminine care directed toward the one who carries a sacred destiny. Where baptism represents the formal plunging of heated steel into water, the anointing of the feet represents the intimate, personal dimension of the same act—the quenching not as public rite but as private gesture of recognition.",
      "integration": "Despite the patriarchal adaptations that Christianity underwent over time, the relationship between Jesus and feminine figures such as his mother, Mary, and Mary Magdalene, showcases a positive affirmation of the feminine—an attribute shared by many steel heroes. The support Jesus received from widows further reinforces this inclusive approach and highlights the significance of feminine influence.\n\nFinally, the transition from the singular divine entity in Judaism to the pluralistic Holy Trinity in Christianity reflects an embrace of plurality and inclusivity. The nature of the Holy Spirit, with its emphasis on eminence and wholeness, further expands this paradigm of multiplicity within the Christian mythos.",
      "drawing": "The arrival moment in the Christian story is the resurrection, marked by the rolling away of the stone from the tomb. The sealed rock that enclosed death is opened, and Christ emerges into a new state of being. This moment mirrors the drawing of the weapon from stone: what was enclosed and hidden is revealed, and a new reality begins. The resurrection becomes the decisive emergence that transforms the world, the point at which the story moves from sacrifice and trial into the proclamation of a new age.",
      "new-age": "The narrative of Jesus Christ is imbued with myriad motifs and parallels that echo the transformative qualities and enduring strength of steel. This exploration elucidates the deep, mythological connections between key episodes of Christ's life and steel-related narratives, contributing to a richer understanding of Christian mythology. From the celestial guiding star at his birth, to the immaculate conception and his baptism akin to steel quenching, these elements resonate within a broader framework of myths. Jesus, the revolutionary figure who defies conventions, emerges as a steel hero challenging oppressive orders for the greater good. His affirmative relationships with feminine figures and his championship of the oppressed underscore his inclusive stance, resonating with the mythological steel heroes. The plurality inherent in the Christian Holy Trinity further expands this motif of inclusivity. The associations of the rock—symbolizing foundation, revolution, and Peter—with Jesus provide a metaphorical cornerstone for Christianity to match the many head stones from steel inspired myths.\n\nMeteor steel came down from the heavens to arm the overthrow of a tyrannical world, and the messianic age to which it led was called 'the age of iron.'"
    }
  },
  {
    "id": "buddha",
    "name": "Buddha",
    "stages": {
      "golden-age": "As with any hero of steel who challenges status quo hierarchy, the Buddha challenged the notion that only the Brahmin could achieve Moksha in the same way Christ would challenge the exclusive access to God claimed by the priesthood when he ripped the veil between humanity and the holy of holies. According the the Buddha, anyone in any life at any level of the caste system can break free to achieve nirvana, moksha and enlightenment. Call it the Siddarthan Dream. In this way, he was a champion of the lower classes as opposed to a representative of wealth or royalty. That he left his wealth and titles behind was a sign to pursue the noble path reaffirms his commitment to virtue over wealth.",
      "falling-star": "The Buddha was born of the warrior class, and as with Sosruquo, Vulcan and other figures of steel, he is immaculately conceived. As the story goes, his mother dreams of a grey elephant with extra tusks entering into her side. Without reducing the scene to that of a meteor strike, we find its pattern mimed in the narrative. The name of his mother, Maya, refers to the (illusory material) world in which humans exist. Firstly, the elephant is presented with multiple tusks, separating our understanding of the elephant from something simple and literal. We then recognize its grey hard skin as shared with the meteor and see the possibility that the description of a multi-tusked elephant, known for its ability to charge, may have been a relatable description of a large meteor. For example, the Ahnighito meteorite used by the Inuit to make harpoon tips and other tools for generations still weighs thirty-four tons. When accounting for the importance of including associations related to the elephant and tusk, like its relationship with the moon, the nearness of the physical description to a large meteor comes nearer. Let it be a slogan: myths should never be reduced.",
      "impact-crater": "The Buddha saw the plowing to lose his innocence, this was the inciting incident, but it is the same as the inciting incident of a meteor. The eagle swooping down into the crater dividing the earth for the penetration of a seed completes the image of the falling meteor.",
      "forge": "Until the Buddha awakened, the Hindu tradition around him was committed to asceticism. Fire worship was prominent. He pursued the path of asceticism to the point of emaciation. He attempted to transcend the influence of his body. This period of extreme ascetic practice represents the heated phase of his transformation before the turning toward the middle way.",
      "quenching": "He attempted to transcend the influence of his body. He then drank milk from a golden cup, shocking his peers and leading them to believe he had forsaken the ascetic's path. This was central to the Buddha's new understanding however. He represents a re-integration with the material and the feminine.",
      "integration": "Not only did he drink from the bowl, given to him by a girl, but he also, when challenged by Mara on his right to sit in the center of the world, he reached down and touched the earth. When he differed to the earth, it trembled to express his right to be there. It would not have done so if he was still an ascetic, if he was still focused on purity, if he was still refusing to integrate with the feminine.\n\nThe Buddha reaches down to touch the earth when he is challenged for his right to sit in the center of the world, which is confirmed by a tremble from the great mother. This repeats the moment he accepts a bowl of rice and milk from a young woman. These enlightening moments represent the importance of reintegration with the feminine and a recognition that matter is not to be reduced to that which corrupts spirit (or compromises pattern).\n\nThe concept of nirvana, associated with blowing out the inner fire, parallels the transformative nature of steel quenching, leading to the Buddha's timeless liberation.",
      "drawing": "The Buddha's awakening marks the emergence of a new kind of consciousness into the world. After attaining enlightenment, he returns to his homeland and is confronted with an imminent war between the Sakyas and the Koliyas over water rights. Rather than allow the conflict to erupt, he intervenes and persuades both sides to abandon the violence. The first public expression of his awakening is therefore not conquest but the prevention of war. The consciousness he brings into the world manifests immediately as peacemaking, demonstrating that the transformation he attained is meant to reshape human society, beginning with peace in his own home.",
      "new-age": "Exploring the mythology surrounding Buddha reveals intriguing connections to steel motifs and symbolic associations. The story of Buddha's conception, marked by the dream of a multi-tusked elephant entering his mother's side, parallels the symbolism of meteoric arrival seen in other steel-related narratives. The moment of the Buddha's loss of innocence, observing the plow parting the earth like a meteor, signifies a disruption of his youth and an awareness of mortality. The Buddha's pursuit of the middle way rejects asceticism and represents an integration with the material and feminine aspects of existence. The act of quenching, symbolized by placing a bowl into the water and it floating upstream, holds profound significance, reflecting the paradoxical liberation and enlightenment attained through the integration with matter. The concept of nirvana, associated with blowing out the inner fire, parallels the transformative nature of steel quenching, leading to the Buddha's timeless liberation. His inclusion of women in the spiritual community challenges gender norms, while his antihierarchical stance affirms that anyone, regardless of caste or social standing, can achieve enlightenment. Thus, the Buddha emerges as a figure embodying virtues, rebellion against the status quo, and a commitment to compassion and virtue over worldly attachments."
    }
  }
]
