{
  "id": "tahitian",
  "name": "The Atua of Raʻiātea",
  "description": "Tahitian spirituality radiates outward from Mount Temehani on the island of Raʻiātea — whose ancient name, Havaiʻi, gave Hawaiʻi its name — the sacred center of Eastern Polynesia, from which voyagers departed to settle the three corners of the Polynesian Triangle: Hawaiʻi, Aotearoa, and Rapa Nui. The great marae of Taputapuātea, at the base of Temehani, was the holiest temple complex in the Pacific, where priests, navigators, and chiefs from across Polynesia gathered to exchange knowledge, crown kings, and consecrate alliances under the atua — the gods who governed sky, sea, war, fertility, and the arts. What Teuira Henry preserved in 'Ancient Tahiti' (1928), drawn from her grandfather J.M. Orsmond's fieldwork decades earlier, and what Moerenhout recorded in 'Voyages aux Îles du Grand Océan' (1837), is a theological system of startling sophistication — a cosmos that began inside a shell, built from the body of its creator, and organized by a culture that understood holiness not as stillness but as departure.",
  "deities": [
    {
      "id": "taaroa",
      "name": "Taʻaroa",
      "title": "The Supreme Creator",
      "group": "creator",
      "description": "Taʻaroa is the self-created god who existed before anything else — before light, before land, before the other gods. The Tahitian creation chant, preserved by Teuira Henry from her grandfather Orsmond's transcriptions, places Taʻaroa inside a cosmic egg called Rumia, floating in endless darkness. He had no father, no mother. He developed himself in solitude. Then he cracked the shell, stood upon the broken halves, and looked out into a void with no land, no sky, no sea. What followed is one of the most materially specific creation myths in world religion: Taʻaroa used one half of his shell as the foundation of the world — rock and soil — and the other half as the dome of the sky. Then he used his own body as raw material. His backbone became a mountain ridge. His ribs became the slopes. His flesh became the earth's fatness. His feathers became vegetation. His intestines became clouds. This is not metaphor in the way Western theology uses metaphor. The Tahitian chant means it literally: the world is composed of god-stuff. There is no separation between creator and creation because the creator dismantled himself to make the creation. Moerenhout, who recorded Tahitian theology in the 1830s before missionary suppression was complete, recognized the philosophical weight of this: a supreme deity who achieves omnipresence not by hovering above the world but by becoming it. Taʻaroa's natures, the chant says, were 'beyond count.' He was above, below, and in stone. He was a god's house — his backbone the ridgepole, his ribs the rafters. The metaphor of architecture and anatomy fused is strikingly precise. Every building, every body, echoed the original sacrifice. Taʻaroa was known across Polynesia under cognate names — Tangaroa in New Zealand, Tagaloa in Samoa — but nowhere was his creation myth rendered with the visceral, anatomical detail that the Tahitian version preserves."
    },
    {
      "id": "atea",
      "name": "ʻAtea",
      "title": "The Bright Sky",
      "group": "creator",
      "description": "ʻAtea is light itself made personal — the god of brightness and open space who emerged when Taʻaroa broke the cosmic egg and the first illumination entered the void. The name means 'clear space' or 'brightness,' and ʻAtea appears across Polynesia in cognate forms: Wakea in Hawaiʻi, Vatea in the Cook Islands, Atea in the Marquesas and Tuamotus. In Tahitian cosmogony, ʻAtea occupies the role of Sky Father — the vast canopy that separated from Papa, the Earth Mother, to allow room for life. This is the same myth that appears from Greece (Ouranos and Gaia) to New Zealand (Rangi and Papa), but the Tahitian version carries a distinctive emphasis: ʻAtea is not merely the sky as a ceiling but the sky as possibility. Open space. Room to move. The fact that the Polynesian word for this god also means 'distance' and 'expanse' is not coincidental — these were people whose theology was shaped by the open ocean, where the sky is the dominant fact of existence. In the Tuamotuan creation chants, ʻAtea and Faʻahotu (his wife) together produce the first gods, and the tension between ʻAtea's luminous expansion and the dark enclosure of Rumia (Taʻaroa's shell) structures the entire cosmogony as a movement from confinement to openness. For a seafaring culture that launched voyaging canoes from Raʻiātea to Hawaiʻi — a journey of over 2,500 miles across open ocean — the theological elevation of open space to divinity makes functional sense. You worship what you navigate by. You sanctify what you depend on. ʻAtea is the god who made the sky worth reading."
    },
    {
      "id": "oro",
      "name": "ʻOro",
      "title": "God of War and the Arts",
      "group": "major",
      "description": "ʻOro is the most consequential deity in late-period Tahitian religion — the god of war whose cult, centered at the great marae of Taputapuātea on Raʻiātea, effectively displaced the older worship of Taʻaroa and reorganized Society Islands politics around a single sacred site. His origin story is telling: ʻOro was the son of Taʻaroa, born at Opoa on Raʻiātea, and his worship spread outward from that island until Taputapuātea became the supreme temple of Eastern Polynesia. Chiefs from Tahiti, Bora Bora, Huahine, and beyond were required to bring offerings there. Human sacrifice was central to his rites — the red feather girdle (maro ʻura), the most sacred object in Tahitian religion, was consecrated with human victims at ʻOro's altar. But ʻOro was not merely a war god. In times of peace, he became the patron of the Arioi society — a transformation that European observers found baffling and that remains one of the most psychologically interesting features of Polynesian religion. The same deity who demanded human sacrifice also presided over dance, theater, poetry, and satire. The Arioi performed in his name, traveling from island to island with elaborate theatrical productions. This duality is not contradiction; it is compression. ʻOro governed the two activities that most require the surrender of individual identity: warfare, where you kill or die for the collective, and performance, where you become someone else for the audience. Both are ecstatic states. Both dissolve the boundary of the self. The missionaries who arrived in the late eighteenth century recognized ʻOro's cult as the political spine of the islands and targeted it specifically. They were right to see it as dangerous to their project: ʻOro's worship unified the Society Islands into a network of obligation and spectacle that had no equivalent in Protestant ecclesiology."
    },
    {
      "id": "tane",
      "name": "Tāne",
      "title": "God of Beauty and Craftsmen",
      "group": "major",
      "description": "Tāne is the god of beauty, light, and skilled craftsmanship — the deity who, in the Tahitian creation sequence, was called forth as the first artisan, the one who gave form to what Taʻaroa had made from raw material. He placed the sun, the moon, and the stars in the sky. Teuira Henry's texts describe Tāne adorning the heavens the way a craftsman decorates a great house: pearls of light studded into the dark ceiling of the dome that Taʻaroa's shell had become. This image — the sky as decorated architecture, the stars as ornamental work by a divine artisan — runs through Polynesian cosmology and reveals something about how these cultures understood beauty: not as an abstraction but as a technical achievement. Beauty is something made by someone with skill. Tāne is cognate with the New Zealand Tāne Mahuta (god of forests and birds) and the Hawaiian Kāne (god of fresh water and living things), but the Tahitian emphasis on craftsmanship is distinctive. He is not primarily a nature god here; he is the god of people who make things well. In a culture that produced the double-hulled voyaging canoe — one of the most sophisticated watercraft in premodern history — and the tapa cloth and carved tiki that European collectors immediately recognized as high art, the elevation of craftsmanship to divine status is not decorative theology. It is a statement about what the Society Islanders considered sacred: the act of shaping raw material into something that works and, simultaneously, something that is beautiful. Tāne was one of the four great gods (with Taʻaroa, Tū, and Roʻo) worshipped across the Society Islands before ʻOro's cult rose to prominence, and his worship persisted in the artisan traditions long after the missionaries suppressed the public temples."
    },
    {
      "id": "tu",
      "name": "Tū",
      "title": "God of War (the Elder)",
      "group": "major",
      "description": "Tū is the older god of war in the Tahitian pantheon — one of the four foundational atua alongside Taʻaroa, Tāne, and Roʻo — whose role was gradually eclipsed by the rise of ʻOro's cult at Taputapuātea. The displacement is historically significant: it marks a shift in Society Islands theology from an older, pan-Polynesian divine order to a specifically Raʻiātea-centered system organized around ʻOro's marae. Tū is cognate with Kū in Hawaiʻi (the war god to whom the great heiau temples were dedicated, who demanded human sacrifice, and whose worship was abolished by Kamehameha II in 1819) and Tūmatauenga in Aotearoa (the fierce god of war, the only one of Rangi and Papa's sons to advocate killing their parents to separate earth and sky). The cognate network tells you how old Tū is: he was already established before the Polynesian dispersal from the Society Islands, carried in the canoes to every corner of the Triangle. That ʻOro supplanted him in Tahiti itself is one of the few cases in Polynesian religion where we can track a major theological revolution in something like real time. It happened, as best scholars can reconstruct, in the centuries just before European contact, when the Taputapuātea complex consolidated religious authority. Tū did not disappear; he was absorbed. His functions were folded into ʻOro's domain. But the fact that the Polynesians who sailed to Hawaiʻi and Aotearoa carried the older Tū/Kū tradition with them and developed it independently means that Tū preserves a snapshot of Tahitian religion from before the ʻOro reformation — a theological fossil embedded in the daughter cultures."
    },
    {
      "id": "roo",
      "name": "Roʻo",
      "title": "God of Agriculture and Peace",
      "group": "major",
      "description": "Roʻo is the Tahitian god of agriculture, fertility, and peace — the fourth of the great atua, whose domain covered everything that grows in the soil and the conditions required for it to grow: rainfall, seasonal regularity, and the absence of war. His cognates across Polynesia — Rongo in New Zealand and the Cook Islands, Lono in Hawaiʻi — share this association, and the pattern reveals something fundamental about how Polynesians organized their theology. The four great gods divide the world into complementary domains: Taʻaroa holds the origin, Tāne holds beauty and skill, Tū holds war, and Roʻo holds what war destroys. Agriculture requires peace. Cultivation requires that no one burns your fields. Roʻo is the god of the precondition. In Hawaiʻi, Lono's festival — the Makahiki — was a four-month season of peace, games, and tribute collection during which warfare was forbidden, and Captain Cook arrived during this festival in 1779, an accident of timing that tangled European contact with indigenous theology in ways that scholars are still untangling. The Tahitian Roʻo did not generate a festival of that scale, but his role as the god who watches over the planted earth meant his worship was embedded in the agricultural calendar: planting, tending, harvest. He is the quietest of the four great gods, and that quietness is the point. Roʻo governs what happens when no one is fighting, when no great events occur, when the breadfruit ripens on schedule and the taro grows in the irrigated terraces. In a theological system dominated by ʻOro's spectacular violence and Taʻaroa's cosmic drama, Roʻo holds the ordinary. Every civilization eventually discovers that the ordinary is what sustains it."
    },
    {
      "id": "hina",
      "name": "Hina",
      "title": "The Moon Goddess",
      "group": "nature",
      "description": "Hina is the most widespread female deity in Polynesia — present from Hawaiʻi to Aotearoa, from Samoa to the Tuamotus, always associated with the moon, always connected to women's work, always carrying a story about leaving. In Tahitian tradition, Hina was a canoeist who loved paddling so much that she sailed all the way to the moon and, finding it suited her, stayed there. The Hawaiian word for moon, mahina, derives from her name. Teuira Henry recorded multiple Hina figures in the Tahitian material — Hina-faʻauru-vaʻa (Hina the canoe pilot), Hina-tu-a-uta (Hina of the land), Hina-tu-a-tai (Hina of the sea) — suggesting that Hina is less a single goddess than a category of divine femininity, a name applied to any powerful female spiritual force. This multiplicity is itself significant. Where the male gods tend toward singularity and specificity (ʻOro rules war, Tāne rules craft), Hina proliferates. She is the moon and the tapa-beater and the navigator and the mother of Māui. She governs tapa cloth production — the beating of bark into fabric — which was the primary textile art of Polynesia and exclusively women's work. The rhythmic pounding of the tapa beater against the bark echoes the regularity of the lunar cycle, and the connection is not accidental: Hina governs what is regular, cyclical, and productive. In the myths where Hina departs — sailing to the moon, leaving an unsatisfactory husband — she models something the male gods rarely do: the right to leave. She is the deity of departure by choice, not exile. For a culture that understood departure as sacred (every great voyage began as someone's decision to leave), Hina's theology of chosen departure carries real weight."
    },
    {
      "id": "ru",
      "name": "Rū",
      "title": "The God Who Raised the Sky",
      "group": "nature",
      "description": "Rū is the god who pushed the sky upward from the earth, creating the space in which life could exist. The myth appears across Polynesia in variant forms — in some versions Rū is aided by other gods, in some he acts alone, in the Cook Islands version he grows bent-backed from the effort and remains stooped forever — but the Tahitian tradition, as recorded by Henry and cross-referenced in Moerenhout's earlier accounts, places Rū as Hina's brother and traveling companion. Together they voyaged in the canoe Te-apori (The Hull), circumnavigating the known world. Rū is a figure whose myth operates on two registers simultaneously. On the cosmological level, he performs the essential act of separation — prying apart the sky father and earth mother so that light and life can enter the space between. This is the foundational gesture in dozens of mythologies worldwide: the creation of habitable space requires that something unified be broken apart. On the human level, Rū is a voyager. He sails. He navigates. And the connection between these two registers is not decorative: the person who raises the sky and the person who sails beneath it are doing the same thing. Both are creating navigable space. Both are making it possible to move. For the Polynesians who departed Raʻiātea in double-hulled canoes and crossed thousands of miles of open ocean using star navigation, wind patterns, and wave reading, the myth of Rū raising the sky was not an abstract cosmogony. It was a charter for what they did. The sky had to be lifted so the stars could be read. The space had to be opened so the canoes could sail. Rū's bent back in the Cook Islands version is a detail that resonates: the god who made travel possible was permanently damaged by the effort. The Polynesians knew what voyaging cost."
    },
    {
      "id": "maui",
      "name": "Māui",
      "title": "The Trickster Demigod",
      "group": "nature",
      "description": "Māui is the great trickster of Polynesian mythology — a demigod, not a full god, whose exploits span the entire Pacific. He fished up islands from the ocean floor with a magical fishhook. He snared the sun and beat it until it agreed to move slowly, giving humanity longer days. He stole fire from the underworld and gave it to people. He died trying to win immortality for humanity by crawling into the body of the death goddess Hine-nui-te-pō, who crushed him when she awoke. In Tahitian tradition, Māui was a wise man and prophet, a priest at the marae who, when the sun set too early for his ritual work to be completed, seized the sun's rays and held them until he was finished. The Tahitian version is more restrained than the New Zealand or Hawaiian variants — Māui here is closer to a culture hero than a cosmic rebel — but the core pattern holds: Māui is the figure who refuses to accept the conditions he was given. The sun moves too fast, so he slows it. The ocean covers the land, so he fishes up islands. Humans die, so he tries to defeat death. He fails at the last task, and that failure is the point. Māui represents the human capacity to reshape the world through cleverness rather than power, and the limit of that capacity. He can change the terms of existence but not its final condition. The Tahitian name Ao-ao-ma-raʻi-a, given to Māui as the discoverer of fire, connects him to the practical transmission of technology — he taught the art of making fire by friction of wood, which is to say he taught the art that made civilization possible. Māui is not worshipped in the way the atua are worshipped. He is told. His medium is story, not ritual, and the fact that his stories traveled intact from Raʻiātea to every corner of the Polynesian Triangle testifies to the narrative power of a figure who is perpetually almost-divine, perpetually overreaching, perpetually necessary."
    },
    {
      "id": "arioi",
      "name": "The Arioi",
      "title": "The Sacred Society of ʻOro",
      "group": "cultural",
      "description": "The Arioi were not a deity but a religious order — a society of performers, warriors, and devotees of ʻOro that functioned as a sacred theater company with genuine political power across the Society Islands. Their inclusion in a pantheon is justified because European observers and Polynesian informants alike treated them as semi-divine: possession by ʻOro was the entry requirement, and members advanced through eight ranked grades by demonstrating skill in dance, oratory, satire, and ritual performance. Each island had its own Arioi lodge associated with a local marae, but the supreme leader was always based on Raʻiātea, at Taputapuātea, because that was where ʻOro's authority originated. The Arioi traveled between islands performing elaborate theatrical works — comedies, dramas, satirical pieces that mocked chiefs and commoners alike — and their arrival at any island triggered a festival. They were exempt from many social rules. They practiced infanticide within the order, a detail that horrified missionaries and that scholars have debated for two centuries: was it population control, a renunciation of family ties in favor of the collective, or something else entirely? What is clear is that the Arioi represent an institution with no precise equivalent in any other Polynesian culture or, arguably, in any culture worldwide. A hereditary priesthood is common. A warrior class is common. A performance tradition is common. An institution that fuses all three — where the same people who conduct human sacrifice at ʻOro's altar also perform satirical theater that mocks the powerful — is not common. The Arioi compressed into a single social body the functions that most civilizations distribute across separate institutions: church, army, and theater. Admission required beauty, knowledge of sacred texts, and performance skill, evaluated while the candidate was in a trance state. The highest-ranking Arioi were tattooed from head to foot, the ink itself a record of achievement. When the missionaries dismantled the Arioi system in the early nineteenth century, they removed not just a religious order but the archipelago's primary mechanism for inter-island cultural exchange, political satire, and artistic training. The loss was total, and the Society Islands have never replaced it."
    }
  ]
}