{
  "golden-age": "Before the falling object, the world is defined by concealment. Anything abnormal, impure, or not meant to be known is hidden. The unknown is erased, denied, contained. This is the Men-in-Black motif: memory erasure, secrecy, containment, and the suppression of knowledge about what may be coming. The world remains stable because the fallen light has not yet been publicly acknowledged. The sky holds its secrets.",
  "falling-star": "The manuscript makes the equivalence explicit: \"When a meteor or a UFO crashes onto Earth, it's as if the universe itself has sent a mysterious package to humanity.\" A UFO is the modern falling star. It is literally an Unidentified Flying Object — a light in the sky whose nature is unknown. \"The descent of meteors and UFOs is often a spectacle of light… a beacon drawing people to the impact site.\" The sky sends a luminous object, and humanity follows the light.",
  "impact-crater": "The ritual begins when the object hits the ground. \"These are stories of lights that fall from the sky that are tracked down for their advanced materials and technology.\" The crater becomes the modern stone. Inside the crater lie the craft, advanced materials, advanced technology, and sometimes bodies. \"Sometimes figures are found in the impact craters who represent this advanced technology.\" These beings are paradoxical: mortal, because they are found dead, and divine, because they came from the heavens. The crater also becomes a site of planting: \"The impact of a UFO… can be seen as a form of 'seeding.'\" The future is planted at the crash site.",
  "forge": "Now begins the modern forge. The manuscript is clear about the stakes: \"A crashed spacecraft can radically alter the trajectory of a civilization.\" And the meteoric parallel holds: \"Meteoric iron introduced a disruptive technological edge to those who possessed it.\" This stage becomes one of reverse engineering, experimentation, adaptation, and weaponization. Extracting the being from the crater mirrors extracting the technology from the craft. The modern smith becomes the scientist.",
  "quenching": "A recurring image appears in the manuscript: UFOs are associated with water. \"Ship wreck like meteor… the ship goes under water.\" The imagery persists of craft submerging beneath the surface, emerging from water, or existing in the deep. The metallurgical symbolism remains intact: fire, then impact, then water. The fallen star enters the cooling bath.",
  "integration": "The paradox deepens. \"The possibility that a being… might be discovered at the crash site adds another layer of complexity.\" Celestial beings arrive, yet are found dead. Divine origin meets mortal limitation. Humanity must integrate technology beyond understanding, bodies from the heavens, and knowledge without context. \"These celestial gifts offer materials or technology beyond the current capabilities of the society that discovers them.\" Power precedes knowledge.",
  "drawing": "The motivation is stated directly: \"Technology that could give you and your allies an edge in a larger conflict.\" This stage represents deployment — military application, strategic advantage, and technological supremacy. The fallen technology becomes operational.",
  "new-age": "The myth culminates in a vision of a new era. \"The arrival of either a meteor or a UFO can be a disruptive event, shaking the foundations of the societies that encounter them.\" This becomes the fantasy of an age led by those who recovered the technology — an era defined by disruption, power imbalance, technological transformation, and civilizational change. The falling star becomes the foundation of a new technological age."
}
